MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_eth.c
  * @brief   This file provides ETH (Ethernet) peripheral services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ---------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"


/** @addtogroup STM32C5XX_HAL_Driver
  * @{
  */

#if defined(ETH1)
#if defined (USE_HAL_ETH_MODULE) && (USE_HAL_ETH_MODULE == 1UL)

/** @addtogroup ETH
  * @{
  */
/** @defgroup ETH_Introduction ETH Introduction
  * @{
The Ethernet peripheral enables devices to transmit and receive data over Ethernet in
compliance with the IEEE 802.3-2002 standard.<br/>
The Ethernet peripheral provides a configurable, flexible interface to meet the needs of various
applications and customers.
It supports two industry-standard interfaces to the external physical layer (PHY): the default media-independent
interface (MII) defined in the IEEE 802.3 specifications and the reduced media-independent interface (RMII).
It can be used in a number of applications such as switches and network interface cards.<br />
In addition to the default interfaces defined in the IEEE 802.3 specifications, the Ethernet peripheral supports several
industry-standard interfaces to the PHY.
It is compliant with the following standards:<br/>
  - IEEE 802.3-2015 for Ethernet MAC and media independent interface (MII)
  - IEEE 1588-2008 for precision networked clock synchronization (PTP)
  - IEEE 802.1AS-2011 and 802.1-Qav-2009 for Audio Video (AV) traffic
  - IEEE 802.3az-2010 for Energy Efficient Ethernet (EEE)
  - AMBA 2.0 for AHB slave port
  - AMBA4 for AXI master port
  - RGMII specification version 2.6 from HP/Marvell
  - RMII specification version 1.2 from RMII consortium

# Main features
The software allows use of all features offered by the Ethernet hardware IP.<br/>
The main features supported by the Ethernet HAL driver are summarized below:
- Configure MAC, MTL and DMA parameters
- Transmit packets in polling and interrupt mode
- Receive packets in polling and interrupt mode
- Configure and enable MAC filters
- Configure and enable PTP
- Configure and enable ARP offload
- Manage multi-queuing in transmission and reception if supported.
    - Manage queue priorities
- Configure and enable Audio/Video (AV) features if supported:
     - Select AV Queues
     - IEEE 802.1-Qav: Credit-Based Shaper (CBS) algorithm
- Configure and enable TSN features if supported:
     - IEEE 802.1Qbv-2015: Enhancements to Scheduling Traffic
     - IEEE 802.1Qbu/802.3br: Frame preemption and Interspersing Express Traffic
     - Time-based scheduling (TBS)
- Detect and manage errors.
  */
/**
  * @}
  */

/** @defgroup ETH_How_To_Use ETH How To Use
  * @{
# The HAL ETH driver can be used as follows:

## Initialization and Configuration:
- Declare a hal_eth_handle_t handle structure, for example:
  @verbatim
  hal_eth_handle_t  heth;
  @endverbatim
- Set the ETH instance number to initialize in the heth handle.
- Initialize the ETH low level resources:
  - Enable the Ethernet interface clock using
    + HAL_RCC_ETH1_EnableClock()
    + HAL_RCC_ETH1TX_EnableClock()
    + HAL_RCC_ETH1RX_EnableClock()
    + HAL_RCC_ETH1CK_EnableClock()
  - Initialize the related GPIO clocks.
  - Configure Ethernet pinout.
  - Configure Ethernet NVIC interrupt (in Interrupt mode).
- Call HAL_ETH_Init() API to initialize the Ethernet peripheral (MAC, DMA, MTL and MDIO).
- Declare a hal_eth_config_t configuration structure, for example:
  @verbatim
  hal_eth_config_t  eth_config;
  @endverbatim
- Set the ETH global configuration parameters in the eth_config structure.
  * Set the MAC Address.
  * Select the MII/RMII/RGMII interface to use.
- Call HAL_ETH_SetConfig() API to configure the Ethernet peripheral (MAC, MTL and DMA). Default MAC, MTL and
  DMA configurations are applied.
## Channel Configuration:
- Configure and start each Rx and Tx Channel separately. The steps below apply to any Ethernet channel type
  (Rx or Tx).
- All HAL ETH Channel APIs take the channel identifier argument @ref ETH_Channel_Identifiers
- Configure and start the HAL ETH Tx/Rx Channel as follows:
  - Declare a hal_eth_tx_channel_config_t / hal_eth_rx_channel_config_t channel configuration structure, for example:
    @verbatim
    hal_eth_tx_channel_config_t / hal_eth_rx_channel_config_t ch_config;
    @endverbatim
  - Call HAL_ETH_GetConfigTxChannel()/HAL_ETH_GetConfigRxChannel() API to retrieve selected Tx/Rx Channel parameters.
  - Update the ETH Tx/Rx Channel configuration parameters in the ch_config structure.
    + Set the maximum number of application buffers to be held in the DMA FIFO.
    + Update the Tx/Rx DMA Channel Configuration.
    + Update the Tx/Rx MTL Queue Configuration.
    + Update the Tx/Rx FIFO Event Configuration.
  - Call HAL_ETH_SetConfigTxChannel()/HAL_ETH_SetConfigRxChannel() API to configure the selected Tx/Rx Channel.
  - Retrieve memory allocation requirements to allocate memory for descriptors and application buffers to be used for
    reception and/or transmission.
    + Declare a hal_eth_channel_alloc_needs_t channel allocation info structure, for example:
      @verbatim
      hal_eth_channel_alloc_needs_t  alloc_needs;
      @endverbatim
    + Call HAL_ETH_GetChannelAllocNeeds() API to retrieve selected channel allocation information.
    + Use the allocation information to start the selected channel. The information includes:
      - The minimum memory size in bytes required by the driver for the selected channel.
      - The minimum address alignment for memory to be used by the driver.
## Frame Reception:
Ethernet data reception is asynchronous, so call the following API to start the listening mode for each initialized
Rx Channel(s):
  - HAL_ETH_StartChannel():
    + This API starts the MAC and DMA reception process. Configure the interrupt management mode and arguments.
    + Provide memory buffers to transfer the received frame data.
    + The ETH Rx Allocate Callback `p_rx_allocate_cb` is called to allocate buffers for reception.
      @note Ensure buffer(s) respect memory allocation requirements (alignment) provided
            by HAL_ETH_GetChannelAllocNeeds() API call.
  - When data is received, the ETH Data Callback `p_data_cb` (or `HAL_ETH_DataCallback`) is invoked if the channel is
    configured in interrupt mode.
  - Call the HAL_ETH_ExecDataHandler() API to get the received data (in Thread execution mode).
  - The `p_rx_complete_cb` and `p_rx_allocate_cb` callbacks are called during `HAL_ETH_ExecDataHandler` execution to
    notify about a received frame and request memory for the next frame reception.
    @note Do not call any blocking service(s) while running in handler execution mode.
  - Call HAL_ETH_ExecDataHandler() API to retrieve received data at any time in the context of the application thread.
    @note Do not call HAL_ETH_ExecDataHandler() API in the Handler execution mode. This breaks driver behaviour.
    Implement a dedicated worker thread and trigger it to retrieve the received data (in Thread execution mode).
## Communication with an external PHY device:
  - HAL_ETH_MDIO_UpdateClockRange(): Update the MDIO clock range.
  - HAL_ETH_MDIO_SetOpAttributes(): Configure Ethernet MDIO command attributes.
  - HAL_ETH_MDIO_C22ReadData(): Read a register from an external PHY using Clause 22 method.
  - HAL_ETH_MDIO_C22WriteData(): Write data to an external PHY register using Clause 22 method.
  - HAL_ETH_MDIO_C45ReadData(): Read a register from an external PHY using Clause 45 method.
  - HAL_ETH_MDIO_C45WriteData(): Write data to an external PHY register using Clause 45 method.
  - HAL_ETH_MDIO_C45ReadDataRange(): Read a range of registers from an external PHY using Clause 45 method.
  - HAL_ETH_UpdateConfigLink(): Apply MAC link speed/duplex using hal_eth_link_config_t after link configuration
    change. It can result from auto-negotiation between PHYs, or from a manual or managed change of settings.
## Advanced Ethernet Configurations:
### Configure the Ethernet MAC after ETH peripheral configuration is done:
  - HAL_ETH_MAC_GetConfig(): Get MAC current configuration into hal_eth_mac_config_t.
  - HAL_ETH_MAC_SetConfig(): Set MAC configuration based on hal_eth_mac_config_t.
### Configure the Ethernet DMA after ETH peripheral configuration is done:
  - HAL_ETH_DMA_GetConfig(): Get DMA current configuration into hal_eth_dma_config_t.
  - HAL_ETH_DMA_SetConfig(): Set DMA configuration based on hal_eth_dma_config_t.
### Configure the Ethernet MTL after ETH peripheral configuration is done:
  - HAL_ETH_MTL_GetConfig(): Get MTL current configuration into hal_eth_mtl_config_t.
  - HAL_ETH_MTL_SetConfig(): Set MTL configuration based on hal_eth_mtl_config_t.
### Configure ARP offload module after ETH peripheral configuration is done:
  - HAL_ETH_EnableARPOffload(): Enable ARP offload.
  - HAL_ETH_DisableARPOffload(): Disable ARP offload.
  - HAL_ETH_IsEnabledARPOffload(): Check whether ARP offloading is enabled.
  - HAL_ETH_SetARPTargetIP(): Set the ARP Target IP address.
### Configure MAC power down module:
  - HAL_ETH_EnterPowerDownMode(): Enter the Power down mode.
  - HAL_ETH_ExitPowerDownMode(): Exit from the Power down mode.
  - HAL_ETH_SetRemoteWakeUpPcktFilter(): Set the Remote WakeUp filter.
### Configure Energy Efficient Ethernet module:
  - HAL_ETH_EnterLPIMode(): Enter the Low Power Idle (LPI) mode.
  - HAL_ETH_ExitLPIMode(): Exit the Low Power Idle (LPI) mode.

