MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
## Callback registration:
The ETH HAL driver supports two distinct sets of callbacks:

1. **Mandatory callbacks**
   Register these callbacks in the application.
   These callbacks are not delimited by the `USE_HAL_ETH_REGISTER_CALLBACKS` compilation flag and have no weak default
   implementations.

2. **Optional callbacks**
   These callbacks are delimited by the `USE_HAL_ETH_REGISTER_CALLBACKS` compilation flag and are optional.
   When this flag is enabled, the integration can override the default weak implementations by registering
   its own callbacks.

By default, after a call to `HAL_ETH_Init()` and while the state is `HAL_ETH_STATE_INIT`, all callbacks that provide
weak default implementations are mapped to their corresponding weak functions (for example `HAL_ETH_ErrorCallback()`,
`HAL_ETH_WakeUpCallback()`).

Register or unregister callbacks only when the driver is in `HAL_ETH_STATE_CONFIGURED` state.

If `USE_HAL_ETH_REGISTER_CALLBACKS` is set to `0` or not defined, the callback registration mechanism (for the callbacks
guarded by this compile switch) is disabled and these callbacks remain bound to their weak implementations.

> **Note:**
> The following channel-related callbacks do not have weak default implementations and their registration is
> therefore mandatory:
> - `HAL_ETH_RegisterChannelRxAllocateCallback()`
> - `HAL_ETH_RegisterChannelRxCptCallback()`
> - `HAL_ETH_RegisterChannelTxCptCallback()`
>
> Their implementation is not delimited by the `USE_HAL_ETH_REGISTER_CALLBACKS` compilation flag. Register appropriate
> callbacks for each used channel.

The HAL ETH driver provides the following callback registration functions:

- `HAL_ETH_RegisterChannelRxAllocateCallback()` : Register RX buffer allocation callback for a specific channel
  (mandatory, no weak default).
- `HAL_ETH_RegisterChannelRxCptCallback()`      : Register RX complete callback for a specific channel
  (mandatory, no weak default).
- `HAL_ETH_RegisterChannelTxCptCallback()`      : Register TX complete callback for a specific channel
  (mandatory, no weak default).
- `HAL_ETH_RegisterDataCallback()`              : Register data transfer/processing callback.
- `HAL_ETH_RegisterWKUPCallback()`              : Register Ethernet wake-up (power management) callback.
- `HAL_ETH_RegisterPMTCallback()`               : Register Power Management Trigger (PMT) callback.
- `HAL_ETH_RegisterEEECallback()`               : Register Energy Efficient Ethernet (EEE) callback.
- `HAL_ETH_RegisterErrorCallback()`             : Register error notification callback.
- `HAL_ETH_RegisterEventCallback()`             : Register generic Ethernet event callback.
- `HAL_ETH_RegisterCacheInvalidateCallback()`   : Register cache invalidate operation callback.
- `HAL_ETH_RegisterCacheFlushCallback()`        : Register cache flush operation callback.
- `HAL_ETH_RegisterChannelRxEventCallback()`    : Register generic RX event callback for a specific channel.
- `HAL_ETH_RegisterChannelTxEventCallback()`    : Register generic TX event callback for a specific channel.

## HAL ETH Driver State and Errors:

- Use HAL_ETH_GetState() function to return the global HAL ETH driver state.
- Use HAL_ETH_GetChannelState() function to return the state of a specific ETH channel.
- When enabled, use HAL_ETH_GetLastErrorCodes() to retrieve the last recorded ETH error codes.

If the compilation flag `USE_HAL_ETH_GET_LAST_ERRORS` is set to 1, the function
`HAL_ETH_GetLastErrorCodes()` is available and allows the application to read back the last error codes
recorded internally by the ETH driver.

If `USE_HAL_ETH_GET_LAST_ERRORS` is set to 0 or not defined, this function is not compiled and
the last error history feature is not available.
  */
/**
  * @}
  */

/** @defgroup ETH_Configuration_Table ETH Configuration Table
  * @{
# Configuration inside the ETH driver

Config defines                  | Description     | Default value   | Note
--------------------------------| --------------- | --------------- | ------------------------------------------------
PRODUCT                         | from IDE        |        NA       | The selected device (e.g. STM32C5XXxx)
USE_HAL_ETH_MODULE              | from hal_conf.h |        1        | Allows use of the HAL ETH module.
USE_ASSERT_DBG_PARAM            | from IDE        |      None       | Allows use of the assert check parameters.
USE_ASSERT_DBG_STATE            | from IDE        |      None       | Allows use of the assert check states.
USE_HAL_CHECK_PARAM             | from hal_conf.h |        0        | Allows use of the run-time checks parameters.
USE_HAL_CHECK_PROCESS_STATE     | from hal_conf.h |        0        | Enables atomic access to process state check.
USE_HAL_ETH_CLK_ENABLE_MODEL    | from hal_conf.h |HAL_CLK_ENABLE_NO| Enables gating of the peripheral clock.
USE_HAL_ETH_GET_LAST_ERRORS     | from hal_conf.h |        0        | Allows use of the error code mechanism.
USE_HAL_ETH_USER_DATA           | from hal_conf.h |        0        | Allows use of user data.
USE_HAL_ETH_ATOMIC_CHANNEL_LOCK | from hal_conf.h |        0        | Enables atomic access to channel resources.
USE_HAL_ETH_REGISTER_CALLBACKS  | from hal_conf.h |        0        | Enables the registration of callbacks.
USE_HAL_ETH_MAX_TX_CH_NB        | from hal_conf.h |     Defined     | User-defined number of Transmit Channels.
USE_HAL_ETH_MAX_RX_CH_NB        | from hal_conf.h |     Defined     | User-defined number of Receive Channels.
  */
/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @defgroup ETH_Private_Constants ETH Private Constants
  * @{
  */
#define ETH_MACQTXFCR_MASK              0xFFFF00F2UL            /*!< ETH_MACQTXFCR Register Mask value */
#define ETH_GIANT_PKT_SIZE_LIMIT_BYTE    (1518UL)               /*!< Rx Giant Packet received size limit */
#define ETH_CHANNEL_STATE_UNLOCKED       (0x00000000UL)         /*!< Channel is unlocked and available for access */
#define ETH_CHANNEL_STATE_LOCKED         (0x00000001UL)         /*!< Channel is locked and being accessed */

#ifndef ETH_SWRESET_TIMEOUT
#define ETH_SWRESET_TIMEOUT_MS           (1000UL)               /*!< Timeout value for ETH software reset
                                                                     - unit: milliseconds. */
#endif /* ETH_SWRESET_TIMEOUT */

#ifndef ETH_TX_Q_FLUSH_TIMEOUT
#define ETH_TX_Q_FLUSH_TIMEOUT           (1000UL)               /*!< Timeout value for Tx queue flush operation
                                                                     - unit: milliseconds. */
#endif /* ETH_TX_Q_FLUSH_TIMEOUT */

#ifndef ETH_TX_DMA_STOP_TIMEOUT
#define ETH_TX_DMA_STOP_TIMEOUT          (1000UL)               /*!< Timeout value for Tx DMA stop operation
                                                                     - unit: milliseconds. */
#endif /* ETH_TX_DMA_STOP_TIMEOUT */

