MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
#ifndef ETH_RX_DMA_STOP_TIMEOUT
#define ETH_RX_DMA_STOP_TIMEOUT          (1000UL)               /*!< Timeout value for Rx DMA stop operation
                                                                     - unit: milliseconds. */
#endif /* ETH_RX_DMA_STOP_TIMEOUT */

#ifndef ETH_MDIO_BUS_TIMEOUT
#define ETH_MDIO_BUS_TIMEOUT             (1000UL)               /*!< Timeout value for MDIO bus operations
                                                                     - unit: milliseconds. */
#endif /* ETH_MDIO_BUS_TIMEOUT */

#ifndef ETH_DMA_RX_BUFFER_SIZE_BYTE
#define ETH_DMA_RX_BUFFER_SIZE_BYTE      (1520UL)               /*!< ETH receive buffer size in bytes. */
#endif /* ETH_DMA_RX_BUFFER_SIZE_BYTE */

/** Minimum MDC clock frequency: 1 MHz */
#define ETH_MDC_CLK_MIN_HZ                   (1000000UL)
/** Maximum MDC clock frequency: 2.5 MHz */
#define ETH_MDC_CLK_MAX_HZ                   (2500000UL)

/*!< HAL ETH MAC MDC Clock Range selection defines */
#define ETH_MDIOAR_CSR_CR_SEL_0          (0x00000000UL)        /*!< MDC Clock Range LOW SPEED 0 */
#define ETH_MDIOAR_CSR_CR_SEL_1          (0x00000100UL)        /*!< MDC Clock Range LOW SPEED 1 */
#define ETH_MDIOAR_CSR_CR_SEL_2          (0x00000200UL)        /*!< MDC Clock Range LOW SPEED 2 */
#define ETH_MDIOAR_CSR_CR_SEL_3          (0x00000300UL)        /*!< MDC Clock Range LOW SPEED 3 */
#define ETH_MDIOAR_CSR_CR_SEL_4          (0x00000400UL)        /*!< MDC Clock Range LOW SPEED 4 */
#define ETH_MDIOAR_CSR_CR_SEL_5          (0x00000500UL)        /*!< MDC Clock Range LOW SPEED 5 */
#define ETH_MDIOAR_CSR_CR_SEL_6          (0x00000600UL)        /*!< MDC Clock Range LOW SPEED 6 */
#define ETH_MDIOAR_CSR_CR_SEL_7          (0x00000700UL)        /*!< MDC Clock Range LOW SPEED 7 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_0     (0x00000800UL)        /*!< MDC Clock Range HIGH SPEED 0 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_1     (0x00000900UL)        /*!< MDC Clock Range HIGH SPEED 1 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_2     (0x00000A00UL)        /*!< MDC Clock Range HIGH SPEED 2 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_3     (0x00000B00UL)        /*!< MDC Clock Range HIGH SPEED 3 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_4     (0x00000C00UL)        /*!< MDC Clock Range HIGH SPEED 4 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_5     (0x00000D00UL)        /*!< MDC Clock Range HIGH SPEED 5 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_6     (0x00000E00UL)        /*!< MDC Clock Range HIGH SPEED 6 */
#define ETH_MDIOAR_CSR_CR_FAST_SEL_7    (ETH_MACMDIOAR_CR)    /*!< MDC Clock Range HIGH SPEED 7 */

/*!< HAL ETH MAC MDC ETH Clock divider defines */
#define ETH_MDC_CLK_DIV_42                (42UL)         /*!< MDC Clock Range DIV 42   */
#define ETH_MDC_CLK_DIV_62                (62UL)         /*!< MDC Clock Range DIV 62   */
#define ETH_MDC_CLK_DIV_16                (16UL)         /*!< MDC Clock Range DIV 16   */
#define ETH_MDC_CLK_DIV_26                (26UL)         /*!< MDC Clock Range DIV 26   */
#define ETH_MDC_CLK_DIV_102               (102UL)        /*!< MDC Clock Range DIV 102   */
#define ETH_MDC_CLK_DIV_124               (124UL)        /*!< MDC Clock Range DIV 124   */
#define ETH_MDC_CLK_DIV_204               (204UL)        /*!< MDC Clock Range DIV 204   */
#define ETH_MDC_CLK_DIV_324               (324UL)        /*!< MDC Clock Range DIV 324   */

#define ETH_GOC_OPERATION_WRITE           (0x00000004UL)        /*!< GOC operation: write transaction (used to initiate
                                                                     a write access to the targeted PHY register) */
#define ETH_GOC_OPERATION_PRIAC45         (0x00000008UL)        /*!< GOC operation: post-read with address increment
                                                                     (Clause 45 MDIO post-read with auto-incremented
                                                                     address) */
#define ETH_GOC_OPERATION_READ            (0x0000000CUL)        /*!< GOC operation: read transaction (used to initiate
                                                                     a read access from the targeted PHY register) */

/** ETH_MACCR Register Mask value */
#define ETH_MACCR_MASK                    (ETH_MACCR_DM | ETH_MACCR_FES                              \
                                           | ETH_MACCR_LM | ETH_MACCR_SARC | ETH_MACCR_IPG           \
                                           | ETH_MACCR_BL | ETH_MACCR_PRELEN | ETH_MACCR_GPSLCE      \
                                           | ETH_MACCR_S2KP | ETH_MACCR_CST | ETH_MACCR_ACS          \
                                           | ETH_MACCR_JD | ETH_MACCR_ECRSFD | ETH_MACCR_DCRS        \
                                           | ETH_MACCR_DR | ETH_MACCR_WD | ETH_MACCR_JE              \
                                           | ETH_MACCR_IPC | ETH_MACCR_DO | ETH_MACCR_DC)

/** ETH_MACECR Register Mask value */
#define ETH_MACECR_MASK                  (ETH_MACECR_GPSL | ETH_MACECR_DCRCC | ETH_MACECR_SPEN      \
                                          | ETH_MACECR_USP | ETH_MACECR_EIPGEN | ETH_MACECR_EIPG)
/** ETH_MACWJBTR Register Mask value */
#define ETH_MACWJBTR_MASK                (ETH_MACWJBTR_PWE | ETH_MACWJBTR_WTO)
/** ETH_MACRXFCR Register Mask value */
#define ETH_MACRXFCR_MASK                (ETH_MACRXFCR_UP | ETH_MACRXFCR_RFE)

/** ETH Error Mask */
#define ETH_ERROR_DMA_MASK                (ETH_DMACSR_FBE | ETH_DMACSR_CDE  \
                                           | ETH_DMACSR_REB | ETH_DMACSR_TEB)

/** ETH_MTLRXQOMR Register Mask value */
#define ETH_MTLRXQXOMR_MASK               (ETH_MTLRXQOMR_DIS_TCP_EF \
                                           | ETH_MTLRXQOMR_FEP | ETH_MTLRXQOMR_FUP \
                                           | ETH_MTLRXQOMR_RSF | ETH_MTLRXQOMR_RTC)
/** ETH_MTLTXQOMR Register Mask value */
#define ETH_MTLTXQXOMR_MASK               (ETH_MTLTXQOMR_TSF | ETH_MTLTXQOMR_TTC)
/** ETH_MTLOMR Register Mask value */
#define ETH_MTLOMR_MASK                   (ETH_MTLOMR_DTXSTS)
/** ETH_DMAMR Register Mask value */
#define ETH_DMAMR_MASK                    (ETH_DMAMR_TXPR)
/** ETH MMC RX interrupt mask value */
#define ETH_MMC_RX_INTERRUPT_MASK_ALL     (0x0C020060UL)
/** ETH MMC TX interrupt mask value */
#define ETH_MMC_TX_INTERRUPT_MASK_ALL     (0x0C20C000UL)

