MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/** ETH_DMASBMR Register Mask value */
#define ETH_DMASBMR_MASK                  (ETH_DMASBMR_AAL | ETH_DMASBMR_FB | ETH_DMASBMR_MB | ETH_DMASBMR_RB)
/** ETH RX DMA Channel Event Mask */
#define ETH_RX_DMA_CH_EVENT_MASK          (ETH_DMACSR_RBU | ETH_DMACSR_RWT)
/** ETH RX MTL Channel Event Mask */
#define ETH_RX_MTL_CH_EVENT_MASK          (ETH_MTLQICSR_RXOVFIS)
/** ETH TX DMA Channel Event Mask */
#define ETH_TX_DMA_CH_EVENT_MASK          (ETH_DMACSR_TBU)
/** ETH TX MTL Channel Event Mask */
#define ETH_TX_MTL_CH_EVENT_MASK          (ETH_MTLQICSR_TXUNFIS)

/** ETH MAC event mask */
#define ETH_MAC_EVENT_MASK                (ETH_MACRXTXSR_RWT | ETH_MACRXTXSR_EXCOL | ETH_MACRXTXSR_LCOL \
                                           | ETH_MACRXTXSR_EXDEF | ETH_MACRXTXSR_LCARR | ETH_MACRXTXSR_NCARR \
                                           | ETH_MACRXTXSR_TJT)

/** PMT control bits mask: RWKPFE | GLBLUCAST | RWKPKTEN | MGKPKTEN */
#define ETH_PMT_CTRL_MASK               (ETH_MACPCSR_RWKPFE | ETH_MACPCSR_GLBLUCAST   \
                                         | ETH_MACPCSR_RWKPKTEN | ETH_MACPCSR_MGKPKTEN)
/** MAC link configuration mask: speed and duplex */
#define ETH_MAC_LINK_CONFIG_MASK        (ETH_MACCR_FES | ETH_MACCR_DM)
/** LPI transmit clock control mask: LPITCSE | LPITXA */
#define ETH_LPI_TX_CLK_MASK              (ETH_MACLCSR_LPITCSE | ETH_MACLCSR_LPITXA)
/** PMT event mask: Magic Packet received | Remote Wakeup received */
#define ETH_PMT_EVENT_MASK               (ETH_MACPCSR_MGKPRCVD | ETH_MACPCSR_RWKPRCVD)
/** LPI event mask: Tx/Rx LPI enable/exit/status bits */
#define ETH_LPI_EVENT_MASK               (ETH_MACLCSR_TLPIEN | ETH_MACLCSR_TLPIEX \
                                          | ETH_MACLCSR_RLPIEN | ETH_MACLCSR_RLPIEX \
                                          | ETH_MACLCSR_TLPIST | ETH_MACLCSR_RLPIST)
#define ETH_RWK_CMD_MASK                 (0x0FUL)          /*!< RWK command field mask (4 bits) */
#define ETH_RWK_OFFSET_MASK              (0xFFUL)          /*!< RWK offset field mask (8 bits) */
#define ETH_RWK_CRC16_MASK               (0xFFFFUL)        /*!< RWK CRC16 field mask (16 bits) */

#define ETH_MIN_DESC_CNT                 (4UL)             /*!< ETH Minimum requested desc number */
#define ETH_MAX_DESC_PER_APP_BUF_CNT     (2UL)             /*!< Max descriptor count per application buffer */
#define ETH_RX_CHANNEL_ID_POS            (16UL)            /*!< ETH the Bit position of RX channel */

#define ETH_TPS_FIELD_WIDTH_BITS         (8UL)             /*!< TX DMA process state field: width in bits and
                                                                channel mapping helpers */
#define ETH_TX_DMA_CH_STATE_MAX_IDX      (2UL)             /*!< Channels 0..2 in ETH_DMADSR */
#define ETH_RPS_FIELD_WIDTH_BITS         (8UL)             /*!< RX DMA process state field: width in bits
                                                                and channel mapping helpers */


#define ETH_DMA_TX_DESC_RF_IOC           0x80000000UL      /*!< TDES2 RF : Interrupt on Completion */
#define ETH_DMA_TX_DESC_RF_B1L           0x00003FFFUL      /*!< TDES2 RF : Buffer 1 Length MASK */
#define ETH_DMA_TX_DESC_RF_VTIR          0x0000C000UL      /*!< TDES2 RF : VLAN Tag Insertion or Replacement mask */

#define ETH_DMA_TX_DESC_RF_OWN           0x80000000UL      /*!< TDES3 RF : descriptor is owned by DMA engine */
#define ETH_DMA_TX_DESC_RF_FD            0x20000000UL      /*!< TDES3 RF : First Descriptor */
#define ETH_DMA_TX_DESC_RF_LD            0x10000000UL      /*!< TDES3 RF : Last Descriptor */
#define ETH_DMA_TX_DESC_RF_CPC           0x0C000000UL      /*!< TDES3 RF : CRC Pad Control mask  */
#define ETH_DMA_TX_DESC_RF_CIC           0x00030000UL      /*!< TDES3 RF : Checksum Insertion Control: 4 cases */
#define ETH_DMA_TX_DESC_RF_SAIC          0x03800000UL      /*!< TDES3 RF : SA Insertion Control mask */

#define ETH_DMA_RX_DESC_WBF_OWN          0x80000000UL      /*!< RDES3 WBF : descriptor is owned by DMA engine */
#define ETH_DMA_RX_DESC_WBF_CTXT         0x40000000UL      /*!< RDES3 WBF : Receive Context Descriptor */
#define ETH_DMA_RX_DESC_WBF_PL           0x00007FFFUL      /*!< RDES3 WBF : Packet Length */

#define ETH_DMA_RX_DESC_RF_OWN           0x80000000UL      /*!< RDES3 RF : descriptor is owned by DMA engine */
#define ETH_DMA_RX_DESC_RF_IOC           0x40000000UL      /*!< RDES3 RF : Interrupt Enabled on Completion */
#define ETH_DMA_RX_DESC_RF_BUF1V         0x01000000UL      /*!< RDES3 RF : Buffer 1 Address Valid */
#define ETH_DMA_TX_DESC_CTXT_OWN         0x80000000UL      /*!< RDES3 RF : descriptor is owned by DMA engine */
#define ETH_DMA_TX_DESC_CTXT_CTXT        0x40000000UL      /*!< RDES3 RF : Context Type */

#define ETH_DMA_TX_DESC_CTXT_IVTIR       0x000C0000UL      /*!< TDES3 CTXT : Inner VLAN Tag Insert or Replace Mask */
#define ETH_DMA_TX_DESC_CTXT_IVLTV       0x00020000UL      /*!< TDES3 CTXT : Inner VLAN Tag Valid */
#define ETH_DMA_TX_DESC_CTXT_VLTV        0x00010000UL      /*!< TDES3 CTXT : VLAN Tag Valid */
#define ETH_DMA_TX_DESC_CTXT_VT          0x0000FFFFUL      /*!< TDES3 CTXT : VLAN Tag */
#define ETH_DMA_TX_DESC_CTXT_IVT         0xFFFF0000UL      /*!< TDES2 CTXT : Inner VLAN Tag Mask */

#define ETH_MACMDIOAR_BUSY               ETH_MACMDIOAR_MB  /*!< MII Busy.
                                                                The application sets this bit to instruct the SMA to
                                                                initiate a Read or Write access to the MDIOS. The MAC
                                                                clears this bit after the MDIO frame transfer is
                                                                completed. */
#define ETH_MACMDIODR_DATA               ETH_MACMDIODR_MD  /*!< MII Data */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup ETH_Private_Macros ETH Private Macros
  * @{
  */
/**
  * @brief  Retrieve ETH peripheral instance from HAL handle.
  * @param  heth  Pointer to a hal_eth_handle_t structure
  * @retval Pointer to the ETH register base (ETH_TypeDef *)
  */
#define ETH_GET_INSTANCE(heth) ((ETH_TypeDef *)((uint32_t)(heth)->instance))

/**
  * @brief  Compute and return pointer to the ETH DMA channel registers for a channel index.
  * @param  heth   Pointer to a hal_eth_handle_t structure
  * @param  index  Channel index (zero-based)
  * @retval Pointer to the ETH DMA channel registers (ETH_DMA_Channel_TypeDef *)
  */
#define ETH_GET_DMA_CHANNEL(heth, index) ((ETH_DMA_Channel_TypeDef *)(((uint32_t)(heth)->instance) + \
                                                                      ETH_DMA_CHANNEL_UNIT_OFFSET +\
                                                                      (ETH_DMA_CHANNEL_UNIT_SIZE * (uint32_t)(index))))

/**
  * @brief  Compute and return pointer to the ETH MTL queue registers for a queue index.
  * @param  heth   Pointer to a hal_eth_handle_t structure
  * @param  index  MTL queue index (zero-based)
  * @retval Pointer to the ETH MTL queue registers (ETH_MTL_Queue_TypeDef *)
  */
#define ETH_GET_MTL_QUEUE(heth, index) ((ETH_MTL_Queue_TypeDef *)(((uint32_t)(heth)->instance) + \
                                                                  ETH_MTL_QUEUE_UNIT_OFFSET\
                                                                  + (ETH_MTL_QUEUE_UNIT_SIZE * (uint32_t)(index))))
/**
  * @brief  Gets the ETHERNET DMA TX Instance for selected Channel.
  * @param  heth    ETH Handle
  * @param  channel specifies the ETH Channel Index. @ref ETH_Channel_Identifiers
  * @retval The ETH DMA Instance pointer (ETH_DMA_Channel_TypeDef *).
  */
#define ETH_DMA_GET_TX_INSTANCE(heth,channel) \
  (((ETH_DMA_Channel_TypeDef *)((heth)->tx_channels[channel].p_dma_instance)))

/**
  * @brief  Gets the ETHERNET DMA RX Instance for selected Channel.
  * @param  heth    ETH Handle
  * @param  channel specifies the ETH Channel Index. @ref ETH_Channel_Identifiers
  * @retval The ETH DMA Instance pointer (ETH_DMA_Channel_TypeDef *).
  */
#define ETH_DMA_GET_RX_INSTANCE(heth,channel) \
  (((ETH_DMA_Channel_TypeDef *)((heth)->rx_channels[channel].p_dma_instance)))

/**
  * @brief  Gets the ETHERNET TX Queue MTL Instance for selected Channel.
  * @param  heth   ETH Handle
  * @param  queue  specifies the MTL Queue Index. @ref ETH_Queue_Indexes
  * @retval The ETH MTL Instance pointer (ETH_MTL_Queue_TypeDef *).
  */
#define ETH_MTL_GET_TX_INSTANCE(heth,queue) \
  (((ETH_MTL_Queue_TypeDef *)((heth)->tx_channels[queue].p_mtl_instance)))

/**
  * @brief  Gets the ETHERNET RX Queue MTL Instance for selected Channel.
  * @param  heth   ETH Handle
  * @param  queue  specifies the MTL Queue Index. @ref ETH_Queue_Indexes
  * @retval The ETH MTL Instance pointer (ETH_MTL_Queue_TypeDef *).
  */
#define ETH_MTL_GET_RX_INSTANCE(heth,queue) \
  (((ETH_MTL_Queue_TypeDef *)((heth)->rx_channels[queue].p_mtl_instance)))

/**
  * @brief  Check whether a channel identifier has exactly one bit set.
  *
  * This macro verifies that @p index is a non-zero power-of-two value.
  * It is typically used to validate Ethernet channel identifiers encoded
  * as single-bit masks (e.g. @ref HAL_ETH_TX_CHANNEL_0,
  * @ref HAL_ETH_RX_CHANNEL_0).
  *
  * The check is implemented using the classic "power of two" test:
  * - @p index must be different from 0
  * - @p index & (@p index - 1) must be equal to 0
  *
  * @param  index  Channel identifier to check. It is interpreted as
  *                a 32-bit mask (one bit per channel).
  *
  * @retval bool   true if @p index is non-zero and has exactly one bit set,
  *                false otherwise.
  *
  * @note  This macro is used internally by
  *        @ref IS_ETH_CHANNEL_TX_INDEX and
  *        @ref IS_ETH_CHANNEL_RX_INDEX to ensure that the channel
  *        index represents a single channel.
  */
#define IS_ETH_SINGLE_BIT(index) ((((uint32_t)(index)) != 0UL) \
                                  && ((((uint32_t)(index)) & (((uint32_t)(index)) - 1UL)) == 0UL))

/**
  * @brief  Check whether a TX channel identifier is valid.
  *
  * This macro validates that the given @p index corresponds to a valid
  * Ethernet TX channel mask.
  *
  * The following conditions must all hold:
  * - @p index passes @ref IS_ETH_SINGLE_BIT (i.e. exactly one bit set)
  * - @p index is greater than or equal to @ref HAL_ETH_TX_CHANNEL_0
  * - @p index is strictly less than
  *   @c (HAL_ETH_TX_CHANNEL_0 << USE_HAL_ETH_MAX_TX_CH_NB)
  *
  * Conceptually, valid TX channel identifiers are:
  * @code
  * HAL_ETH_TX_CHANNEL_0 << n   with  0 <= n < USE_HAL_ETH_MAX_TX_CH_NB
  * @endcode
  *
  * @param  index  TX channel identifier to check. It is interpreted as a
  *                single-bit mask identifying one TX channel.
  *
  * @retval bool   true if @p index is a valid TX channel identifier,
  *                false otherwise.
  *
  * @note  This macro relies on:
  *        - @ref IS_ETH_SINGLE_BIT to enforce a single-bit mask.
  *        - @ref HAL_ETH_TX_CHANNEL_0 as the base TX channel bit.
  *        - @ref USE_HAL_ETH_MAX_TX_CH_NB to limit the maximum TX channels.
  */
#define IS_ETH_CHANNEL_TX_INDEX(index) (IS_ETH_SINGLE_BIT(index) \
                                        && (((uint32_t)(index)) >= (uint32_t)HAL_ETH_TX_CHANNEL_0) \
                                        && (((uint32_t)(index)) \
                                            < (((uint32_t)HAL_ETH_TX_CHANNEL_0) << USE_HAL_ETH_MAX_TX_CH_NB)))

/**
  * @brief  Check whether a RX channel identifier is valid.
  *
  * This macro validates that the given @p index corresponds to a valid
  * Ethernet RX channel mask.
  *
  * The following conditions must all hold:
  * - @p index passes @ref IS_ETH_SINGLE_BIT (i.e. exactly one bit set)
  * - @p index is greater than or equal to @ref HAL_ETH_RX_CHANNEL_0
  * - @p index is strictly less than
  *   @c (HAL_ETH_RX_CHANNEL_0 << USE_HAL_ETH_MAX_RX_CH_NB)
  *
  * Conceptually, valid RX channel identifiers are:
  * @code
  * HAL_ETH_RX_CHANNEL_0 << n   with  0 <= n < USE_HAL_ETH_MAX_RX_CH_NB
  * @endcode
  *
  * @param  index  RX channel identifier to check. It is interpreted as a
  *                single-bit mask identifying one RX channel.
  *
  * @retval bool   true if @p index is a valid RX channel identifier,
  *                false otherwise.
  *
  * @note  This macro relies on:
  *        - @ref IS_ETH_SINGLE_BIT to enforce a single-bit mask.
  *        - @ref HAL_ETH_RX_CHANNEL_0 as the base RX channel bit.
  *        - @ref USE_HAL_ETH_MAX_RX_CH_NB to limit the maximum RX channels.
  */
#define IS_ETH_CHANNEL_RX_INDEX(index) (IS_ETH_SINGLE_BIT(index) \
                                        && (((uint32_t)(index)) >= (uint32_t)HAL_ETH_RX_CHANNEL_0) \
                                        && (((uint32_t)(index)) \
                                            < (((uint32_t)HAL_ETH_RX_CHANNEL_0) << USE_HAL_ETH_MAX_RX_CH_NB)))

/**
  * @brief  Check whether a TX/RX channel identifier is valid.
  *
  * This macro validates that the given @p index corresponds to a valid
  * Ethernet TX or RX channel mask.
  *
  * A channel identifier is considered valid if it satisfies either:
  * - @ref IS_ETH_CHANNEL_TX_INDEX (valid TX channel), or
  * - @ref IS_ETH_CHANNEL_RX_INDEX (valid RX channel).
  *
  * Since both @ref IS_ETH_CHANNEL_TX_INDEX and @ref IS_ETH_CHANNEL_RX_INDEX
  * internally rely on @ref IS_ETH_SINGLE_BIT, the @p index must:
  * - be non-zero, and
  * - have exactly one bit set (power-of-two mask).
  *
  * @param  index  Channel identifier to check. It is interpreted as a
  *                single-bit mask corresponding to either a TX or RX channel.
  *
  * @retval bool   true if @p index is a valid TX or RX channel identifier,
  *                false otherwise.
  *
  * @note  This macro is a convenience wrapper that combines
  *        @ref IS_ETH_CHANNEL_TX_INDEX and
  *        @ref IS_ETH_CHANNEL_RX_INDEX when the direction (TX/RX)
  *        is not known or not relevant at the call site.
  */
#define IS_ETH_CHANNEL_INDEX(index) ((IS_ETH_CHANNEL_TX_INDEX(index))          \
                                     || (IS_ETH_CHANNEL_RX_INDEX(index)))

/** @brief Validates input channel mask (TX/RX). */
#define IS_ETH_CHANNEL_MASK(mask) (((mask) & ~(HAL_ETH_TX_CHANNEL_ALL | HAL_ETH_RX_CHANNEL_ALL)) == 0UL)

/** @brief Validates Remote Wake-Up byte mask: bit 31 must be zero. */
#define IS_ETH_RWK_BYTE_MASK(mask) (((mask) & 0x80000000UL) == 0UL)

/** @brief Validates MDIO command attributes: only allow defined HAL MDIO flags/NTC values. */
#define IS_ETH_MDIO_CMD_ATTR(attr) \
  ((((attr)) & ~(ETH_MACMDIOAR_PSE | ETH_MACMDIOAR_BTB | ETH_MACMDIOAR_NTC)) == 0UL)

