MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/** @brief Validates media interface selection. */
#define IS_ETH_MEDIA_INTERFACE(media_interface) (((media_interface) == HAL_ETH_MEDIA_IF_MII) \
                                                 || ((media_interface) == HAL_ETH_MEDIA_IF_RMII))

/** @brief Validates MAC speed value. */
#define IS_ETH_MAC_SPEED(speed) (((speed) == HAL_ETH_MAC_SPEED_10M) || ((speed) == HAL_ETH_MAC_SPEED_100M))

/** @brief Validates MAC duplex mode. */
#define IS_ETH_MAC_DUPLEX_MODE(duplex) (((duplex) == HAL_ETH_MAC_FULL_DUPLEX_MODE)                                   \
                                        || ((duplex) == HAL_ETH_MAC_HALF_DUPLEX_MODE))
/** @brief Validates MAC loopback control. */
#define IS_ETH_MAC_LOOPBACK_CTRL(loopback) (((loopback) == HAL_ETH_MAC_LOOPBACK_DISABLE)                             \
                                            || ((loopback) == HAL_ETH_MAC_LOOPBACK_ENABLE))
/** @brief Validates MAC source address control. */
#define IS_ETH_MAC_SRC_ADDR_CTRL(srcaddr) (((srcaddr) == HAL_ETH_MAC_SA_DISABLE)                                     \
                                           || ((srcaddr) == HAL_ETH_MAC_SA_MAC0_INS)                                 \
                                           || ((srcaddr) == HAL_ETH_MAC_SA_MAC1_INS)                                 \
                                           || ((srcaddr) == HAL_ETH_MAC_SA_MAC0_REP)                                 \
                                           || ((srcaddr) == HAL_ETH_MAC_SA_MAC1_REP))
/** @brief Validates MAC inter-packet gap. */
#define IS_ETH_MAC_INTER_PKT_GAP(ipg) (((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_96_BIT)                                   \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_88_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_80_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_72_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_64_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_56_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_48_BIT)                                \
                                       || ((ipg) == HAL_ETH_MAC_INTER_PKT_GAP_40_BIT))
/** @brief Validates MAC back-off limit. */
#define IS_ETH_MAC_BACK_OFF_LIMIT(backoff) (((backoff) == HAL_ETH_MAC_BACK_OFF_LIMIT_10)                             \
                                            || ((backoff) == HAL_ETH_MAC_BACK_OFF_LIMIT_8)                           \
                                            || ((backoff) == HAL_ETH_MAC_BACK_OFF_LIMIT_4)                           \
                                            || ((backoff) == HAL_ETH_MAC_BACK_OFF_LIMIT_1))
/** @brief Validates MAC preamble length. */
#define IS_ETH_MAC_PREAMBLE_LENGTH(preamble) (((preamble) == HAL_ETH_MAC_PREAMBLE_LENGTH_7)                          \
                                              || ((preamble) == HAL_ETH_MAC_PREAMBLE_LENGTH_5)                       \
                                              || ((preamble) == HAL_ETH_MAC_PREAMBLE_LENGTH_3))
/** @brief Validates MAC giant packet size limit control. */
#define IS_ETH_MAC_GPKT_SZ_LIMIT_CTRL(giantlimit) (((giantlimit) == HAL_ETH_MAC_GPKT_SZ_LIMIT_DISABLE)               \
                                                   || ((giantlimit) == HAL_ETH_MAC_GPKT_SZ_LIMIT_ENABLE))
/** @brief Validates MAC 2K packet length control. */
#define IS_ETH_MAC_2K_PKT_LEN_CTRL(pkt2k) (((pkt2k) == HAL_ETH_MAC_2K_PKT_LEN_DISABLE)                               \
                                           || ((pkt2k) == HAL_ETH_MAC_2K_PKT_LEN_ENABLE))
/** @brief Validates MAC CRC strip control. */
#define IS_ETH_MAC_CRC_STRIP_PKT_CTRL(crcstrip) (((crcstrip) == HAL_ETH_MAC_CRC_STRIP_PKT_DISABLE)                   \
                                                 || ((crcstrip) == HAL_ETH_MAC_CRC_STRIP_PKT_ENABLE))
/** @brief Validates MAC auto pad CRC/s control. */
#define IS_ETH_MAC_AUTO_PAD_CRC_S_CTRL(autopadcrc) (((autopadcrc) == HAL_ETH_MAC_AUTO_PAD_CRC_S_DISABLE)             \
                                                    || ((autopadcrc) == HAL_ETH_MAC_AUTO_PAD_CRC_S_ENABLE))
/** @brief Validates MAC TX jabber timer control. */
#define IS_ETH_MAC_TX_JABBER_TIM_CTRL(jabber) (((jabber) == HAL_ETH_MAC_TX_JABBER_TIM_DISABLE)                       \
                                               || ((jabber) == HAL_ETH_MAC_TX_JABBER_TIM_ENABLE))
/** @brief Validates MAC carrier-sense before transmit control. */
#define IS_ETH_MAC_CS_BEFORE_TR_CTRL(csbefore) (((csbefore) == HAL_ETH_MAC_CS_BEFORE_TR_DISABLE)                     \
                                                || ((csbefore) == HAL_ETH_MAC_CS_BEFORE_TR_ENABLE))
/** @brief Validates MAC carrier-sense during transmit control. */
#define IS_ETH_MAC_CS_DURING_TR_CTRL(csduring) (((csduring) == HAL_ETH_MAC_CS_DURING_TR_DISABLE)                     \
                                                || ((csduring) == HAL_ETH_MAC_CS_DURING_TR_ENABLE))
/** @brief Validates MAC retry transmit control. */
#define IS_ETH_MAC_RETRY_TR_CTRL(retry) (((retry) == HAL_ETH_MAC_RETRY_TR_DISABLE)                                   \
                                         || ((retry) == HAL_ETH_MAC_RETRY_TR_ENABLE))
/** @brief Validates MAC RX watchdog timer control. */
#define IS_ETH_MAC_RX_WD_TIM_CTRL(rxwatchdog) (((rxwatchdog) == HAL_ETH_MAC_RX_WD_TIM_DISABLE)                       \
                                               || ((rxwatchdog) == HAL_ETH_MAC_RX_WD_TIM_ENABLE))
/** @brief Validates MAC RX jumbo packet control. */
#define IS_ETH_MAC_RX_JUMBO_PKT_CTRL(jumbo) (((jumbo) == HAL_ETH_MAC_RX_JUMBO_PKT_DISABLE)                           \
                                             || ((jumbo) == HAL_ETH_MAC_RX_JUMBO_PKT_ENABLE))
/** @brief Validates MAC RX checksum control. */
#define IS_ETH_MAC_RX_CSUM_PKT_CTRL(rxcsum) (((rxcsum) == HAL_ETH_MAC_RX_CSUM_PKT_DISABLE)                           \
                                             || ((rxcsum) == HAL_ETH_MAC_RX_CSUM_PKT_ENABLE))
/** @brief Validates MAC RX receive own control. */
#define IS_ETH_MAC_RX_RECEIVE_OWN_CTRL(rxown) (((rxown) == HAL_ETH_MAC_RX_RECEIVE_OWN_DISABLE)                       \
                                               || ((rxown) == HAL_ETH_MAC_RX_RECEIVE_OWN_ENABLE))
/** @brief Validates MAC RX CRC packet check control. */
#define IS_ETH_MAC_RX_CRC_PKT_CHK_CTRL(rxcrc) (((rxcrc) == HAL_ETH_MAC_RX_CRC_PKT_CHK_DISABLE)                       \
                                               || ((rxcrc) == HAL_ETH_MAC_RX_CRC_PKT_CHK_ENABLE))
/** @brief Validates MAC deferral check control. */
#define IS_ETH_MAC_DEFERRAL_CHECK_CTRL(deferral) (((deferral) == HAL_ETH_MAC_DEFERRAL_CHECK_DISABLE)                 \
                                                  || ((deferral) == HAL_ETH_MAC_DEFERRAL_CHECK_ENABLE))
/** @brief Validates MAC unicast slow protocol control. */
#define IS_ETH_MAC_UC_SLOW_PROTO_CTRL(ucslow) (((ucslow) == HAL_ETH_MAC_UC_SLOW_PROTO_DISABLE)                       \
                                               || ((ucslow) == HAL_ETH_MAC_UC_SLOW_PROTO_ENABLE))
/** @brief Validates MAC slow protocol control. */
#define IS_ETH_MAC_SLOW_PROTO_CTRL(slowproto) (((slowproto) == HAL_ETH_MAC_SLOW_PROTO_DISABLE)                       \
                                               || ((slowproto) == HAL_ETH_MAC_SLOW_PROTO_ENABLE))
/** @brief Validates MAC extended inter-packet gap control. */
#define IS_ETH_MAC_EX_INT_PKT_GAP_CTRL(extipg) (((extipg) == HAL_ETH_MAC_E_INTER_PKT_GAP_DISABLE)                    \
                                                || ((extipg) == HAL_ETH_MAC_E_INTER_PKT_GAP_ENABLE))
/** @brief Validates MAC programmable watchdog control. */
#define IS_ETH_MAC_PROG_WD_CTRL(progwd) (((progwd) == HAL_ETH_MAC_PROG_WD_DISABLE)                                   \
                                         || ((progwd) == HAL_ETH_MAC_PROG_WD_ENABLE))
/** @brief Validates MAC zero-quanta pause control. */
#define IS_ETH_MAC_ZERO_Q_PAUSE_CTRL(zeroquanta) (((zeroquanta) == HAL_ETH_MAC_ZERO_Q_PAUSE_DISABLE)                 \
                                                  || ((zeroquanta) == HAL_ETH_MAC_ZERO_Q_PAUSE_ENABLE))
/** @brief Validates MAC transmit flow control. */
#define IS_ETH_MAC_TR_FLOW_CTRL(txflow) (((txflow) == HAL_ETH_MAC_TR_FLOW_CTRL_DISABLE)                              \
                                         || ((txflow) == HAL_ETH_MAC_TR_FLOW_CTRL_ENABLE))
/** @brief Validates MAC unicast pause packet control. */
#define IS_ETH_MAC_UC_PAUSE_PKT_CTRL(ucpause) (((ucpause) == HAL_ETH_MAC_UC_PAUSE_PKT_DISABLE)                       \
                                               || ((ucpause) == HAL_ETH_MAC_UC_PAUSE_PKT_ENABLE))
/** @brief Validates MAC receive flow control. */
#define IS_ETH_MAC_RECEIVE_FLOW_CTRL(rxflow) (((rxflow) == HAL_ETH_MAC_RECEIVE_FLOW_DISABLE)                         \
                                              || ((rxflow) == HAL_ETH_MAC_RECEIVE_FLOW_ENABLE))
/** @brief Validates MAC pause low threshold. */
#define IS_ETH_MAC_PAUSE_LOW_THR(pausethr) ( ((pausethr) == HAL_ETH_MAC_PLT_MINUS_4_SLOT_TIME)                        \
                                             || ((pausethr) == HAL_ETH_MAC_PLT_MINUS_28_SLOT_TIME)                   \
                                             || ((pausethr) == HAL_ETH_MAC_PLT_MINUS_36_SLOT_TIME)                   \
                                             || ((pausethr) == HAL_ETH_MAC_PLT_MINUS_144_SLOT_TIME)                  \
                                             || ((pausethr) == HAL_ETH_MAC_PLT_MINUS_256_SLOT_TIME)                  \
                                             || ((pausethr) == HAL_ETH_MAC_PLT_MINUS_512_SLOT_TIME) )

