MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/** @brief Validates MTL TX forward status control. */
#define IS_ETH_MTL_TX_FWD_STATUS_CTRL(txfwd)   ( ((txfwd) == HAL_ETH_MTL_TX_FWD_STATUS_DISABLE)                     \
                                                 || ((txfwd) == HAL_ETH_MTL_TX_FWD_STATUS_ENABLE) )
/** @brief Validates MAC giant packet size limit value. */
#define IS_ETH_MAC_GIANT_PKT_SIZE_LIMIT(giantsize) (((giantsize) >= ETH_GIANT_PKT_SIZE_LIMIT_BYTE) \
                                                    && ((giantsize) <= 0x00003FFFUL))
/** @brief Validates MAC extended inter-packet gap value. */
#define IS_ETH_MAC_EXT_INTER_PKT_GAP(extipgval)    (((extipgval) <= 0x000000FFUL))
/** @brief Validates MAC RX watchdog timeout value (bytes). */
#define IS_ETH_MAC_RX_WD_TIMEOUT_BYTE(rxwdtimeout)    (((rxwdtimeout) <= HAL_ETH_MAC_RX_WDT_16KB))
/** @brief Validates MAC TX pause time value. */
#define IS_ETH_MAC_TX_PAUSE_TIME(pausetime)         (((pausetime) <= 0x0000FFFFUL))

/** @brief Validates DMA address aligned beats configuration. */
#define IS_ETH_DMA_ADDR_ALIGNED_BEATS(alignedbeats) (((alignedbeats) == HAL_ETH_DMA_ADDR_ALIGN_DISABLE) \
                                                     || ((alignedbeats) == HAL_ETH_DMA_ADDR_ALIGN_ENABLE))
/** @brief Validates DMA burst length mode. */
#define IS_ETH_DMA_BURST_LEN_MODE(burstmode) (((burstmode) == HAL_ETH_DMA_BURST_LEN_FIXED) \
                                              || ((burstmode) == HAL_ETH_DMA_BURST_LEN_MAX_ALLOWED))

/** @brief Validates DMA mixed burst control. */
#define IS_ETH_DMA_MIXED_BURST_CTRL(mixedburst) (((mixedburst) == HAL_ETH_DMA_MIXED_BURST_MODE_DISABLED) \
                                                 || ((mixedburst) == HAL_ETH_DMA_MIXED_BURST_MODE_ENABLED))

/** @brief Validates DMA rebuild increment burst control. */
#define IS_ETH_DMA_REBUILD_INC_CTRL(rebuildinc) (((rebuildinc) == HAL_ETH_DMA_REBUILD_INC_BURST_DISABLED) \
                                                 || ((rebuildinc) == HAL_ETH_DMA_REBUILD_INC_BURST_ENABLED))
/** @brief Validates DMA transfer priority control. */
#define IS_ETH_DMA_TR_PRIO_CTRL(trprio) (((trprio) == HAL_ETH_DMA_TR_PRIO_DISABLE) \
                                         || ((trprio) == HAL_ETH_DMA_TR_PRIO_ENABLE))
/** @brief Validates DMA Tx PBL x8 mode. */
#define IS_ETH_DMA_TX_PBL_X8_MODE(pblx8mode) ( ((pblx8mode) == HAL_ETH_DMA_TX_PBL_X8_DISABLE)                      \
                                               || ((pblx8mode) == HAL_ETH_DMA_TX_PBL_X8_ENABLE) )
/** @brief Validates DMA Tx burst length. */
#define IS_ETH_DMA_TX_BURST_LENGTH(txburst)  ( ((txburst) == HAL_ETH_DMA_TX_BLEN_1_BEAT)                           \
                                               || ((txburst) == HAL_ETH_DMA_TX_BLEN_2_BEAT)                        \
                                               || ((txburst) == HAL_ETH_DMA_TX_BLEN_4_BEAT)                        \
                                               || ((txburst) == HAL_ETH_DMA_TX_BLEN_8_BEAT)                        \
                                               || ((txburst) == HAL_ETH_DMA_TX_BLEN_16_BEAT)                       \
                                               || ((txburst) == HAL_ETH_DMA_TX_BLEN_32_BEAT) )
/** @brief Validates DMA Tx second packet operation control. */
#define IS_ETH_DMA_TX_SEC_PKT_OP_CTRL(secpktop) ( ((secpktop) == HAL_ETH_DMA_TX_SEC_PKT_OP_DISABLE)                \
                                                  || ((secpktop) == HAL_ETH_DMA_TX_SEC_PKT_OP_ENABLE) )
/** @brief Validates MTL Tx queue operating mode. */
#define IS_ETH_MTL_TX_OPS_MODE(qopmode) ( ((qopmode) == HAL_ETH_MTL_TX_QUEUE_ENABLED) )
/** @brief Validates MTL Tx queue size. */
#define IS_ETH_MTL_TX_QUEUE_SIZE(qsize) ( ((qsize) == HAL_ETH_MTL_TX_QUEUE_SZ_2048_BYTE) )
/** @brief Validates MTL Tx transmit mode. */
#define IS_ETH_MTL_TX_TRANSMIT_MODE(txmode) ( ((txmode) == HAL_ETH_MTL_TX_Q_STORE_AND_FORWARD)                     \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_32_BYTE)                  \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_64_BYTE)                  \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_96_BYTE)                  \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_128_BYTE)                 \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_192_BYTE)                 \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_256_BYTE)                 \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_384_BYTE)                 \
                                              || ((txmode) == HAL_ETH_MTL_TX_Q_THRESHOLD_512_BYTE) )
/** @brief Validates FIFO event mode. */
#define IS_ETH_FIFO_EVENT_MODE(evmode) ( ((evmode) == HAL_ETH_FIFO_EVENT_NONE)                                      \
                                         || ((evmode) == HAL_ETH_FIFO_EVENT_ALWAYS)                                 \
                                         || ((evmode) == HAL_ETH_FIFO_EVENT_CYCLIC) )
/** @brief Validates FIFO event parameters. */
#define IS_ETH_FIFO_EVENT_PARAMS(evmode, evparams) ( ((evmode) == HAL_ETH_FIFO_EVENT_CYCLIC)                       \
                                                     ? ((uint32_t)(evparams) > 0UL) : (1UL) )
/** @brief Validates PMT control flags mask. */
#define IS_ETH_PMT_CTRL_FLAGS(pmtctrl) ( (((uint32_t)(pmtctrl)) & ~(uint32_t)ETH_PMT_CTRL_MASK) == 0UL )
/** @brief Validates LPI control flags mask. */
#define IS_ETH_LPI_CTRL_FLAGS(lpictrl) ( (((uint32_t)(lpictrl)) & ~(uint32_t)ETH_LPI_TX_CLK_MASK) == 0UL )
/** @brief Validates DMA Rx burst length. */
#define IS_ETH_DMA_RX_BURST_LENGTH(rxburst)  ( ((rxburst) == HAL_ETH_DMA_RX_BLEN_1_BEAT)                           \
                                               || ((rxburst) == HAL_ETH_DMA_RX_BLEN_2_BEAT)                        \
                                               || ((rxburst) == HAL_ETH_DMA_RX_BLEN_4_BEAT)                        \
                                               || ((rxburst) == HAL_ETH_DMA_RX_BLEN_8_BEAT)                        \
                                               || ((rxburst) == HAL_ETH_DMA_RX_BLEN_16_BEAT)                       \
                                               || ((rxburst) == HAL_ETH_DMA_RX_BLEN_32_BEAT) )

/** @brief Validates DMA Rx buffer length alignment. */
#define IS_ETH_DMA_RX_BUFFER_LEN_ALIGNED(rxbuflen) ( (((rxbuflen) % ETH_BUS_DATA_WIDTH_BYTE) == 0UL) )
/** @brief Validates max application buffers number (inclusive range: 0x2..0x1FF). */
#define IS_ETH_MAX_APP_BUFFERS_NUM(maxbuf) ( (((maxbuf) >= 0x2UL) && ((maxbuf) <= 0x400UL)) )
/** @brief Validates descriptor size: >0 and multiple of configured TX descriptor length. */
#define IS_ETH_DESC_SIZE_BYTE_VALID(desc_size, desc_len_byte, total_desc_cnt) \
  (((desc_size) > 0UL) && ((desc_size) >= ((desc_len_byte) * (total_desc_cnt))))
/** @brief Validates MTL Rx queue operating mode. */
#define IS_ETH_MTL_RX_OPS_MODE(qopmode) ( ((qopmode) == HAL_ETH_MTL_RX_QUEUE_ENABLED) )
/** @brief Validates MTL Rx queue size. */
#define IS_ETH_MTL_RX_QUEUE_SIZE(qsize) ( ((qsize) == HAL_ETH_MTL_RX_QUEUE_SZ_2048_BYTE) )
/** @brief Validates MTL Rx drop checksum error control. */
#define IS_ETH_MTL_RX_DROP_CS_ERR_CTRL(dropcs) ( ((dropcs) == HAL_ETH_MTL_RX_DROP_CS_ERR_DISABLE)                   \
                                                 || ((dropcs) == HAL_ETH_MTL_RX_DROP_CS_ERR_ENABLE) )
/** @brief Validates MTL Rx forward error packet control. */
#define IS_ETH_MTL_RX_FWD_ERR_PKT_CTRL(fwderr) ( ((fwderr) == HAL_ETH_MTL_RX_FWD_ERR_PKT_DISABLE)                   \
                                                 || ((fwderr) == HAL_ETH_MTL_RX_FWD_ERR_PKT_ENABLE) )
/** @brief Validates MTL Rx forward undersized packet control. */
#define IS_ETH_MTL_RX_FWD_USZ_PKT_CTRL(fwdusz) ( ((fwdusz) == HAL_ETH_MTL_RX_FWD_USZ_PKT_DISABLE)                   \
                                                 || ((fwdusz) == HAL_ETH_MTL_RX_FWD_USZ_PKT_ENABLE) )
/** @brief Validates MTL Rx queue mode. */
#define IS_ETH_MTL_RX_QUEUE_MODE(rxmode) ( ((rxmode) == HAL_ETH_MTL_RX_Q_STORE_AND_FORWARD)                          \
                                           || ((rxmode) == HAL_ETH_MTL_RX_Q_THRESHOLD_32)                            \
                                           || ((rxmode) == HAL_ETH_MTL_RX_Q_THRESHOLD_64)                            \
                                           || ((rxmode) == HAL_ETH_MTL_RX_Q_THRESHOLD_96)                            \
                                           || ((rxmode) == HAL_ETH_MTL_RX_Q_THRESHOLD_128) )

/**
  * @brief  Return the RX channel identifier bit mask for a given zero-based index.
  * @param  ch  Zero-based RX channel index (0 .. USE_HAL_ETH_MAX_RX_CH_NB-1).
  * @retval uint32_t Channel identifier mask (HAL_ETH_RX_CHANNEL_0 shifted by ch).
  */
#define ETH_GET_RX_CH_ID(ch) \
  (((uint32_t)HAL_ETH_RX_CHANNEL_0) << ((uint32_t)(ch)))

/**
  * @brief  Return the TX channel identifier bit mask for a given zero-based index.
  * @param  ch  Zero-based TX channel index (0 .. USE_HAL_ETH_MAX_TX_CH_NB-1).
  * @retval uint32_t Channel identifier mask (HAL_ETH_TX_CHANNEL_0 shifted by ch).
  */
#define ETH_GET_TX_CH_ID(ch) \
  (((uint32_t)HAL_ETH_TX_CHANNEL_0) << ((uint32_t)(ch)))

/**
  * @brief  Enables the specified ETHERNET DMA interrupts for selected Channel.
  * @param  instance : ETH DMA Instance
  * @param  interrupts: specifies the ETHERNET DMA interrupt sources to be
  *   enabled
  */
#define ETH_DMA_CHX_ENABLE_IT(instance, interrupts) ((instance)->DMACXIER \
                                                     |= (interrupts))
/**
  * @brief  Clears the ETHERNET DMA IT pending bit for selected Channel.
  * @param  instance : ETH DMA Instance
  * @param  interrupts: specifies the interrupt pending bit to clear.
  */
#define ETH_DMA_CHX_CLEAR_IT(instance, interrupts) ((instance)->DMACXSR \
                                                    = (interrupts))
/**
  * @brief  Disables the specified ETHERNET DMA interrupts for selected Channel.
  * @param  instance : ETH DMA Instance
  * @param  interrupts: specifies the ETHERNET DMA interrupt sources to be
  *   disabled.
  */
#define ETH_DMA_CHX_DISABLE_IT(instance, interrupts) ((instance)->DMACXIER \
                                                      &= ~(interrupts))
/**
  * @brief  Gets the ETHERNET DMA Descriptor by index from descriptors list.
  * @param  desc_list : Descriptors list address
  * @param  index : Descriptor's index to get
  * @retval The ETH DMA descriptor pointer
  */
#define ETH_GET_DESC_INDEX(desc_list, index) \
  ((eth_dma_descriptor_t *)((uint32_t)(desc_list).p_desc_list_addr + \
                            (((uint32_t)(index)) * ((uint32_t)(desc_list).desc_len_byte))))
/**
  * @brief  Increment a descriptor index, wrapping to zero when reaching offset.
  * @param  inx    Descriptor index variable (in/out).
  * @param  offset Total number of descriptors in the list (modulus).
  * @note   Safe for ring buffer index updates.
  */
#define ETH_INCR_DESC_INDEX(inx, offset) \
  do {\
    (inx) = (uint32_t)(((uint32_t)(inx) + 1UL) % (uint32_t)(offset));\
  } while (0)

/**
  * @brief  Convert a pointer value to a 32-bit unsigned integer representation.
  * @param  addr Pointer value to be converted.
  */
#define ETH_CAST_PTR_TO_U32(addr) ((uint32_t)((uint32_t*)(addr)))

/**
  * @brief  Compute the bit shift for a Remote Wakeup (RWK) command field.
  *
  * This macro returns the bit shift applied to the RWK command field
  * corresponding to the given @p index. Each command field occupies
  * 8 bits, so the shift is calculated as:
  * - @c index * 8
  *
  * @param[in] index
  *         Index of the RWK command field (0-based).
  *
  * @note Typical usage is when encoding/decoding RWK command fields into
  *       a 32-bit register where each field is one byte wide.
  *
  * @retval uint32_t
  *         Bit shift value for the command field at the given @p index.
  */
#define ETH_RWK_CMD_SHIFT(index)                         ((index) * 8UL)

/**
  * @brief  Compute the bit shift for a Remote Wakeup (RWK) offset field.
  *
  * This macro returns the bit shift applied to the RWK offset field
  * corresponding to the given @p index. Each offset field occupies
  * 8 bits, so the shift is calculated as:
  * - @c index * 8
  *
  * @param[in] index
  *         Index of the RWK offset field (0-based).
  *
  * @note Typical usage is when encoding/decoding RWK offset fields into
  *       a 32-bit register where each field is one byte wide.
  *
  * @retval uint32_t
  *         Bit shift value for the offset field at the given @p index.
  */
#define ETH_RWK_OFFSET_SHIFT(index)                      ((index) * 8UL)

/**
  * @brief  Compute the bit shift for a Remote Wakeup (RWK) CRC16 low word.
  *
  * This macro returns the bit shift applied to the low 16-bit word of a
  * RWK CRC16 value corresponding to the given @p index. Each CRC16 field
  * occupies 16 bits, so the shift is calculated as:
  * - @c index * 16
  *
  * @param[in] index
  *         Index of the RWK CRC16 low-word field (0-based).
  *
  * @note This is typically used when packing multiple CRC16 values into
  *       a 32-bit or wider register.
  *
  * @retval uint32_t
  *         Bit shift value for the low 16-bit CRC field at the given @p index.
  */
#define ETH_RWK_CRC16_SHIFT_LOW(index)                   ((index) * 16UL)

/**
  * @brief  Compute the bit shift for a Remote Wakeup (RWK) CRC16 high word.
  *
  * This macro returns the bit shift applied to the high 16-bit word of a
  * RWK CRC16 value corresponding to the given @p index. The shift is
  * calculated as:
  * - @c (index - 2) * 16
  *
  * @param[in] index
  *         Index of the RWK CRC16 high-word field. Expected to be greater
  *         than or equal to 2 so that the expression @c (index - 2) is valid
  *         in the context of the underlying layout.
  *
  * @note The subtraction by 2 reflects the placement of the high-word CRC16
  *       fields in the register layout (e.g. indexes 2 and 3 can correspond
  *       to the high words of CRC entries 0 and 1).
  *
  * @retval uint32_t
  *         Bit shift value for the high 16-bit CRC field at the given @p index.
  */
#define ETH_RWK_CRC16_SHIFT_HIGH(index)                  (((index) - 2UL) * 16UL)

/**
  * @brief  Get number of descriptors that fit in the provided memory region.
  * @param  total_mem_size Size in bytes of the descriptor memory region.
  * @param  desc_list      Descriptor list information structure (provides desc_len_byte).
  * @retval Number of descriptors that fit in total_mem_size.
  */
#define ETH_GET_DESC_CNT(total_mem_size,desc_list) \
  ((total_mem_size) / (desc_list).desc_len_byte)
/**
  * @brief  Return the greater of two values.
  * @param  value_a First comparison value (must be side-effect free).
  * @param  value_b Second comparison value (must be side-effect free).
  * @retval The maximum of value_a and value_b.
  */
#define ETH_GET_MAX_VALUE(value_a,value_b) (((value_a) > (value_b)) ? (value_a) : (value_b))
/**
  * @brief  Compute skip length size field for DMA descriptor according to bus width.
  * @param  req_desc_size  Requested descriptor size in bytes.
  * @param  curr_desc_size Current descriptor size in bytes.
  * @retval Encoded skip length value shifted to DSL field position.
  */
#define ETH_GET_SKIPLEN_SIZE(req_desc_size, curr_desc_size)                              \
  ((uint32_t)(( (uint32_t)(req_desc_size) - (uint32_t)(curr_desc_size) + 8UL )           \
              / (uint32_t)ETH_BUS_DATA_WIDTH_BYTE) << ETH_DMACCR_DSL_Pos)

/**
  * @brief  Copy selected bits from a source value into a destination variable.
  *
  * This macro updates @p dest by copying only the bits selected by @p mask
  * from @p src, leaving all other bits in @p dest unchanged.
  *
  * The operation performed is:
  * - Clear in @p dest all bits that are set in @p mask.
  * - OR in the bits from @p src that are set in @p mask.
  *
  * @param[in,out] dest
  *        Destination variable to be updated. Must be an lvalue of a type
  *        compatible with @c uint32_t.
  * @param[in]     mask
  *        Bit mask that selects which bits must be copied from @p src to
  *        @p dest. Only bits set to 1 in @p mask are affected.
  * @param[in]     src
  *        Source value from which bits are copied according to @p mask.
  */
#define ETH_COPY_BITS(dest,mask, src) \
  do { \
    (dest) = (uint32_t)(((uint32_t)(dest) & ~(uint32_t)(mask)) | ((uint32_t)(src) & (uint32_t)(mask))); \
  } while (0)

