MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
/**
  * @brief  Updates ETH state with atomic protection (using LDREX/STREX).
  * @param  state_field  Field containing the state to update
  * @param  ppp_conditional_states  valid current state
  * @param  ppp_new_state  New state to set if current state matches conditions
  *
  * @note   This macro uses exclusive access instructions for atomic state updates
  * @retval HAL_BUSY if state could not be updated, no action performed
  */
#define ETH_STATES_CHECK_UPDATE(state_field, ppp_conditional_states, ppp_new_state)                              \
  do {                                                                                                           \
    __DMB();                                                                                                     \
    do {                                                                                                         \
      if ((__LDREXW((uint32_t *)((uint32_t)&(state_field))) & (uint32_t)(ppp_conditional_states)) == 0UL)        \
      {                                                                                                          \
        STM32_CLREX_TO_DEPRECATE(); /* Workaround linked to CMSIS IAR issue EWARM-11901 correction fix */        \
        return HAL_BUSY;                                                                                         \
      }                                                                                                          \
    } while (__STREXW((uint32_t)(ppp_new_state), (uint32_t *)((uint32_t)&((state_field)))) != 0UL);              \
    __DMB();                                                                                                     \
  } while (0)

#else /* USE_HAL_CHECK_PROCESS_STATE */

/**
  * @brief  Updates ETH state.
  * @param  state_field           Field containing the state to update
  * @param  ppp_conditional_states  valid current state
  * @param  ppp_new_state            New state to set if current state matches conditions
  * @retval HAL_BUSY if state could not be updated, no action performed
  */
#define ETH_STATES_CHECK_UPDATE(state_field, ppp_conditional_states, ppp_new_state)                             \
  do {                                                                                                          \
    (state_field) = (ppp_new_state);                                                                            \
  } while(0)

#endif /* USE_HAL_CHECK_PROCESS_STATE == 1 */

/**
  * @}
  */

/* Private types -----------------------------------------------*/
/** @defgroup ETH_Private_Types ETH Private Types Definitions
  * @{
  */
/**
  * @brief  ETH DMA Descriptor structure definition
  */
typedef struct
{
  volatile uint32_t desc0;       /*!< ETH descriptor word 0      */
  volatile uint32_t desc1;       /*!< ETH descriptor word 1      */
  volatile uint32_t desc2;       /*!< ETH descriptor word 2      */
  volatile uint32_t desc3;       /*!< ETH descriptor word 3      */
  void *p_pkt_addr;              /*!< Buffer backup address */
  void *p_app_data;              /*!< Application data   */
} eth_dma_descriptor_t;

/**
  * @brief MDIO clock range configuration item.
  *
  * Provides precomputed values for selecting the MDIO CSR clock range.
  * - `clk_range_sel`: range selection value to write into `ETH_MACMDIOAR.CR`
  * - `clk_range_div`: divider value used to derive MDC from HCLK for the range selection
  *
  * Used by MDIO clock helpers to map system HCLK to the appropriate MDC divider
  * and CSR encoding.
  */
typedef struct
{
  uint32_t clk_range_sel; /*!< HAL ETH MAC MDC clock range selection */
  uint32_t clk_range_div; /*!< HAL ETH MAC MDC clock range divider   */
} eth_mdio_clk_div_t;

/**
  * @brief  Tx DMA process state.
  */
typedef enum
{
  ETH_TX_DMA_PROCESS_STOPPED                 = 0x0UL,   /*!< DMA stopped: no Tx activity */
  ETH_TX_DMA_PROCESS_FETCHING_DESC           = 0x1UL,   /*!< Fetching next Tx descriptor */
  ETH_TX_DMA_PROCESS_WAITING_STATUS          = 0x2UL,   /*!< Waiting for status writeback */
  ETH_TX_DMA_PROCESS_READING_DATA            = 0x3UL,   /*!< Reading frame data from memory */
  ETH_TX_DMA_PROCESS_TIMESTAMP_WRITE_STATE   = 0x4UL,   /*!< Writing timestamp to descriptor */
  ETH_TX_DMA_PROCESS_SUSPENDED               = 0x6UL,   /*!< Suspended by software or error */
  ETH_TX_DMA_PROCESS_CLOSING_TX_DESC         = 0x7UL,   /*!< Closing Tx descriptor and updating ring */
  ETH_TX_DMA_PROCESS_UNKNOWN                 = 0xFFUL,  /*!< Unknown/invalid state (defensive default) */
} eth_tx_dma_process_state_t;

/**
  * @brief  Rx DMA process state.
  */
typedef enum
{
  ETH_RX_DMA_PROCESS_STOPPED                = 0x0UL,   /*!< DMA stopped: no Rx activity */
  ETH_RX_DMA_PROCESS_FETCHING_DESC          = 0x1UL,   /*!< Fetching next Rx descriptor */
  ETH_RX_DMA_PROCESS_WAITING_PKT            = 0x3UL,   /*!< Waiting for incoming packet */
  ETH_RX_DMA_PROCESS_SUSPENDED              = 0x4UL,   /*!< Suspended by software or error */
  ETH_RX_DMA_PROCESS_CLOSING_DESC           = 0x5UL,   /*!< Closing Rx descriptor and updating ring */
  ETH_RX_DMA_PROCESS_TIMESTAMPING           = 0x6UL,   /*!< Timestamping received packet */
  ETH_RX_DMA_PROCESS_TRANSFERING_DATA       = 0x7UL,   /*!< Transferring data to memory */
  ETH_RX_DMA_PROCESS_UNKNOWN                = 0xFFUL   /*!< Unknown/invalid state (defensive default) */
} eth_rx_dma_process_state_t;

/**
  * @}
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/** @defgroup ETH_Private_Variables  ETH Private Variables
  * @{
  */
/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/** @defgroup ETH_Private_Functions ETH Private Functions
  * @{
  */
static void ETH_MAC_SetConfigDefault(struct hal_eth_handle_s *heth);
static void ETH_MAC_SetConfig(const hal_eth_handle_t *heth, const hal_eth_mac_config_t *p_mac_conf);
static void ETH_SetMDIOClockRange(hal_eth_handle_t *heth);
static uint32_t ETH_GetMDIOClockRange(uint32_t eth_hclk_freq);
static void ETH_MTL_SetConfigDefault(struct hal_eth_handle_s *heth);
static void ETH_MTL_SetConfig(hal_eth_handle_t *heth, const hal_eth_mtl_config_t *p_mtl_conf);
static void ETH_DMA_SetConfigDefault(struct hal_eth_handle_s *heth);
static void ETH_DMA_SetConfig(hal_eth_handle_t *heth, const hal_eth_dma_config_t *p_dma_conf);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
static void ETH_InitCommonCallbacksToDefault(hal_eth_handle_t *heth);
static void ETH_InitTxCallbacksToDefault(hal_eth_tx_channel_handle_t *hchannel);
static void ETH_InitRxCallbacksToDefault(hal_eth_rx_channel_handle_t *hchannel);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
static void ETH_SetTxChannelDefaultConfig(hal_eth_handle_t *heth, uint32_t channel);
static void ETH_DMA_SetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_dma_tx_channel_config_t *p_dma_tx_ch_conf);
static void ETH_GetDMATxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_dma_tx_channel_config_t *p_dma_tx_ch_conf);
static void ETH_MTL_SetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_mtl_tx_queue_config_t *p_mtl_tx_q_conf);
static void ETH_GetMtlTxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_mtl_tx_queue_config_t *p_mtl_tx_q_conf);
static hal_status_t ETH_RequestTxDMA(hal_eth_handle_t *heth, uint32_t ch, hal_eth_buffer_t *p_eth_buffer,
                                     uint32_t buffer_count, hal_eth_tx_pkt_config_t *p_tx_conf);
static uint32_t ETH_ExecTxDataHandler(hal_eth_handle_t *heth, uint32_t ch);
static hal_status_t ETH_StartTxChannel(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                       uint32_t total_mem_size_byte);
static void ETH_SetTxFifoEvent(hal_eth_handle_t *heth, uint32_t ch, eth_dma_descriptor_t *p_dma_tx_desc,
                               hal_eth_tx_pkt_notify_ctrl_t pkt_notify);
static eth_tx_dma_process_state_t ETH_DMA_GetTxProcessState(const ETH_TypeDef *p_ethx, uint32_t ch);
static void ETH_DMATxDescListInit(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                  uint32_t total_mem_size_byte);
static hal_status_t ETH_StopTxChannel(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_AbortTxChannel(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_RecycleTxDesc(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_SetRxChannelDefaultConfig(hal_eth_handle_t *heth, uint32_t channel);
static void ETH_DMA_SetConfigRxChannel(hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_dma_rx_channel_config_t *p_dma_rx_ch_conf);
static void ETH_GetDMARxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_dma_rx_channel_config_t *p_dma_rx_ch_conf);
static void ETH_MTL_SetConfigRxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_mtl_rx_queue_config_t *p_mtl_rx_q_conf);
static void ETH_GetMtlRxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_mtl_rx_queue_config_t *p_mtl_rx_q_conf);
static uint32_t ETH_ExecRxDataHandler(hal_eth_handle_t *heth, uint32_t ch);
static hal_status_t ETH_StartRxChannel(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                       uint32_t total_mem_size_byte);
static hal_status_t ETH_StopRxChannel(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_AbortRxChannel(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_ResetDMADesc(eth_dma_descriptor_t *p_dma_tx_desc);
static void ETH_UpdateRxDesc(hal_eth_handle_t *heth, uint32_t ch);
static void ETH_SetRxFifoEvent(hal_eth_handle_t *heth, uint32_t ch, eth_dma_descriptor_t *p_dma_rx_desc);
static void ETH_DMARxDescListInit(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                  uint32_t total_mem_size_byte);
static void ETH_RecycleRxDesc(hal_eth_handle_t *heth, uint32_t ch);
static eth_rx_dma_process_state_t ETH_DMA_GetRxProcessState(const ETH_TypeDef *p_ethx, uint32_t ch);
static hal_status_t ETH_AlignDescSize(uint32_t app_req_size, uint32_t *p_desc_size);
__STATIC_INLINE void ETH_GetTXChIndex(uint32_t *p_tx_ch, uint32_t channel);
__STATIC_INLINE void ETH_GetRXChIndex(uint32_t *p_rx_ch, uint32_t channel);
__STATIC_INLINE hal_status_t ETH_LockChannel(volatile uint32_t *p_channel_lock_state);
__STATIC_INLINE void ETH_UnlockChannel(volatile uint32_t *p_channel_lock_state);
__STATIC_INLINE uint32_t ETH_WakeupGetPendingIT(void);
__STATIC_INLINE void ETH_WakeupClearPendingIT(uint32_t edge);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @addtogroup ETH_Exported_Functions
  * @{
  */

/** @addtogroup ETH_Exported_Functions_Group1
  * @{
This subsection provides functions allowing to initialize and de-initialize the ETHx instance:
  - HAL_ETH_Init(): Initialize the selected ETHx instance
    - All software resources are initialized
    - No hardware initialization is performed at this level.
  - HAL_ETH_DeInit(): Restore the default configuration of the selected ETHx instance.
  */
/**
  * @brief  Initialize the Ethernet HAL handle and peripheral instance.
  *
  * This function initializes the Ethernet HAL context referenced by @p heth
  * for the given Ethernet peripheral @p instance. It:
  * - Stores the hardware instance in the handle.
  * - Enables the Ethernet clocks (if the clock enable model requires it).
  * - Initializes common, TX, and RX callbacks to their default implementations
  *   (when callback registration is enabled).
  * - Creates the OS semaphore used for bus protection (when mutex support
  *   is enabled).
  * - Clears optional user data and last error codes.
  * - Initializes all TX/RX channels to the reset/unlocked state.
  * - Sets the global state to @ref HAL_ETH_STATE_INIT.
  *
  * This function does not configure pins, descriptors, or low-level MAC, DMA or MTL
  * parameters; those are typically handled by separate configuration APIs.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that will be
  *         initialized. On successful return, its fields (instance, channels,
  *         callbacks, semaphore, state, etc.) are prepared for further
  *         configuration and use.
  * @param[in]     instance
  *         Ethernet peripheral instance identifier. Must correspond to a
  *         valid ETH_TypeDef instance and satisfy IS_ETH_ALL_INSTANCE.
  *
  * @pre The system clock tree must be fully configured and provide a valid
  *      clock to the Ethernet peripheral before calling this function.
  *
  * @note When @c USE_HAL_ETH_CLK_ENABLE_MODEL is configured to be greater
  *       than or equal to @c HAL_CLK_ENABLE_PERIPH_ONLY, this function
  *       enables the Ethernet clocks via HAL_RCC_ETH1_EnableClock and
  *       related functions.
  * @note When @c USE_HAL_ETH_REGISTER_CALLBACKS is enabled, this function
  *       sets common, TX, and RX callbacks to their default handlers.
  * @note The caller must perform further configuration (descriptors, DMA,
  *       MAC, MTL, interrupts, pins) before starting traffic.
  *
  * @retval HAL_OK
  *         Initialization succeeded; the handle is now in
  *         @ref HAL_ETH_STATE_INIT state.
  * @retval HAL_ERROR
  *         OS semaphore creation failed (when @c USE_HAL_MUTEX == 1).
  * @retval HAL_INVALID_PARAM
  *         @p heth is @c NULL (only when parameter checking is enabled via
  *         @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_DeInit
  */
hal_status_t HAL_ETH_Init(hal_eth_handle_t *heth, hal_eth_t instance)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_ALL_INSTANCE((ETH_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (heth == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  if (HAL_OS_SemaphoreCreate(&heth->semaphore) != HAL_OS_OK)
  {
    return HAL_ERROR;
  }
#endif /* USE_HAL_MUTEX */

