MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  heth->instance = instance;

#if defined(USE_HAL_ETH_CLK_ENABLE_MODEL) && (USE_HAL_ETH_CLK_ENABLE_MODEL >= HAL_CLK_ENABLE_PERIPH_ONLY)
  HAL_RCC_ETH1_EnableClock();
  HAL_RCC_ETH1TX_EnableClock();
  HAL_RCC_ETH1RX_EnableClock();
  HAL_RCC_ETH1CK_EnableClock();
#endif /* USE_HAL_ETH_CLK_ENABLE_MODEL */

#if defined(USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  ETH_InitCommonCallbacksToDefault(heth);
#endif /* (USE_HAL_ETH_REGISTER_CALLBACKS) */

#if defined (USE_HAL_ETH_USER_DATA) && (USE_HAL_ETH_USER_DATA == 1)
  heth->p_user_data = NULL;
#endif /* USE_HAL_ETH_USER_DATA */

#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
  heth->last_error_codes = HAL_ETH_ERROR_NONE;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */

  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_TX_CH_NB; ch++)
  {
    heth->tx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_RESET;
    heth->tx_channels[ch].channel_lock_state = ETH_CHANNEL_STATE_UNLOCKED;
    heth->tx_channels[ch].tx_desc_list.p_desc_list_addr = NULL;
    heth->tx_channels[ch].tx_desc_list.total_desc_cnt = 0UL;
    heth->tx_channels[ch].p_tx_complete_cb = NULL;
#if defined(USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    ETH_InitTxCallbacksToDefault(&heth->tx_channels[ch]);
#endif /* (USE_HAL_ETH_REGISTER_CALLBACKS) */
  }

  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_RX_CH_NB; ch++)
  {
    heth->rx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_RESET;
    heth->rx_channels[ch].channel_lock_state = ETH_CHANNEL_STATE_UNLOCKED;
    heth->rx_channels[ch].rx_desc_list.p_desc_list_addr = NULL;
    heth->rx_channels[ch].rx_desc_list.total_desc_cnt = 0UL;
    heth->rx_channels[ch].p_rx_complete_cb = NULL;
    heth->rx_channels[ch].p_rx_allocate_cb = NULL;
#if defined(USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    ETH_InitRxCallbacksToDefault(&heth->rx_channels[ch]);
#endif /* (USE_HAL_ETH_REGISTER_CALLBACKS) */
  }

  heth->global_state     = HAL_ETH_STATE_INIT;
  return HAL_OK;
}

/**
  * @brief  De-initialize the Ethernet peripheral.
  *
  * This function de-initializes the Ethernet HAL context referenced by @p heth
  * and resets the software state of all TX/RX channels. It also disables the
  * Ethernet peripheral clocks and deletes the associated OS semaphore if these
  * features are enabled.
  *
  * The function performs the following actions:
  * - Clears optional user data and last error codes stored in the handle.
  * - Iterates over all TX channels:
  *   - Stops any channel that is in @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *     @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *   - Resets the channel state to @ref HAL_ETH_CHANNEL_STATE_RESET.
  *   - Unlocks the channel (@ref ETH_CHANNEL_STATE_UNLOCKED).
  *   - Clears the TX-complete callback pointer.
  * - Iterates over all RX channels:
  *   - Stops any channel that is in @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *     @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *   - Resets the channel state to @ref HAL_ETH_CHANNEL_STATE_RESET.
  *   - Unlocks the channel (@ref ETH_CHANNEL_STATE_UNLOCKED).
  *   - Clears the RX-complete and RX-allocate callback pointers.
  * - Sets the global state of the handle to @ref HAL_ETH_STATE_RESET.
  * - Disables the Ethernet clocks if @c USE_HAL_ETH_CLK_ENABLE_MODEL is
  *   configured to at least @c HAL_CLK_ENABLE_PERIPH_ONLY.
  * - Deletes the OS semaphore associated with the handle if @c USE_HAL_MUTEX
  *   is enabled.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral. Its internal fields (channels, callbacks, user data,
  *         error codes, semaphore, clocks) are reset/de-initialized by this
  *         function.
  *
  * @note This function does not free user-allocated memory for descriptors or
  *       buffers; it only resets the HAL state and disables clocks and
  *       synchronization primitives tied to the handle.
  * @warning This function is not thread-safe. Ensure that no concurrent call
  *          to this function is made while it is executing.
  * @note After this function returns, @p heth is in the
  *       @ref HAL_ETH_STATE_RESET state and must be reinitialized via the
  *       dedicated initialization function before being used again.
  */
void HAL_ETH_DeInit(hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);

  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_TX_CH_NB; ch++)
  {
    ETH_AbortTxChannel(heth, ch);
    heth->tx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_RESET;
    heth->tx_channels[ch].channel_lock_state = ETH_CHANNEL_STATE_UNLOCKED;
    heth->tx_channels[ch].p_tx_complete_cb = NULL;
  }
  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_RX_CH_NB; ch++)
  {
    ETH_AbortRxChannel(heth, ch);
    heth->rx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_RESET;
    heth->rx_channels[ch].channel_lock_state = ETH_CHANNEL_STATE_UNLOCKED;
    heth->rx_channels[ch].p_rx_complete_cb = NULL;
    heth->rx_channels[ch].p_rx_allocate_cb = NULL;
  }

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  (void)HAL_OS_SemaphoreDelete(&heth->semaphore);
#endif /* USE_HAL_MUTEX  */

#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
  heth->last_error_codes = HAL_ETH_ERROR_NONE;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */

#if defined (USE_HAL_ETH_USER_DATA) && (USE_HAL_ETH_USER_DATA == 1)
  heth->p_user_data = NULL;
#endif /* USE_HAL_ETH_USER_DATA */

  heth->global_state = HAL_ETH_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group2
  * @{
This subsection provides functions allowing to configure the Ethernet peripheral:
  - HAL_ETH_SetConfig(): Configure the selected ETHx instance.
  - HAL_ETH_GetConfig(): Retrieve the current configuration of the selected ETHx instance.
  */
/**
  * @brief  Configure the Ethernet MAC, MTL and DMA according to the given settings.
  *
  * This function applies a complete basic configuration of the Ethernet
  * peripheral using the parameters provided in @p p_config and the handle
  * @p heth. It:
  * - Checks that the handle is in a valid state
  *   (@ref HAL_ETH_STATE_INIT or @ref HAL_ETH_STATE_CONFIGURED).
  * - Selects and configures the media interface (MII/RMII/RGMII) through RCC/SBS.
  * - Performs a software reset of the MAC subsystem and waits for completion.
  * - Configures the MDIO clock range according to the current HCLK.
  * - Initializes MAC, MTL and DMA blocks with default settings.
  * - Initializes all TX and RX DMA/MTL channels with default configuration.
  * - Programs the primary MAC address (MACA0) from @p p_config->mac_addr.
  * - Masks MMC TX/RX interrupts.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information for the Ethernet peripheral. Its
  *         @c global_state is updated to @ref HAL_ETH_STATE_CONFIGURED on
  *         success or reverted to @ref HAL_ETH_STATE_INIT on SW reset failure.
  * @param[in]     p_config
  *         Pointer to a constant @ref hal_eth_config_t structure containing:
  *         - @c media_interface : media interface selection
  *           (@ref hal_eth_media_interface_t for supported values).
  *         - @c mac_addr[6]     : 6-byte MAC address to be programmed into
  *           MACA0 register (index 0 = lowest byte).
  *
  * @pre
  * - @p heth must have been initialized with @ref HAL_ETH_Init.
  * - @p heth->global_state must be either @ref HAL_ETH_STATE_INIT or
  *   @ref HAL_ETH_STATE_CONFIGURED (checked with debug and optional
  *   runtime checks).
  *
  * @note This function performs a MAC software reset; any previous runtime
  *       configuration in MAC/MTL/DMA registers is lost.
  * @note The function masks a set of MMC TX/RX interrupts by default.
  *
  * @retval HAL_OK
  *         Configuration completed successfully.
  * @retval HAL_ERROR
  *         Timeout occurred while waiting for the software reset bit to clear.
  * @retval HAL_INVALID_PARAM
  *         @p heth or @p p_config is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_Init
  */
hal_status_t HAL_ETH_SetConfig(hal_eth_handle_t *heth, const hal_eth_config_t *p_config)
{
  uint32_t tick_start = 0UL;
  ETH_TypeDef *p_ethx = NULL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_ETH_MEDIA_INTERFACE(p_config->media_interface));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_INIT | (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

