MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  if (p_config->media_interface == HAL_ETH_MEDIA_IF_MII)
  {
    LL_SBS_SetETHPHYInterface(LL_SBS_PERIPH_ETH1, LL_SBS_ETHPHY_ITF_GMII_MII);
  }
  else
  {
    LL_SBS_SetETHPHYInterface(LL_SBS_PERIPH_ETH1, LL_SBS_ETHPHY_ITF_RMII);
  }

  p_ethx = ETH_GET_INSTANCE(heth);

  /* SWR after interface selection: reset MAC/MTL/DMA to a known baseline before config. */
  STM32_SET_BIT(p_ethx->DMAMR, ETH_DMAMR_SWR);

  tick_start = HAL_GetTick();

  /*SWR clears when the internal reset completes, timeout usually indicates clock/reset/interface issues. */
  while (STM32_READ_BIT(p_ethx->DMAMR, ETH_DMAMR_SWR) != 0UL)
  {
    if (((HAL_GetTick() - tick_start) > ETH_SWRESET_TIMEOUT_MS))
    {
      if (STM32_READ_BIT(p_ethx->DMAMR, ETH_DMAMR_SWR) != 0UL)
      {
        heth->global_state = HAL_ETH_STATE_INIT;
        return HAL_ERROR;
      }
    }
  }

  /* MDIO clock range depends on HCLK; configure before any PHY transactions. */
  ETH_SetMDIOClockRange(heth);
  ETH_MAC_SetConfigDefault(heth);
  ETH_MTL_SetConfigDefault(heth);
  ETH_DMA_SetConfigDefault(heth);

  /* Apply per-channel defaults so unused channels are still in a defined state. */
  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_TX_CH_NB; ch++)
  {
    ETH_SetTxChannelDefaultConfig(heth, ch);
  }

  for (uint32_t ch = 0; ch < USE_HAL_ETH_MAX_RX_CH_NB; ch++)
  {
    ETH_SetRxChannelDefaultConfig(heth, ch);
  }

  STM32_WRITE_REG(p_ethx->MACA0HR,
                  (((uint32_t)p_config->mac_addr[5] << 8U) |
                   (uint32_t)p_config->mac_addr[4]));

  STM32_WRITE_REG(p_ethx->MACA0LR,
                  (((uint32_t)p_config->mac_addr[3] << 24U) |
                   ((uint32_t)p_config->mac_addr[2] << 16U) |
                   ((uint32_t)p_config->mac_addr[1] << 8U)  |
                   (uint32_t)p_config->mac_addr[0]));

  /* Mask MMC interrupts by default (stats-only, avoid IRQ noise). */
  STM32_SET_BIT(p_ethx->MMC_RX_INTERRUPT_MASK, ETH_MMC_RX_INTERRUPT_MASK_ALL);
  STM32_SET_BIT(p_ethx->MMC_TX_INTERRUPT_MASK, ETH_MMC_TX_INTERRUPT_MASK_ALL);

  heth->global_state = HAL_ETH_STATE_CONFIGURED;
  return HAL_OK;
}

/**
  * @brief  Retrieve the current Ethernet configuration (media interface and MAC address).
  *
  * This function reads back the hardware configuration of the Ethernet
  * peripheral associated with @p heth and fills the @ref hal_eth_config_t
  * structure pointed to by @p p_config.
  *
  * It:
  * - Reads the media interface configuration from RCC or SBS (depending on
  *   the product) and sets @c p_config->media_interface to one of supported
  *   values in @ref hal_eth_media_interface_t.
  * - Reads the primary MAC address (MACA0) from @c MACA0LR and @c MACA0HR
  *   registers and writes it into @c p_config->mac_addr[0..5].
  *
  * @param[in]  heth
  *         Pointer to a constant @ref hal_eth_handle_t structure that contains
  *         the Ethernet peripheral instance and state. Its @c global_state
  *         must be @ref HAL_ETH_STATE_CONFIGURED.
  * @param[out] p_config
  *         Pointer to a @ref hal_eth_config_t structure where the current
  *         configuration will be stored (media interface and MAC address).
  *
  * @pre
  * - @p heth must not be @c NULL.
  * - @p p_config must not be @c NULL.
  * - @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED
  *   (checked with debug and optional runtime checks).
  *
  * @note This function does not perform any hardware reconfiguration; it only
  *       reads the current registers and copies their values into @p p_config.
  * @note The content of @c p_config can later be passed to
  *       @ref HAL_ETH_SetConfig() to re-apply or modify the configuration.
  *
  * @sa HAL_ETH_SetConfig
  */
void HAL_ETH_GetConfig(const hal_eth_handle_t *heth, hal_eth_config_t *p_config)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if (LL_SBS_GetETHPHYInterface(LL_SBS_PERIPH_ETH1) == LL_SBS_ETHPHY_ITF_GMII_MII)
  {
    p_config->media_interface = HAL_ETH_MEDIA_IF_MII;
  }
  else
  {
    p_config->media_interface = HAL_ETH_MEDIA_IF_RMII;
  }

  uint32_t macaddrlr = STM32_READ_REG(ETH_GET_INSTANCE(heth)->MACA0LR);
  uint32_t macaddrhr = STM32_READ_REG(ETH_GET_INSTANCE(heth)->MACA0HR);

  p_config->mac_addr[0] = (uint8_t)(macaddrlr & 0xFFUL);
  p_config->mac_addr[1] = (uint8_t)((macaddrlr >> 8U)  & 0xFFUL);
  p_config->mac_addr[2] = (uint8_t)((macaddrlr >> 16U) & 0xFFUL);
  p_config->mac_addr[3] = (uint8_t)((macaddrlr >> 24U) & 0xFFUL);
  p_config->mac_addr[4] = (uint8_t)(macaddrhr & 0xFFUL);
  p_config->mac_addr[5] = (uint8_t)((macaddrhr >> 8U)  & 0xFFUL);
}

/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group3
  * @{
This subsection provides functions allowing to configure the Ethernet Sub-Blocks:
  - MAC sub-block:
    - HAL_ETH_MAC_SetConfig(): Configure the MAC sub-block for selected ETHx instance.
    - HAL_ETH_MAC_GetConfig(): Retrieve the current configuration of MAC sub-block for selected ETHx instance.
  - DMA sub-block:
    - HAL_ETH_DMA_SetConfig(): Configure the DMA sub-block for selected ETHx instance.
    - HAL_ETH_DMA_GetConfig(): Retrieve the current configuration of DMA sub-block for selected ETHx instance.
  - MTL sub-block:
    - HAL_ETH_MTL_SetConfig(): Configure the MTL sub-block for selected ETHx instance.
    - HAL_ETH_MTL_GetConfig(): Retrieve the current configuration of MTL sub-block for selected ETHx instance.
  */
/**
  * @brief  Retrieve the current MAC configuration from the ETH peripheral.
  *
  * This function reads the MAC control and extended control registers of the
  * Ethernet peripheral associated to @p heth and fills the @p p_macconf
  * structure with the current hardware configuration.
  *
  * The retrieved configuration includes, but is not limited to:
  * - Link configuration: speed and duplex mode.
  * - Loopback mode.
  * - Source address control.
  * - Inter-packet gap (IPG) settings.
  * - Back-off limit.
  * - Preamble length.
  * - Giant packet size limit and related control.
  * - 2K packet support.
  * - CRC strip and pad/CRC strip controls.
  * - TX jabber timer control.
  * - Carrier sense (CS) before/during transmit controls.
  * - Retry transmission control.
  * - RX watchdog timer, RX jumbo packet, and RX checksum offload controls.
  * - RX receive own control.
  * - RX CRC checking control.
  * - Deferral check control.
  * - Slow protocol (unicast and general) detection controls.
  * - Extended inter-packet gap control and value.
  * - Programmable watchdog control and timeout.
  * - Flow control configuration (TX pause time, zero-quanta pause, pause.
  *   low threshold, TX/RX flow control, unicast pause packet detection).
  * - Optional packet burst mode (when not in fast-only operation).
  *
  * @param[in]  heth      Pointer to a @ref hal_eth_handle_t structure that
  *                       contains the configuration information for the
  *                       specified Ethernet peripheral.
  * @param[out] p_macconf Pointer to a @ref hal_eth_mac_config_t structure
  *                       that will be filled with the current MAC configuration
  *                       read from the hardware registers.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_macconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note This API only queries the hardware registers. It does not modify
  *       any MAC configuration.
  * @note The Ethernet HAL handle @p heth must be in the @ref HAL_ETH_STATE_CONFIGURED
  *       state when calling this function; otherwise an assertion can be raised
  *       in debug builds.
  */
void HAL_ETH_MAC_GetConfig(const hal_eth_handle_t *heth, hal_eth_mac_config_t *p_macconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_macconf != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_macconf == NULL)
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  const ETH_TypeDef *p_ethx = ETH_GET_INSTANCE(heth);

  p_macconf->link_config.speed = (hal_eth_mac_speed_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                                (ETH_MACCR_FES)));
  p_macconf->link_config.duplex_mode = (hal_eth_mac_duplex_mode_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                   ETH_MACCR_DM));
  p_macconf->loopback_mode = (hal_eth_mac_loopback_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                           ETH_MACCR_LM));
  p_macconf->src_addr_ctrl = (hal_eth_mac_src_addr_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                           ETH_MACCR_SARC));
  p_macconf->inter_pkt_gap_value = (hal_eth_mac_inter_pkt_gap_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                 ETH_MACCR_IPG));
  p_macconf->back_off_limit = (hal_eth_mac_back_off_limit_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                             ETH_MACCR_BL));
  p_macconf->preamble_length = (hal_eth_mac_preeamble_length_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                ETH_MACCR_PRELEN));
  p_macconf->giant_pkt_size_limit_ctrl = (hal_eth_mac_gpkt_sz_limit_ctrl_t)
                                         ((uint32_t)STM32_READ_BIT(p_ethx->MACCR, ETH_MACCR_GPSLCE));
  p_macconf->support_2K_pkt = (hal_eth_mac_2k_pkt_len_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                              ETH_MACCR_S2KP));
  p_macconf->crc_strip_type_pkt = (hal_eth_mac_crc_strip_pkt_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                     ETH_MACCR_CST));
  p_macconf->auto_pad_crc_strip = (hal_eth_mac_auto_pad_crc_s_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                      ETH_MACCR_ACS));
  p_macconf->tx_jabber = (hal_eth_mac_tx_jabber_tim_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                            ETH_MACCR_JD));
  p_macconf->cs_before_transmit = (hal_eth_mac_cs_before_tr_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                    ETH_MACCR_ECRSFD));
  p_macconf->cs_during_transmit = (hal_eth_mac_cs_during_tr_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                    ETH_MACCR_DCRS));
  p_macconf->retry_transmission = (hal_eth_mac_retry_tr_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                ETH_MACCR_DR));
  p_macconf->rx_watchdog = (hal_eth_mac_rx_wd_tim_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                          ETH_MACCR_WD));
  p_macconf->rx_jumbo_pkt = (hal_eth_mac_rx_jumbo_pkt_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                              ETH_MACCR_JE));
  p_macconf->rx_csum_offload = (hal_eth_mac_rx_csum_pkt_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                ETH_MACCR_IPC));
  p_macconf->rx_receive_own = (hal_eth_mac_rx_receive_own_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                  ETH_MACCR_DO));
  p_macconf->crc_checking_rx_pkts = (hal_eth_mac_rx_crc_pkt_chk_ctrl_t)
                                    ((uint32_t)STM32_READ_BIT(p_ethx->MACECR,
                                                              ETH_MACECR_DCRCC));
  p_macconf->deferral_check = (hal_eth_mac_deferral_check_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACCR,
                                                                  ETH_MACCR_DC));
  p_macconf->uc_slow_proto_detect = (hal_eth_mac_uc_slow_proto_ctrl_t)
                                    ((uint32_t)STM32_READ_BIT(p_ethx->MACECR,
                                                              ETH_MACECR_USP));
  p_macconf->slow_proto_detect = (hal_eth_mac_slow_proto_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACECR,
                                                                 ETH_MACECR_SPEN));
  p_macconf->giant_pkt_size_limit = STM32_READ_BIT(p_ethx->MACECR, ETH_MACECR_GPSL);
  p_macconf->ext_inter_pkt_gap_ctrl = (hal_eth_mac_ex_int_pkt_gap_ctrl_t)((uint32_t)STM32_READ_BIT(
                                                                            p_ethx->MACECR, ETH_MACECR_EIPGEN));
  p_macconf->ext_inter_pkt_gap = (uint32_t)(STM32_READ_BIT(p_ethx->MACECR, ETH_MACECR_EIPG)
                                            >> ETH_MACECR_EIPG_Pos);
  p_macconf->programmable_wd = (hal_eth_mac_prog_wd_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACWJBTR,
                                                            ETH_MACWJBTR_PWE));
  p_macconf->rx_wd_timeout_byte = (hal_eth_mac_rx_wd_timeout_t)((uint32_t)STM32_READ_BIT(p_ethx->MACWJBTR,
                                                                ETH_MACWJBTR_WTO));
  p_macconf->tx_pause_time = (uint32_t)(STM32_READ_BIT(p_ethx->MACQTXFCR, ETH_MACQTXFCR_PT)
                                        >> ETH_MACQTXFCR_PT_Pos);
  p_macconf->zero_quanta_pause = (hal_eth_mac_zero_q_pause_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACQTXFCR,
                                                                   ETH_MACQTXFCR_DZPQ));
  p_macconf->pause_low_threshold = (hal_eth_mac_pause_low_thr_t)((uint32_t)STM32_READ_BIT(p_ethx->MACQTXFCR,
                                                                 ETH_MACQTXFCR_PLT));
  p_macconf->tr_flow_ctrl = (hal_eth_mac_tr_flow_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACQTXFCR,
                                                                                  ETH_MACQTXFCR_TFE));
  p_macconf->uc_pause_pkt_detect = (hal_eth_mac_uc_pause_pkt_ctrl_t)((uint32_t)STM32_READ_BIT(
                                                                       p_ethx->MACRXFCR, ETH_MACRXFCR_UP));
  p_macconf->receive_flow_ctrl = (hal_eth_mac_receive_flow_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MACRXFCR,
                                                                   ETH_MACRXFCR_RFE));
}

/**
  * @brief  Set the MAC configuration for the ETH peripheral.
  *
  * This function programs the Ethernet MAC configuration registers of the
  * peripheral associated with @p heth according to the parameters provided
  * in @p p_macconf.
  *
  * The configuration covers, among others:
  * - Link configuration: speed and duplex mode.
  * - Loopback mode.
  * - Source address control.
  * - Inter-packet gap (IPG) settings.
  * - Back-off limit.
  * - Preamble length.
  * - Giant packet size limit and related control.
  * - 2K packet support.
  * - CRC strip and pad/CRC strip controls.
  * - TX jabber timer control.
  * - Carrier sense (CS) before/during transmit controls.
  * - Retry transmission control.
  * - RX watchdog timer, RX jumbo packet, and RX checksum offload controls.
  * - RX receive own control.
  * - RX CRC checking control.
  * - Deferral check control.
  * - Slow protocol (unicast and general) detection controls.
  * - Extended inter-packet gap control and value.
  * - Programmable watchdog control and timeout.
  * - Flow control configuration (TX pause time, zero-quanta pause, pause.
  *   low threshold, TX/RX flow control, unicast pause packet detection).
  * - Optional packet burst mode (when not in fast-only operation).
  *
  * All fields of @p p_macconf are checked for validity using the corresponding
  * parameter-check macros (e.g. @c IS_ETH_MAC_SPEED, @c IS_ETH_MAC_DUPLEX_MODE,
  * etc.) in debug builds. If any field is invalid, an assertion can be raised.
  *
  * This API requires that the Ethernet HAL handle is already in the
  * @ref HAL_ETH_STATE_CONFIGURED state. It does not change the global state
  * of @p heth and does not start or stop the MAC; it only updates the
  * configuration registers.
  *
  * @param[in,out] heth      Pointer to a @ref hal_eth_handle_t structure that
  *                          contains the configuration information for the
  *                          specified Ethernet peripheral.
  * @param[in]     p_macconf Pointer to a constant @ref hal_eth_mac_config_t
  *                          structure that holds the MAC configuration to be
  *                          applied to the hardware.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_macconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @note In this implementation, invalid parameters are primarily handled
  *       via debug assertions. When `USE_HAL_CHECK_PARAM` is enabled,
  *       a `HAL_INVALID_PARAM` status can be returned when @p p_macconf
  *       is @c NULL.
  *
  * @retval HAL_OK           MAC configuration has been successfully applied.
  * @retval HAL_INVALID_PARAM
  *         - @p p_macconf is @c NULL when `USE_HAL_CHECK_PARAM` is enabled, or
  *         - One or more fields of @p p_macconf are invalid (only if your
  *           implementation uses this status in addition to assertions).
  */
hal_status_t HAL_ETH_MAC_SetConfig(hal_eth_handle_t *heth, const hal_eth_mac_config_t *p_macconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_macconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_MAC_SPEED(p_macconf->link_config.speed));
  ASSERT_DBG_PARAM(IS_ETH_MAC_DUPLEX_MODE(p_macconf->link_config.duplex_mode));
  ASSERT_DBG_PARAM(IS_ETH_MAC_LOOPBACK_CTRL(p_macconf->loopback_mode));
  ASSERT_DBG_PARAM(IS_ETH_MAC_SRC_ADDR_CTRL(p_macconf->src_addr_ctrl));
  ASSERT_DBG_PARAM(IS_ETH_MAC_INTER_PKT_GAP(p_macconf->inter_pkt_gap_value));
  ASSERT_DBG_PARAM(IS_ETH_MAC_BACK_OFF_LIMIT(p_macconf->back_off_limit));
  ASSERT_DBG_PARAM(IS_ETH_MAC_PREAMBLE_LENGTH(p_macconf->preamble_length));
  ASSERT_DBG_PARAM(IS_ETH_MAC_GPKT_SZ_LIMIT_CTRL(p_macconf->giant_pkt_size_limit_ctrl));
  ASSERT_DBG_PARAM(IS_ETH_MAC_2K_PKT_LEN_CTRL(p_macconf->support_2K_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MAC_CRC_STRIP_PKT_CTRL(p_macconf->crc_strip_type_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MAC_AUTO_PAD_CRC_S_CTRL(p_macconf->auto_pad_crc_strip));
  ASSERT_DBG_PARAM(IS_ETH_MAC_TX_JABBER_TIM_CTRL(p_macconf->tx_jabber));
  ASSERT_DBG_PARAM(IS_ETH_MAC_CS_BEFORE_TR_CTRL(p_macconf->cs_before_transmit));
  ASSERT_DBG_PARAM(IS_ETH_MAC_CS_DURING_TR_CTRL(p_macconf->cs_during_transmit));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RETRY_TR_CTRL(p_macconf->retry_transmission));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_WD_TIM_CTRL(p_macconf->rx_watchdog));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_JUMBO_PKT_CTRL(p_macconf->rx_jumbo_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_CSUM_PKT_CTRL(p_macconf->rx_csum_offload));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_RECEIVE_OWN_CTRL(p_macconf->rx_receive_own));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_CRC_PKT_CHK_CTRL(p_macconf->crc_checking_rx_pkts));
  ASSERT_DBG_PARAM(IS_ETH_MAC_DEFERRAL_CHECK_CTRL(p_macconf->deferral_check));
  ASSERT_DBG_PARAM(IS_ETH_MAC_UC_SLOW_PROTO_CTRL(p_macconf->uc_slow_proto_detect));
  ASSERT_DBG_PARAM(IS_ETH_MAC_SLOW_PROTO_CTRL(p_macconf->slow_proto_detect));
  ASSERT_DBG_PARAM(IS_ETH_MAC_GIANT_PKT_SIZE_LIMIT(p_macconf->giant_pkt_size_limit));
  ASSERT_DBG_PARAM(IS_ETH_MAC_EX_INT_PKT_GAP_CTRL(p_macconf->ext_inter_pkt_gap_ctrl));
  ASSERT_DBG_PARAM(IS_ETH_MAC_EXT_INTER_PKT_GAP(p_macconf->ext_inter_pkt_gap));
  ASSERT_DBG_PARAM(IS_ETH_MAC_PROG_WD_CTRL(p_macconf->programmable_wd));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RX_WD_TIMEOUT_BYTE(p_macconf->rx_wd_timeout_byte));
  ASSERT_DBG_PARAM(IS_ETH_MAC_TX_PAUSE_TIME(p_macconf->tx_pause_time));
  ASSERT_DBG_PARAM(IS_ETH_MAC_ZERO_Q_PAUSE_CTRL(p_macconf->zero_quanta_pause));
  ASSERT_DBG_PARAM(IS_ETH_MAC_PAUSE_LOW_THR(p_macconf->pause_low_threshold));
  ASSERT_DBG_PARAM(IS_ETH_MAC_TR_FLOW_CTRL(p_macconf->tr_flow_ctrl));
  ASSERT_DBG_PARAM(IS_ETH_MAC_UC_PAUSE_PKT_CTRL(p_macconf->uc_pause_pkt_detect));
  ASSERT_DBG_PARAM(IS_ETH_MAC_RECEIVE_FLOW_CTRL(p_macconf->receive_flow_ctrl));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_macconf == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

