MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  ETH_MAC_SetConfig(heth, p_macconf);

  return HAL_OK;
}

/**
  * @brief  Get the DMA configuration of the ETH peripheral.
  *
  * This function reads the DMA-related registers of the Ethernet peripheral
  * associated with @p heth and fills the @p p_dmaconf structure with the
  * current hardware configuration.
  *
  * The retrieved configuration includes (depending on the build-time
  * options and system bus type):
  * - TX/RX transfer arbitration algorithm.
  * - Address-aligned beats enable/disable.
  * - DMA burst mode configuration.
  * - Maximum bus burst length (in beats).
  * - System Bus configurations (OSR limits or Mixed burst and rebuild increment
  *   burst).
  * - DMA transfer priority configuration.
  *
  * @param[in]  heth      Pointer to a @ref hal_eth_handle_t structure that
  *                       contains the configuration information for the
  *                       specified Ethernet peripheral.
  * @param[out] p_dmaconf Pointer to a @ref hal_eth_dma_config_t structure
  *                       that will be filled with the current DMA configuration
  *                       read from the hardware registers.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_dmaconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note This API only queries the DMA configuration registers. It does not
  *       modify any configuration or DMA state.
  * @note The Ethernet HAL handle @p heth must be in the
  *       @ref HAL_ETH_STATE_CONFIGURED state when calling this function;
  *       otherwise an assertion is raised in debug builds.
  */
void HAL_ETH_DMA_GetConfig(const hal_eth_handle_t *heth, hal_eth_dma_config_t *p_dmaconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_dmaconf != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_dmaconf == NULL)
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  const ETH_TypeDef *p_ethx = ETH_GET_INSTANCE(heth);

  p_dmaconf->addr_aligned_beats = (hal_eth_dma_addr_align_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->DMASBMR,
                                                                  ETH_DMASBMR_AAL));
  p_dmaconf->burst_mode = (hal_eth_dma_burst_len_mode_t)((uint32_t)STM32_READ_BIT(p_ethx->DMASBMR,
                                                                                  ETH_DMASBMR_FB));
  p_dmaconf->mixed_burst = (hal_eth_dma_mixed_burst_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->DMASBMR,
                                                            ETH_DMASBMR_MB));
  p_dmaconf->rebuild_inc_burst = (hal_eth_dma_rebuild_inc_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->DMASBMR,
                                                                  ETH_DMASBMR_RB));
  p_dmaconf->tr_priority = (hal_eth_dma_tr_prio_ctrl_t)((uint32_t)STM32_READ_BIT(
                                                          p_ethx->DMAMR, ETH_DMAMR_TXPR));
}

/**
  * @brief  Set the DMA configuration of the ETH peripheral.
  *
  * This function programs the DMA-related registers of the Ethernet peripheral
  * associated with @p heth according to the parameters provided in @p p_dmaconf.
  *
  * The configuration can include (depending on the build-time options and
  * system bus type):
  * - TX/RX transfer arbitration algorithm.
  * - Address-aligned beats control.
  * - DMA burst length mode.
  * - Maximum bus burst length (in beats).
  * - System Bus configurations (OSR limits or Mixed burst and rebuild increment
  *   burst).
  * - DMA transfer priority configuration.
  *
  * All fields of @p p_dmaconf are checked for validity using the corresponding
  * parameter-check macros (for example, @c IS_ETH_DMA_TR_ARBITRATION_ALGO,
  * @c IS_ETH_DMA_ADDR_ALIGNED_BEATS, @c IS_ETH_DMA_BURST_LEN_MODE, etc.) in
  * debug builds. If any field is invalid, an assertion is raised.
  *
  * This API requires that the Ethernet HAL handle is already in the
  * @ref HAL_ETH_STATE_CONFIGURED state. It does not change the global state
  * of @p heth and does not start or stop the DMA; it only updates the DMA
  * configuration registers.
  *
  * @param[in,out] heth      Pointer to a @ref hal_eth_handle_t structure that
  *                          contains the configuration information for the
  *                          specified Ethernet peripheral.
  * @param[in]     p_dmaconf Pointer to a constant @ref hal_eth_dma_config_t
  *                          structure that holds the DMA configuration to be
  *                          applied to the hardware.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_dmaconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @note In this implementation, most invalid parameters are handled via
  *       debug assertions. When `USE_HAL_CHECK_PARAM` is enabled, a
  *       `HAL_INVALID_PARAM` status is returned if @p p_dmaconf is @c NULL.
  *
  * @retval HAL_OK           DMA configuration has been successfully applied.
  * @retval HAL_INVALID_PARAM
  *         - @p p_dmaconf is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_DMA_SetConfig(hal_eth_handle_t *heth, const hal_eth_dma_config_t *p_dmaconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_dmaconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_DMA_ADDR_ALIGNED_BEATS(p_dmaconf->addr_aligned_beats));
  ASSERT_DBG_PARAM(IS_ETH_DMA_BURST_LEN_MODE(p_dmaconf->burst_mode));
  ASSERT_DBG_PARAM(IS_ETH_DMA_MIXED_BURST_CTRL(p_dmaconf->mixed_burst));
  ASSERT_DBG_PARAM(IS_ETH_DMA_REBUILD_INC_CTRL(p_dmaconf->rebuild_inc_burst));
  ASSERT_DBG_PARAM(IS_ETH_DMA_TR_PRIO_CTRL(p_dmaconf->tr_priority));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_dmaconf == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_DMA_SetConfig(heth, p_dmaconf);

  return HAL_OK;
}

/**
  * @brief  Get the MTL configuration of the ETH peripheral.
  *
  * This function reads the MTL (MAC Transmission Layer) related registers of
  * the Ethernet peripheral associated with @p heth and fills the @p p_mtlconf
  * structure with the current hardware configuration.
  *
  * The retrieved configuration can include (depending on the build-time
  * options):
  * - TX scheduling algorithm configuration.
  * - RX arbitration algorithm configuration.
  * - TX forward status control (forwarding behavior when store-and-forward
  *   conditions are not fully met).
  *
  * @param[in]  heth      Pointer to a @ref hal_eth_handle_t structure that
  *                       contains the configuration information for the
  *                       specified Ethernet peripheral.
  * @param[out] p_mtlconf Pointer to a @ref hal_eth_mtl_config_t structure
  *                       that will be filled with the current MTL configuration
  *                       read from the hardware registers.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_mtlconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note This API only queries the MTL configuration registers. It does not
  *       modify any configuration or MTL state.
  * @note The Ethernet HAL handle @p heth must be in the
  *       @ref HAL_ETH_STATE_CONFIGURED state when calling this function;
  *       otherwise an assertion can be raised in debug builds.
  */
void HAL_ETH_MTL_GetConfig(const hal_eth_handle_t *heth, hal_eth_mtl_config_t *p_mtlconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_mtlconf != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_mtlconf == NULL)
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  const ETH_TypeDef *p_ethx = ETH_GET_INSTANCE(heth);
  p_mtlconf->tx_fwd_status = (hal_eth_mtl_tx_fwd_status_ctrl_t)((uint32_t)STM32_READ_BIT(p_ethx->MTLOMR,
                                                                ETH_MTLOMR_DTXSTS));
}

/**
  * @brief  Set the MTL configuration of the ETH peripheral.
  *
  * This function programs the MTL (MAC Transmission Layer) related registers
  * of the Ethernet peripheral associated with @p heth according to the
  * parameters provided in @p p_mtlconf.
  *
  * The configuration can include (depending on the build-time options):
  * - TX scheduling algorithm configuration.
  * - RX arbitration algorithm configuration.
  * - TX forward status control (forwarding behavior when store-and-forward
  *   conditions are not fully met).
  *
  * All fields of @p p_mtlconf are checked for validity using the corresponding
  * parameter-check macros (for example, @c IS_ETH_MTL_TX_SCHEDULING_ALGO,
  * @c IS_ETH_MTL_RX_ARBITRATION_ALGO, @c IS_ETH_MTL_TX_FWD_STATUS_CTRL) in
  * debug builds. If any field is invalid, an assertion can be raised.
  *
  * This API requires that the Ethernet HAL handle is already in the
  * @ref HAL_ETH_STATE_CONFIGURED state. It does not change the global state
  * of @p heth and does not start or stop the MTL; it only updates the MTL
  * configuration registers.
  *
  * @param[in,out] heth      Pointer to a @ref hal_eth_handle_t structure that
  *                          contains the configuration information for the
  *                          specified Ethernet peripheral.
  * @param[in]     p_mtlconf Pointer to a constant @ref hal_eth_mtl_config_t
  *                          structure that holds the MTL configuration to be
  *                          applied to the hardware.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_mtlconf must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note In this implementation, most invalid parameters are handled via
  *       debug assertions. When `USE_HAL_CHECK_PARAM` is enabled, a
  *       `HAL_INVALID_PARAM` status is returned if @p p_mtlconf is @c NULL.
  *
  * @retval HAL_OK           MTL configuration has been successfully applied.
  * @retval HAL_INVALID_PARAM
  *         - @p p_mtlconf is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_MTL_SetConfig(hal_eth_handle_t *heth, const hal_eth_mtl_config_t *p_mtlconf)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_mtlconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_MTL_TX_FWD_STATUS_CTRL(p_mtlconf->tx_fwd_status));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_mtlconf == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_MTL_SetConfig(heth, p_mtlconf);

  return HAL_OK;
}
/**
  * @}
  */

