MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/** @addtogroup ETH_Exported_Functions_Group4
  * @{
This subsection provides functions allowing to configure the Ethernet Channels:
  - HAL_ETH_SetConfigTxChannel(): Configure the selected Tx ETHx Channel.
  - HAL_ETH_SetConfigRxChannel(): Configure the selected Rx ETHx Channel.
  - HAL_ETH_GetConfigTxChannel(): Retrieve the current configuration of the selected Tx ETHx Channel.
  - HAL_ETH_GetConfigRxChannel(): Retrieve the current configuration of the selected Rx ETHx Channel.
  - HAL_ETH_GetChannelAllocNeeds(): Retrieve Memory Allocation Needs (requirements) for the selected
    Tx/Rx ETHx Channel.
  */
/**
  * @brief  Set the configuration for a Tx channel.
  *
  * This function configures a given Ethernet Tx channel and its associated
  * MTL Tx queue and DMA Tx channel according to the parameters provided in
  * @p p_chconf.
  *
  * The configuration includes:
  * - DMA Tx channel configuration (PBL x8 mode, burst length, second-packet
  *   operate control, and descriptor alignment requirements).
  * - MTL Tx queue configuration (operating mode, queue size, transmit mode,
  *   and, when supported, queue average (AV) algorithm).
  * - FIFO event configuration (event mode and event parameters).
  * - Maximum number of application buffers associated with this channel.
  *
  * The function also:
  * - Validates the @p channel index and Tx channel parameters.
  * - Checks and aligns the descriptor size to the requested alignment.
  * - Updates the internal Tx channel state to
  *   @ref HAL_ETH_CHANNEL_STATE_CONFIGURED when successful.
  *
  * @param[in,out] heth     Pointer to a @ref hal_eth_handle_t structure that
  *                         contains the configuration information for the
  *                         specified Ethernet peripheral.
  * @param[in]     channel  Channel index to be configured, as defined by
  *                         @ref IS_ETH_CHANNEL_TX_INDEX.
  * @param[in]     p_chconf Pointer to a constant @ref hal_eth_tx_channel_config_t
  *                         structure that holds the Tx channel configuration
  *                         to be applied.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_chconf must not be @c NULL.
  * @pre @p channel must be a valid Tx channel index (see @ref IS_ETH_CHANNEL_TX_INDEX).
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @pre The Tx channel state must be @ref HAL_ETH_CHANNEL_STATE_RESET or
  *      @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  *
  * @note In this implementation, most invalid parameters are handled via
  *       debug assertions. When `USE_HAL_CHECK_PARAM` is enabled, a
  *       `HAL_INVALID_PARAM` status is returned if @p p_chconf is @c NULL
  *       or @p channel is invalid, or if descriptor alignment fails.
  *
  * @note The internal descriptor ring size is multiplied by
  *       @ref ETH_MAX_DESC_PER_APP_BUF_CNT to account for both context
  *       descriptors and data descriptors.Therefore, the application can
  *       start the channel with a descriptor ring size that differs from the
  *       size implied by @p p_chconf->max_app_buffers_num.
  *
  * @retval HAL_OK           Tx channel configuration has been successfully applied.
  * @retval HAL_INVALID_PARAM
  *         - @p p_chconf is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *         - @p channel is invalid when `USE_HAL_CHECK_PARAM` is enabled.
  *         - The requested descriptor alignment cannot be satisfied by
  *           the DMA descriptor size alignment constraints.
  */
hal_status_t HAL_ETH_SetConfigTxChannel(hal_eth_handle_t *heth, uint32_t channel,
                                        const hal_eth_tx_channel_config_t *p_chconf)
{
  uint32_t ch = 0;
  uint32_t desc_size_aligned = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_chconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_TX_INDEX(channel));
  ASSERT_DBG_PARAM(IS_ETH_DMA_TX_PBL_X8_MODE(p_chconf->dma_channel_config.tx_pbl_x8_mode));
  ASSERT_DBG_PARAM(IS_ETH_DMA_TX_BURST_LENGTH(p_chconf->dma_channel_config.tx_dma_burst_length));
  ASSERT_DBG_PARAM(IS_ETH_DMA_TX_SEC_PKT_OP_CTRL(p_chconf->dma_channel_config.tx_second_pkt_operate));
  ASSERT_DBG_PARAM(IS_ETH_MTL_TX_OPS_MODE(p_chconf->mtl_queue_config.queue_op_mode));
  ASSERT_DBG_PARAM(IS_ETH_MAX_APP_BUFFERS_NUM(p_chconf->max_app_buffers_num));
  ASSERT_DBG_PARAM(IS_ETH_MTL_TX_QUEUE_SIZE(p_chconf->mtl_queue_config.queue_size_byte));
  ASSERT_DBG_PARAM(IS_ETH_MTL_TX_TRANSMIT_MODE(p_chconf->mtl_queue_config.transmit_queue_mode));
  ASSERT_DBG_PARAM(IS_ETH_FIFO_EVENT_MODE(p_chconf->fifo_event_config.event_mode));
  ASSERT_DBG_PARAM(IS_ETH_FIFO_EVENT_PARAMS(p_chconf->fifo_event_config.event_mode,
                                            p_chconf->fifo_event_config.event_params));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_chconf == NULL) || (IS_ETH_CHANNEL_TX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetTXChIndex(&ch, channel);

  /* Align descriptor size (DMA DSL constraints). */
  if (ETH_AlignDescSize(p_chconf->req_desc_size_align_byte, &desc_size_aligned) != HAL_OK)
  {
    return HAL_INVALID_PARAM;
  }

  ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_RESET |
                   (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

  heth->tx_channels[ch].tx_desc_list.desc_len_byte = desc_size_aligned;
  heth->tx_channels[ch].tx_desc_list.total_desc_cnt = p_chconf->max_app_buffers_num * ETH_MAX_DESC_PER_APP_BUF_CNT;
  heth->tx_channels[ch].fifo_event_config.event_mode = p_chconf->fifo_event_config.event_mode;
  heth->tx_channels[ch].fifo_event_config.event_params = p_chconf->fifo_event_config.event_params;

  ETH_DMA_SetConfigTxChannel(heth, ch, &p_chconf->dma_channel_config);

  ETH_MTL_SetConfigTxChannel(heth, ch, &p_chconf->mtl_queue_config);

  heth->tx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_CONFIGURED;
  return HAL_OK;
}

/**
  * @brief  Set the configuration for a Rx channel.
  *
  * This function configures a given Ethernet Rx channel and its associated
  * MTL Rx queue and DMA Rx channel according to the parameters provided in
  * @p p_chconf.
  *
  * The configuration includes:
  * - DMA Rx channel configuration (burst length, buffer length, and descriptor
  *   alignment requirements).
  * - MTL Rx queue configuration (operating mode, queue size, checksum error
  *   drop behavior, forwarding of error and undersized packets, and receive
  *   queue mode).
  * - Mapping of the MTL Rx queue to a DMA channel when multiple Rx channels
  *   are supported.
  * - FIFO event configuration (event mode and event parameters).
  * - Maximum number of application buffers associated with this channel.
  *
  * The function also:
  * - Validates the @p channel index and Rx channel parameters.
  * - Ensures the Rx buffer length is aligned to the bus data width
  *   (`ETH_BUS_DATA_WIDTH_BYTE`).
  * - Checks and aligns the descriptor size to the requested alignment.
  * - Updates the internal Rx channel state to
  *   @ref HAL_ETH_CHANNEL_STATE_CONFIGURED when successful.
  *
  * @param[in,out] heth     Pointer to a @ref hal_eth_handle_t structure that
  *                         contains the configuration information for the
  *                         specified Ethernet peripheral.
  * @param[in]     channel  Channel index to be configured, as defined by
  *                         @ref IS_ETH_CHANNEL_RX_INDEX.
  * @param[in]     p_chconf Pointer to a constant @ref hal_eth_rx_channel_config_t
  *                         structure that holds the Rx channel configuration
  *                         to be applied.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_chconf must not be @c NULL.
  * @pre @p channel must be a valid Rx channel index (see @ref IS_ETH_CHANNEL_RX_INDEX).
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @pre The Rx channel state must be @ref HAL_ETH_CHANNEL_STATE_RESET or
  *      @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  *
  * @note In this implementation, most invalid parameters are handled via
  *       debug assertions. When `USE_HAL_CHECK_PARAM` is enabled, a
  *       `HAL_INVALID_PARAM` status is returned if @p p_chconf is @c NULL,
  *       @p channel is invalid, or if buffer or descriptor alignment checks fail.
  *
  * @note The internal descriptor ring size is multiplied by
  *       @ref ETH_MAX_DESC_PER_APP_BUF_CNT to account for both context
  *       descriptors and data descriptors.Therefore, the application can
  *       start the channel with a descriptor ring size that differs from the
  *       size implied by @p p_chconf->max_app_buffers_num.
  *
  * @retval HAL_OK           Rx channel configuration has been successfully applied.
  * @retval HAL_INVALID_PARAM
  *         - @p p_chconf is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *         - @p channel is invalid when `USE_HAL_CHECK_PARAM` is enabled.
  *         - The Rx buffer length is not aligned to `ETH_BUS_DATA_WIDTH_BYTE`.
  *         - The requested descriptor alignment cannot be satisfied by
  *           the DMA descriptor size alignment constraints.
  */
hal_status_t HAL_ETH_SetConfigRxChannel(hal_eth_handle_t *heth, uint32_t channel,
                                        const hal_eth_rx_channel_config_t *p_chconf)
{
  uint32_t ch = 0;
  uint32_t desc_size_aligned = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_chconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_RX_INDEX(channel));
  ASSERT_DBG_PARAM(IS_ETH_DMA_RX_BURST_LENGTH(p_chconf->dma_channel_config.rx_dma_burst_length));
  ASSERT_DBG_PARAM(IS_ETH_DMA_RX_BUFFER_LEN_ALIGNED(p_chconf->dma_channel_config.rx_buffer_len_byte));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_OPS_MODE(p_chconf->mtl_queue_config.queue_op_mode));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_QUEUE_SIZE(p_chconf->mtl_queue_config.queue_size_byte));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_DROP_CS_ERR_CTRL(p_chconf->mtl_queue_config.drop_tcp_ip_csum_error_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_FWD_ERR_PKT_CTRL(p_chconf->mtl_queue_config.fwd_error_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_FWD_USZ_PKT_CTRL(p_chconf->mtl_queue_config.fwd_undersized_good_pkt));
  ASSERT_DBG_PARAM(IS_ETH_MTL_RX_QUEUE_MODE(p_chconf->mtl_queue_config.receive_queue_mode));
  ASSERT_DBG_PARAM(IS_ETH_MAX_APP_BUFFERS_NUM(p_chconf->max_app_buffers_num));
  ASSERT_DBG_PARAM(IS_ETH_FIFO_EVENT_MODE(p_chconf->fifo_event_config.event_mode));
  ASSERT_DBG_PARAM(IS_ETH_FIFO_EVENT_PARAMS(p_chconf->fifo_event_config.event_mode,
                                            p_chconf->fifo_event_config.event_params));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_chconf == NULL) || (IS_ETH_CHANNEL_RX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if ((p_chconf->dma_channel_config.rx_buffer_len_byte % (uint32_t)ETH_BUS_DATA_WIDTH_BYTE) != 0UL)
  {
    return HAL_INVALID_PARAM;
  }

  ETH_GetRXChIndex(&ch, channel);

  ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_RESET |
                   (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

