MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  /* Align descriptor size (DMA DSL constraints). */
  if (ETH_AlignDescSize(p_chconf->req_desc_size_align_byte, &desc_size_aligned) != HAL_OK)
  {
    return HAL_INVALID_PARAM;
  }

  heth->rx_channels[ch].rx_desc_list.desc_len_byte = desc_size_aligned;
  heth->rx_channels[ch].rx_desc_list.total_desc_cnt = p_chconf->max_app_buffers_num * ETH_MAX_DESC_PER_APP_BUF_CNT;
  heth->rx_channels[ch].fifo_event_config.event_mode = p_chconf->fifo_event_config.event_mode;
  heth->rx_channels[ch].fifo_event_config.event_params = p_chconf->fifo_event_config.event_params;
  ETH_DMA_SetConfigRxChannel(heth, ch, &p_chconf->dma_channel_config);
  ETH_MTL_SetConfigRxChannel(heth, ch, &p_chconf->mtl_queue_config);
  heth->rx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief  Get the configuration for a Tx channel.
  *
  * This function retrieves the configuration of a given Ethernet Tx channel,
  * including the associated MTL Tx queue and DMA Tx channel, and stores it
  * in the structure pointed to by @p p_chconf.
  *
  * The retrieved configuration includes:
  * - Descriptor-related settings (maximum number of application buffers and
  *   descriptor size alignment).
  * - FIFO event configuration (event mode and event parameters).
  * - DMA Tx channel configuration.
  * - MTL Tx queue configuration.
  *
  * @param[in]  heth     Pointer to a @ref hal_eth_handle_t structure that
  *                      contains the configuration information for the
  *                      specified Ethernet peripheral.
  * @param[in]  channel  Channel index whose configuration is requested, as
  *                      defined by @ref IS_ETH_CHANNEL_TX_INDEX.
  * @param[out] p_chconf Pointer to a @ref hal_eth_tx_channel_config_t
  *                      structure that will be filled with the current Tx
  *                      channel configuration.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_chconf must not be @c NULL.
  * @pre @p channel must be a valid Tx channel index (see @ref IS_ETH_CHANNEL_TX_INDEX).
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  */
void HAL_ETH_GetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t channel,
                                hal_eth_tx_channel_config_t *p_chconf)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_TX_INDEX(channel));
  ASSERT_DBG_PARAM(p_chconf != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_chconf == NULL) || (IS_ETH_CHANNEL_TX_INDEX(channel) == 0UL))
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetTXChIndex(&ch, channel);

  p_chconf->max_app_buffers_num = heth->tx_channels[ch].tx_desc_list.total_desc_cnt / ETH_MAX_DESC_PER_APP_BUF_CNT;
  p_chconf->req_desc_size_align_byte = heth->tx_channels[ch].tx_desc_list.desc_len_byte;
  p_chconf->fifo_event_config.event_mode = heth->tx_channels[ch].fifo_event_config.event_mode;
  p_chconf->fifo_event_config.event_params = heth->tx_channels[ch].fifo_event_config.event_params;
  ETH_GetDMATxChannelConfig(heth, ch, &p_chconf->dma_channel_config);
  ETH_GetMtlTxChannelConfig(heth, ch, &p_chconf->mtl_queue_config);
}

/**
  * @brief  Get the configuration for a Rx channel.
  *
  * This function retrieves the configuration of a given Ethernet Rx channel,
  * including the associated MTL Rx queue and DMA Rx channel, and stores it
  * in the structure pointed to by @p p_chconf.
  *
  * The retrieved configuration includes:
  * - Descriptor-related settings (maximum number of application buffers and
  *   descriptor size alignment).
  * - FIFO event configuration (event mode and event parameters).
  * - DMA Rx channel configuration.
  * - MTL Rx queue configuration.
  *
  * @param[in]  heth     Pointer to a @ref hal_eth_handle_t structure that
  *                      contains the configuration information for the
  *                      specified Ethernet peripheral.
  * @param[in]  channel  Channel index whose configuration is requested, as
  *                      defined by @ref IS_ETH_CHANNEL_RX_INDEX.
  * @param[out] p_chconf Pointer to a @ref hal_eth_rx_channel_config_t
  *                      structure that will be filled with the current Rx
  *                      channel configuration.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_chconf must not be @c NULL.
  * @pre @p channel must be a valid Rx channel index (see @ref IS_ETH_CHANNEL_RX_INDEX).
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  */
void HAL_ETH_GetConfigRxChannel(const hal_eth_handle_t *heth, uint32_t channel,
                                hal_eth_rx_channel_config_t *p_chconf)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_chconf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_RX_INDEX(channel));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_chconf == NULL) || (IS_ETH_CHANNEL_RX_INDEX(channel) == 0UL))
  {
    return;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetRXChIndex(&ch, channel);

  p_chconf->max_app_buffers_num = heth->rx_channels[ch].rx_desc_list.total_desc_cnt / ETH_MAX_DESC_PER_APP_BUF_CNT;
  p_chconf->req_desc_size_align_byte = heth->rx_channels[ch].rx_desc_list.desc_len_byte;
  p_chconf->fifo_event_config.event_mode = heth->rx_channels[ch].fifo_event_config.event_mode;
  p_chconf->fifo_event_config.event_params = heth->rx_channels[ch].fifo_event_config.event_params;
  ETH_GetDMARxChannelConfig(heth, ch, &p_chconf->dma_channel_config);
  ETH_GetMtlRxChannelConfig(heth, ch, &p_chconf->mtl_queue_config);
}

/**
  * @brief  Get the memory allocation requirements for a channel.
  *
  * This function returns the memory size and alignment requirements for the
  * descriptor ring associated with a given Ethernet channel (Tx or Rx), and
  * stores them in the structure pointed to by @p p_ch_alloc_req.
  *
  * The function determines whether the specified @p channel is a Tx or Rx
  * channel, retrieves the corresponding internal channel context, and computes:
  * - The total memory size in bytes required for the descriptor ring.
  * - The required memory address alignment in bytes.
  *
  * The size is computed as:
  * @code
  * mem_size_byte = total_desc_cnt * desc_len_byte.
  * @endcode
  * and the alignment is set to `ETH_BUS_DATA_WIDTH_BYTE`.
  *
  * @param[in]  heth           Pointer to a @ref hal_eth_handle_t structure that
  *                            contains the configuration information for the
  *                            specified Ethernet peripheral.
  * @param[in]  channel        Channel index, as defined by @ref IS_ETH_CHANNEL_INDEX.
  *                            The function automatically distinguishes between
  *                            Tx and Rx channels using @ref HAL_ETH_TX_CHANNEL_ALL.
  * @param[out] p_ch_alloc_req Pointer to a @ref hal_eth_channel_alloc_needs_t
  *                            structure that will be filled with the memory
  *                            allocation requirements.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_ch_alloc_req must not be @c NULL.
  * @pre @p channel must be a valid channel index (see @ref IS_ETH_CHANNEL_INDEX).
  * @pre The corresponding Tx or Rx channel state must be
  *      @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  *
  * @note The values of `desc_len_byte` and `total_desc_cnt` depend on the channel configuration,
  *       in particular on whether the extended format and/or context descriptors are expected
  *       to be used.
  */
void HAL_ETH_GetChannelAllocNeeds(const hal_eth_handle_t *heth, uint32_t channel,
                                  hal_eth_channel_alloc_needs_t *p_ch_alloc_req)
{
  uint32_t ch = 0;
  uint32_t desc_cnt = 0UL;
  uint32_t desc_len_byte = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_ch_alloc_req != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

    desc_cnt = heth->tx_channels[ch].tx_desc_list.total_desc_cnt;
    desc_len_byte = heth->tx_channels[ch].tx_desc_list.desc_len_byte;

    p_ch_alloc_req->mem_size_byte = desc_cnt * desc_len_byte;
    p_ch_alloc_req->mem_addr_align_byte = (desc_len_byte == sizeof(eth_dma_descriptor_t))
                                          ? ETH_BUS_DATA_WIDTH_BYTE
                                          : desc_len_byte;
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

    desc_cnt = heth->rx_channels[ch].rx_desc_list.total_desc_cnt;
    desc_len_byte = heth->rx_channels[ch].rx_desc_list.desc_len_byte;

    p_ch_alloc_req->mem_size_byte = desc_cnt * desc_len_byte;
    p_ch_alloc_req->mem_addr_align_byte = (desc_len_byte == sizeof(eth_dma_descriptor_t))
                                          ? ETH_BUS_DATA_WIDTH_BYTE
                                          : desc_len_byte;
  }
}
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group5
  * @{
This subsection provides functions allowing the control of the Ethernet Peripheral Features:
  - MAC Update Link Config : provides functions allowing update the speed/duplex without resetting the MAC.
    - HAL_ETH_UpdateConfigLink(): Update the MAC speed and duplex mode.
  - MAC ARP offload Feature: provides functions allowing the control of the Ethernet ARP Offloading Feature.
    - HAL_ETH_EnableARPOffload(): Enable ARP offload.
    - HAL_ETH_DisableARPOffload(): Disable ARP offload.
    - HAL_ETH_IsEnabledARPOffload(): Check if the ETH ARP offload is enabled.
    - HAL_ETH_SetARPTargetIP(): Set ARP target IP address.
  - MAC LPM Feature: provides functions allowing the control of the Ethernet LPM Feature.
    - HAL_ETH_EnterPowerDownMode(): Enters Ethernet Power Down mode with specified PMT control flags.
    - HAL_ETH_ExitPowerDownMode(): Exit power down mode.
    - HAL_ETH_SetRemoteWakeUpPcktFilter(): Configures the Remote Wake-Up Packet Filter LUT for Ethernet.
  - EEE Features: provides functions allowing the control of the Ethernet EEE Feature.
    - HAL_ETH_EnterLPIMode(): Configures Ethernet LPI (Low Power Idle) control flags.
    - HAL_ETH_ExitLPIMode(): Exit LPI (Low Power Idle) mode.
  */
/**
  * @brief  Update the Ethernet MAC link configuration (speed and duplex mode).
  *
  * This function updates the Ethernet MAC configuration register (MACCR) with
  * the link configuration provided in @p p_config, specifically the link speed
  * and duplex mode. It assumes that the Ethernet handle has already been
  * properly initialized and is in the @ref HAL_ETH_STATE_CONFIGURED state.
  *
  * The function:
  * - Validates input parameters (when @c USE_HAL_CHECK_PARAM is enabled).
  * - Composes the link configuration value from @ref hal_eth_link_config_t.
  * - Updates the MACCR link-related bits.
  *
  * @param[in] heth
  *        Pointer to an @ref hal_eth_handle_t structure that contains the
  *        configuration information for the Ethernet peripheral.
  * @param[in] p_config
  *        Pointer to a @ref hal_eth_link_config_t structure that contains
  *        the new link configuration parameters (e.g. @c speed and
  *        @c duplex_mode).
  *
  * @pre
  * - @p heth must not be @c NULL.
  * - @p p_config must not be @c NULL.
  * - @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note This function only updates link configuration bits in the MACCR
  *       register (speed and duplex). It does not initiate any PHY
  *       negotiation or check link status.
  *
  * @retval HAL_OK
  *         Link configuration was successfully updated.
  * @retval HAL_INVALID_PARAM
  *         One or more input parameters are invalid (only when parameter
  *         checking is enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa hal_eth_handle_t
  * @sa hal_eth_link_config_t
  */
hal_status_t HAL_ETH_UpdateConfigLink(hal_eth_handle_t *heth, const hal_eth_link_config_t *p_config)
{
  uint32_t link_reg_val = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_ETH_MAC_SPEED(p_config->speed));
  ASSERT_DBG_PARAM(IS_ETH_MAC_DUPLEX_MODE(p_config->duplex_mode));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

