MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  link_reg_val = ((uint32_t)p_config->speed |
                  (uint32_t)p_config->duplex_mode);
  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->MACCR, ETH_MAC_LINK_CONFIG_MASK, link_reg_val);

  return HAL_OK;
}

/**
  * @brief  Enable ARP offload.
  *
  * This function enables the ARP offload feature in the Ethernet MAC by
  * setting the ARP enable bit in the MAC configuration register. When ARP
  * offload is enabled, the MAC hardware can autonomously process ARP frames
  * according to the device-specific implementation, potentially reducing CPU
  * involvement in ARP handling.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure that
  *                     contains the configuration information for the
  *                     specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note The exact behavior of ARP offload (such as which ARP requests are
  *       answered and how IP/MAC mapping is managed) is hardware-dependent
  *       and must be checked in the device reference manual.
  */
void HAL_ETH_EnableARPOffload(hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  STM32_SET_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_ARPEN);
}

/**
  * @brief  Disable ARP offload.
  *
  * This function disables the ARP offload feature in the Ethernet MAC by
  * clearing the ARP enable bit in the MAC configuration register. When ARP
  * offload is disabled, ARP processing is fully handled by the software
  * network stack rather than by the MAC hardware.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure that
  *                     contains the configuration information for the
  *                     specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  */
void HAL_ETH_DisableARPOffload(hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_ARPEN);
}

/**
  * @brief  Check if the ETH ARP offload is enabled.
  *
  * This function checks the ARP offload enable bit in the MAC configuration
  * register and returns the current ARP offload status.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure that
  *                 contains the configuration information for the
  *                 specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @retval hal_eth_arp_offload_status_t Current ARP offload status
  *         (see @ref hal_eth_arp_offload_status_t).
  */
hal_eth_arp_offload_status_t HAL_ETH_IsEnabledARPOffload(const hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  return (hal_eth_arp_offload_status_t)((uint32_t)STM32_READ_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_ARPEN));
}

/**
  * @brief  Set the ARP target IP address.
  *
  * This function programs the ARP target protocol address (TPA) used by
  * the Ethernet MAC ARP offload logic. The @p tpa value is typically an
  * IPv4 address encoded as a 32-bit value in network byte order.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure that
  *                     contains the configuration information for the
  *                     specified Ethernet peripheral.
  * @param[in]     tpa  Target protocol (IP) address encoded as a 32-bit value.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  *
  * @note The exact encoding and usage of the target protocol address are
  *       hardware-dependent and must be checked in the device reference manual.
  */
void HAL_ETH_SetARPTargetIP(hal_eth_handle_t *heth, uint32_t tpa)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  STM32_WRITE_REG(ETH_GET_INSTANCE(heth)->MACARPAR, tpa);
}

/**
  * @brief  Enter Ethernet MAC Power-Down mode with PMT configuration.
  *
  * This function configures the Power Management and Timer (PMT) features of
  * the Ethernet MAC and initiates the MAC Power-Down sequence. It can enable
  * Remote Wakeup (RWK) and Magic Packet detection based on @p pmt_ctrl.
  *
  * The function:
  * - Checks that the handle is valid and in @ref HAL_ETH_STATE_CONFIGURED.
  * - Checks and Updates the global state from @ref HAL_ETH_STATE_CONFIGURED to
  *   @ref HAL_ETH_STATE_POWER_DOWN.
  * - Programs the PMT control/status register @c MACPCSR with @p pmt_ctrl
  *   (masked by @ref ETH_PMT_CTRL_MASK).
  * - If any PMT trigger is enabled in @p pmt_ctrl:
  *   - Enables the MAC receiver.
  *   - Enables the PMT interrupt.
  * - Sets the Power-Down bit in @c MACPCSR to start the Power-Down sequence.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and state for the Ethernet peripheral.
  *         Its @c global_state is updated to @ref HAL_ETH_STATE_POWER_DOWN
  *         on success.
  * @param[in]     pmt_ctrl
  *         PMT control bitmask to be written into @c MACPCSR (masked with
  *         @ref ETH_PMT_CTRL_MASK). This typically includes:
  *         - Remote wakeup filters (RWK)
  *         - Magic Packet enable
  *         - Other PMT-related control bits as defined by ETH_PMT_CTRL_MASK.
  *
  * @pre
  * - @p heth must be in @ref HAL_ETH_STATE_CONFIGURED
  *   (checked with debug and optional runtime checks).
  *
  * @note When @p pmt_ctrl is 0, the MAC still enters Power-Down but no
  *       PMT wake-up source is enabled.
  * @note The system clock and other peripheral clocks would need to remain
  *       enabled as required by the PMT and wake-up scheme.
  *
  * @retval HAL_OK
  *         Power-Down sequence initiated successfully.
  * @retval HAL_INVALID_PARAM
  *         @p heth is @c NULL (only when parameter checking is enabled via
  *         @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_ExitPowerDownMode
  * @sa HAL_ETH_PMT_CTRL_FWD_WAKEUP_PKT
  * @sa HAL_ETH_PMT_CTRL_TRIG_MAGIC_PKT
  * @sa HAL_ETH_PMT_CTRL_TRIG_RWKUP_PKT
  * @sa HAL_ETH_PMT_CTRL_TRIG_GLBL_UCAST
  * @sa HAL_ETH_PMT_CTRL_TRIG_ALL
  */
hal_status_t HAL_ETH_EnterPowerDownMode(hal_eth_handle_t *heth, uint32_t pmt_ctrl)
{
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_PMT_CTRL_FLAGS(pmt_ctrl));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  HAL_CHECK_UPDATE_STATE(heth, global_state, HAL_ETH_STATE_CONFIGURED, HAL_ETH_STATE_POWER_DOWN);

