MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  p_ethx = ETH_GET_INSTANCE(heth);
  STM32_MODIFY_REG(p_ethx->MACPCSR, ETH_PMT_CTRL_MASK, pmt_ctrl);
  if ((pmt_ctrl & ETH_PMT_CTRL_MASK) != 0UL)
  {
    STM32_SET_BIT(p_ethx->MACCR, ETH_MACCR_RE);
    STM32_SET_BIT(p_ethx->MACIER, ETH_MACIER_PMTIE);
  }
  STM32_SET_BIT(p_ethx->MACPCSR, ETH_MACPCSR_PWRDWN);
  return HAL_OK;
}

/**
  * @brief  Exit Ethernet MAC Power-Down mode.
  *
  * This function restores the Ethernet MAC from Power-Down mode back to the
  * configured state. It clears PMT configuration and PMT interrupt, performs
  * dummy writes to key MAC registers as required by the hardware, and clears
  * the Power-Down bit.
  *
  * The function:
  * - Checks that the handle is valid and in @ref HAL_ETH_STATE_POWER_DOWN.
  * - Checks and Updates the global state from @ref HAL_ETH_STATE_POWER_DOWN to
  *   @ref HAL_ETH_STATE_CONFIGURED.
  * - Disables the PMT interrupt.
  * - Clears PMT control bits in @c MACPCSR (masked by @ref ETH_PMT_CTRL_MASK).
  * - Performs write operations to:
  *   - @c ETH_MACCR
  *   - @c ETH_MACA0HR
  *   - @c ETH_MACA0LR
  *   to satisfy hardware requirements when exiting Power-Down.
  * - Clears the Power-Down bit to exit Power-Down.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and state for the Ethernet peripheral.
  *         Its @c global_state is updated back to
  *         @ref HAL_ETH_STATE_CONFIGURED on success.
  *
  * @pre
  * - @p heth must be in @ref HAL_ETH_STATE_POWER_DOWN
  *   (checked with debug and optional runtime checks).
  *
  * @note After calling this function, the MAC configuration (MACCR and
  *       MACA0 registers) would need to be revalidated or updated depending
  *       on the hardware behavior and application requirements.
  *
  * @retval HAL_OK
  *         Power-Down mode exited successfully.
  * @retval HAL_INVALID_PARAM
  *         @p heth is @c NULL (only when parameter checking is enabled via
  *         @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_EnterPowerDownMode
  */
hal_status_t HAL_ETH_ExitPowerDownMode(hal_eth_handle_t *heth)
{
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_POWER_DOWN);

  p_ethx = ETH_GET_INSTANCE(heth);
  STM32_CLEAR_BIT(p_ethx->MACIER, ETH_MACIER_PMTIE);
  STM32_CLEAR_BIT(p_ethx->MACPCSR, ETH_PMT_CTRL_MASK);

  /* Perform write operation to MACCR/MACA0H/MACA0L, otherwise the MAC receiver can
     remain enabled even though the Receive Enable bit is set to 0.*/
  STM32_MODIFY_REG(p_ethx->MACCR, 0UL, 0UL);
  STM32_MODIFY_REG(p_ethx->MACA0HR, 0UL, 0UL);
  STM32_MODIFY_REG(p_ethx->MACA0LR, 0UL, 0UL);

  STM32_CLEAR_BIT(p_ethx->MACPCSR, ETH_MACPCSR_PWRDWN);

  heth->global_state = HAL_ETH_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief  Configure the Remote Wake-Up Packet Filter LUT for Ethernet.
  *
  * This function programs the Remote Wake-Up (RWK) packet filter lookup table
  * (LUT) for the Ethernet peripheral. Each filter entry in the LUT can be
  * configured to match specific packet patterns and control the filter logic
  * using the following command constants:
  *   - @ref HAL_ETH_RWK_FLT_CMD_ENABLE.
  *   - @ref HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS.
  *   - @ref HAL_ETH_RWK_FLT_CMD_INVERSE_MODE.
  *   - @ref HAL_ETH_RWK_FLT_CMD_MULTICAST.
  *
  * These constants are used in the filter command field to define the behavior
  * of each filter, such as enabling the filter, chaining filters for complex
  * logic, inverting match logic, and specifying the address type
  * (unicast/multicast).
  * The maximum number of filter blocks supported by the hardware is defined by
  * @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  *
  * The function performs the following operations:
  * - Validates the filter LUT pointer when parameter checking is enabled.
  * - Resets the internal RWK filter write pointer.
  * - Writes the byte-mask words for each filter entry.
  * - Accumulates and writes command, offset, and CRC16 fields into the
  *   dedicated RWK programming registers.
  *
  * @param[in] heth         Pointer to a @ref hal_eth_handle_t structure that
  *                         contains the configuration information for the
  *                         specified Ethernet peripheral.
  * @param[in] p_filter_lut Pointer to a @ref hal_eth_rwk_filter_lut_t structure
  *                         that contains the filter entries and their command
  *                         configurations. The number of filter blocks in this
  *                         structure is equal to @ref HAL_ETH_RWK_FILT_BLOCK_NUM.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_filter_lut must not be @c NULL.
  *
  * @retval HAL_OK          Filter LUT configured successfully.
  * @retval HAL_INVALID_PARAM
  *         - @p p_filter_lut is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *
  * @see hal_eth_rwk_filter_lut_t.
  * @see hal_eth_rwk_pkt_filter_t.
  * @see HAL_ETH_RWK_FLT_CMD_ENABLE.
  * @see HAL_ETH_RWK_FLT_CMD_AND_PREVIOUS.
  * @see HAL_ETH_RWK_FLT_CMD_INVERSE_MODE.
  * @see HAL_ETH_RWK_FLT_CMD_MULTICAST.
  * @see HAL_ETH_RWK_FILT_BLOCK_NUM.
  */
hal_status_t HAL_ETH_SetRemoteWakeUpPcktFilter(const hal_eth_handle_t *heth,
                                               const hal_eth_rwk_filter_lut_t *p_filter_lut)
{
  const hal_eth_rwk_filter_block_t *p_filter_block = NULL;
  uint32_t commands_reg  = 0UL;
  uint32_t offsets_reg   = 0UL;
  uint32_t crc16_1_reg   = 0UL;
  uint32_t crc16_2_reg   = 0UL;
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_filter_lut != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_filter_lut == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_filter_block = &(p_filter_lut->block0);
  p_ethx = ETH_GET_INSTANCE(heth);

  STM32_SET_BIT(p_ethx->MACPCSR, ETH_MACPCSR_RWKFILTRST);

  /* Write byte mask words then accumulate command/offset/CRC fields. */
  for (uint32_t index = 0UL; index < ETH_NB_OF_RWK_FILT_PER_BLOCK; index++)
  {
    ASSERT_DBG_PARAM(IS_ETH_RWK_BYTE_MASK(p_filter_block->filter[index].byte_mask));
    STM32_WRITE_REG(p_ethx->MACRWKPFR, p_filter_block->filter[index].byte_mask);

    commands_reg  |= ((((uint32_t)p_filter_block->filter[index].commands) & ETH_RWK_CMD_MASK)
                      << ETH_RWK_CMD_SHIFT(index));
    offsets_reg |= ((((uint32_t)p_filter_block->filter[index].offsets) & ETH_RWK_OFFSET_MASK)
                    << ETH_RWK_OFFSET_SHIFT(index));

