MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
    if (index < 2UL)
    {
      crc16_1_reg |= ((((uint32_t)p_filter_block->filter[index].crc16) & ETH_RWK_CRC16_MASK)
                      << ETH_RWK_CRC16_SHIFT_LOW(index));
    }
    else
    {
      crc16_2_reg |= ((((uint32_t)p_filter_block->filter[index].crc16) & ETH_RWK_CRC16_MASK)
                      << ETH_RWK_CRC16_SHIFT_HIGH(index));
    }
  }

  STM32_WRITE_REG(p_ethx->MACRWKPFR, commands_reg);
  STM32_WRITE_REG(p_ethx->MACRWKPFR, offsets_reg);
  STM32_WRITE_REG(p_ethx->MACRWKPFR, crc16_1_reg);
  STM32_WRITE_REG(p_ethx->MACRWKPFR, crc16_2_reg);

  return HAL_OK;
}

/**
  * @brief  Configure Ethernet LPI (Low Power Idle) control flags and enter LPI mode.
  *
  * This function sets the LPI control flags for the Ethernet peripheral and
  * enables Low Power Idle (LPI) mode. The @p lpi_ctrl parameter is a bitwise
  * OR combination of the supported LPI control flags, which define the LPI
  * behavior.
  *
  * Supported LPI control flags are:
  * - @ref HAL_ETH_LPI_CTRL_TX_CLK_STOP_ENABLE.
  * - @ref HAL_ETH_LPI_CTRL_TX_AUTOMATE_ENABLE.
  *
  * The function performs the following operations:
  * - Configures the LPI control register with the specified control flags.
  * - Enables the LPI interrupt.
  * - Enables LPI mode in the MAC.
  *
  * @param[in,out] heth     Pointer to a @ref hal_eth_handle_t structure that
  *                         contains the configuration information for the
  *                         specified Ethernet peripheral.
  * @param[in]     lpi_ctrl Bitwise OR combination of LPI control flags that
  *                         specifies the desired LPI behavior. This must be
  *                         a valid combination as checked by
  *                         @ref IS_ETH_LPI_CTRL_FLAGS.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @pre @p lpi_ctrl must satisfy @ref IS_ETH_LPI_CTRL_FLAGS.
  *
  * @see HAL_ETH_LPI_CTRL_TX_CLK_STOP_ENABLE.
  * @see HAL_ETH_LPI_CTRL_TX_AUTOMATE_ENABLE.
  */
void HAL_ETH_EnterLPIMode(hal_eth_handle_t *heth, uint32_t lpi_ctrl)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_LPI_CTRL_FLAGS(lpi_ctrl));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->MACLCSR, ETH_LPI_TX_CLK_MASK, lpi_ctrl);
  STM32_SET_BIT(ETH_GET_INSTANCE(heth)->MACIER, ETH_MACIER_LPIIE);
  STM32_SET_BIT(ETH_GET_INSTANCE(heth)->MACLCSR, ETH_MACLCSR_LPIEN);
}

/**
  * @brief  Exit Ethernet LPI (Low Power Idle) mode.
  *
  * This function exits Low Power Idle (LPI) mode for the Ethernet MAC and
  * restores normal operation by clearing the LPI-related configuration and
  * disabling LPI interrupts.
  *
  * The function performs the following operations:
  * - Clears the LPI control bits that manage TX clock behavior in LPI mode.
  * - Disables the LPI interrupt.
  * - Disables LPI mode in the MAC.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure that
  *                     contains the configuration information for the
  *                     specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  */
void HAL_ETH_ExitLPIMode(hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);
  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACLCSR, ETH_LPI_TX_CLK_MASK);
  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACIER, ETH_MACIER_LPIIE);
  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACLCSR, ETH_MACLCSR_LPIEN);
}

/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group6
  * @{
This subsection provides functions allowing the registration of the Ethernet Channel Callbacks.
  - HAL_ETH_RegisterChannelRxAllocateCallback(): Register Rx allocate callback for a channel.
  - HAL_ETH_RegisterChannelRxCptCallback(): Register Rx complete callback for a channel.
  - HAL_ETH_RegisterChannelTxCptCallback(): Register Tx complete callback for a channel.
  - HAL_ETH_RegisterDataCallback(): Register data callback.
  - HAL_ETH_RegisterWKUPCallback(): Register wakeup callback.
  - HAL_ETH_RegisterPMTCallback(): Register PMT callback.
  - HAL_ETH_RegisterEEECallback(): Register EEE callback.
  - HAL_ETH_RegisterErrorCallback(): Register error callback.
  - HAL_ETH_RegisterEventCallback(): Register event callback.
  - HAL_ETH_RegisterCacheInvalidateCallback(): Register cache invalidate callback.
  - HAL_ETH_RegisterCacheFlushCallback(): Register cache flush callback.
  - HAL_ETH_RegisterChannelRxEventCallback(): Register Rx channel events callback.
  - HAL_ETH_RegisterChannelTxEventCallback(): Register Tx channel events callback.
  */
/**
  * @brief  Register an Rx allocate callback for a channel.
  *
  * This function registers a user-provided Rx allocate callback function for
  * the specified Ethernet Rx channel. The callback is typically invoked by
  * the HAL when a new buffer needs to be allocated for received data on the
  * corresponding channel.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     channel    Channel index for which the callback is to be
  *                           registered, as defined by @ref IS_ETH_CHANNEL_RX_INDEX.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_rx_allocate_cb_t to be associated
  *                           with the specified Rx channel.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  * @pre @p channel must be a valid Rx channel index (see @ref IS_ETH_CHANNEL_RX_INDEX).
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *         - @p channel is invalid when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterChannelRxAllocateCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                       hal_eth_rx_allocate_cb_t p_callback)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_RX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_callback == NULL) || (IS_ETH_CHANNEL_RX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetRXChIndex(&ch, channel);
  heth->rx_channels[ch].p_rx_allocate_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register an Rx complete callback for a channel.
  *
  * This function registers a user-provided Rx complete callback function for
  * the specified Ethernet Rx channel. The callback is typically invoked by
  * the HAL when a receive operation has completed on the corresponding
  * channel.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     channel    Channel index for which the callback is to be
  *                           registered, as defined by @ref IS_ETH_CHANNEL_RX_INDEX.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_rx_complete_cb_t to be associated
  *                           with the specified Rx channel.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  * @pre @p channel must be a valid Rx channel index (see @ref IS_ETH_CHANNEL_RX_INDEX).
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *         - @p channel is invalid when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterChannelRxCptCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                  hal_eth_rx_complete_cb_t p_callback)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_RX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_callback == NULL) || (IS_ETH_CHANNEL_RX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetRXChIndex(&ch, channel);
  heth->rx_channels[ch].p_rx_complete_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a Tx complete callback for a channel.
  *
  * This function registers a user-provided Tx complete callback function for
  * the specified Ethernet Tx channel. The callback is typically invoked by
  * the HAL when a transmit operation has completed on the corresponding
  * channel.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     channel    Channel index for which the callback is to be
  *                           registered, as defined by @ref IS_ETH_CHANNEL_TX_INDEX.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_tx_complete_cb_t to be associated
  *                           with the specified Tx channel.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  * @pre @p channel must be a valid Tx channel index (see @ref IS_ETH_CHANNEL_TX_INDEX).
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  *         - @p channel is invalid when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterChannelTxCptCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                  hal_eth_tx_complete_cb_t p_callback)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_TX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_callback == NULL) || (IS_ETH_CHANNEL_TX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ETH_GetTXChIndex(&ch, channel);
  heth->tx_channels[ch].p_tx_complete_cb = p_callback;

  return HAL_OK;
}

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a data callback.
  *
  * This function registers a user-provided data callback function for the
  * Ethernet peripheral. The callback is typically invoked by the HAL when
  * data-related events occur (for example, reception of new data or completion
  * of a transmit operation), depending on the driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cb_t to be associated with the
  *                           Ethernet handle.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterDataCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_data_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a wakeup callback.
  *
  * This function registers a user-provided wakeup callback function for the
  * Ethernet peripheral. The callback is typically invoked by the Ethernet wakeup
  * event through EXTI line.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_wakeup_cb_t to be associated with
  *                           the Ethernet handle.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterWKUPCallback(hal_eth_handle_t *heth, hal_eth_wakeup_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

