MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  heth->p_wake_up_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a PMT (Power Management Trigger) callback.
  *
  * This function registers a user-provided PMT callback function for the
  * Ethernet peripheral. The callback is typically invoked by the HAL when
  * a power management related event occurs (for example, Magic Packet or
  * wake-up frame), depending on the driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cb_t to be associated with the
  *                           Ethernet handle for PMT events.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterPMTCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_pmt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register an EEE (Energy Efficient Ethernet) callback.
  *
  * This function registers a user-provided EEE callback function for the
  * Ethernet peripheral. The callback is typically invoked by the HAL when
  * an EEE-related event occurs (for example, entry or exit from low power
  * idle states), depending on the driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cb_t to be associated with the
  *                           Ethernet handle for EEE events.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterEEECallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_eee_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register an error callback.
  *
  * This function registers a user-provided error callback function for the
  * Ethernet peripheral. The callback is typically invoked by the HAL when
  * an error condition is detected on the Ethernet MAC, DMA, or related
  * subsystems, depending on the driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cb_t to be associated with the
  *                           Ethernet handle for error events.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterErrorCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_error_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register an event callback.
  *
  * This function registers a user-provided generic event callback function
  * for the Ethernet peripheral. The callback is typically invoked by the HAL
  * when non-error, non-PMT, non-EEE events occur, depending on the driver
  * implementation (for example, link status changes or other notifications).
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cb_t to be associated with the
  *                           Ethernet handle for generic events.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterEventCallback(hal_eth_handle_t *heth, hal_eth_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_event_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a cache invalidate callback.
  *
  * This function registers a user-provided cache invalidate callback function
  * for the Ethernet peripheral. The callback is typically invoked by the HAL
  * to invalidate data cache lines associated with internal driver memory areas
  * allocated by the application (for DMA descriptor rings), depending
  * on the system cache architecture and driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cache_cb_t to be associated with
  *                           the Ethernet handle for cache invalidation.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterCacheInvalidateCallback(hal_eth_handle_t *heth, hal_eth_cache_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_cache_invalidate_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a cache flush callback.
  *
  * This function registers a user-provided cache flush callback function
  * for the Ethernet peripheral. The callback is typically invoked by the HAL
  * to flush data cache lines associated with internal driver memory areas
  * allocated by the application (for DMA descriptor rings), depending
  * on the system cache architecture and driver implementation.
  *
  * @param[in,out] heth       Pointer to a @ref hal_eth_handle_t structure that
  *                           contains the configuration information for the
  *                           specified Ethernet peripheral.
  * @param[in]     p_callback Pointer to a callback function of type
  *                           @ref hal_eth_cache_cb_t to be associated with
  *                           the Ethernet handle for cache flushing.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_callback must not be @c NULL.
  *
  * @retval HAL_OK           Callback has been successfully registered.
  * @retval HAL_INVALID_PARAM
  *         - @p p_callback is @c NULL when `USE_HAL_CHECK_PARAM` is enabled.
  */
hal_status_t HAL_ETH_RegisterCacheFlushCallback(hal_eth_handle_t *heth, hal_eth_cache_cb_t p_callback)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  heth->p_cache_flush_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a callback for Ethernet RX channel events.
  *
  * This function associates a user-provided callback @p p_callback with the
  * RX channel identified by @p channel in the Ethernet handle @p heth. The
  * callback will be invoked by the HAL when an RX channel event occurs
  * (e.g. packet reception, error, etc. depending on implementation).
  *
  * The function:
  * - Validates @p heth, @p p_callback, and @p channel (with debug and optional
  *   runtime checks).
  * - Converts the RX channel bitmask @p channel into a channel index.
  * - Stores the callback pointer into
  *   @c heth->rx_channels[index].p_ch_event_cb.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         RX channel identifier (bitmask) that must satisfy
  *         @ref IS_ETH_CHANNEL_RX_INDEX. If multiple bits are set, the first
  *         valid RX channel index is used.
  * @param[in]     p_callback
  *         Pointer to a function of type @ref hal_eth_channel_cb_t that will
  *         be called on RX channel events.
  * @note This function only registers the callback; the user must ensure that
  *       RX channel events are properly enabled and handled in the interrupt
  *       or polling layer that triggers the callback.
  *
  * @retval HAL_OK
  *         Callback successfully registered for the selected RX channel.
  * @retval HAL_ERROR
  *         RX channel index could not be derived from @p channel.
  * @retval HAL_INVALID_PARAM
  *         - @p heth or @p p_callback is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_RX_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_RegisterChannelTxEventCallback
  */
hal_status_t HAL_ETH_RegisterChannelRxEventCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                    hal_eth_channel_cb_t p_callback)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_RX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_callback == NULL) || (IS_ETH_CHANNEL_RX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ETH_GetRXChIndex(&ch, channel);
  heth->rx_channels[ch].p_ch_event_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a callback for Ethernet TX channel events.
  *
  * This function associates a user-provided callback @p p_callback with the
  * TX channel identified by @p channel in the Ethernet handle @p heth. The
  * callback will be invoked by the HAL when a TX channel event occurs
  * (e.g. transmit complete, error, etc., depending on implementation).
  *
  * The function:
  * - Validates @p heth, @p p_callback, and @p channel (with debug and optional
  *   runtime checks).
  * - Converts the TX channel bitmask @p channel into a channel index.
  * - Stores the callback pointer into
  *   @c heth->tx_channels[index].p_ch_event_cb.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         TX channel identifier (bitmask) that must satisfy
  *         @ref IS_ETH_CHANNEL_TX_INDEX. If multiple bits are set, the first
  *         valid TX channel index is used.
  * @param[in]     p_callback
  *         Pointer to a function of type @ref hal_eth_channel_cb_t that will
  *         be called on TX channel events.
  * @note This function only registers the callback; the user must ensure that
  *       TX channel events are properly enabled and handled in the interrupt
  *       or polling layer that triggers the callback.
  *
  * @retval HAL_OK
  *         Callback successfully registered for the selected TX channel.
  * @retval HAL_ERROR
  *         TX channel index could not be derived from @p channel.
  * @retval HAL_INVALID_PARAM
  *         - @p heth or @p p_callback is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_TX_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_RegisterChannelRxEventCallback
  */
hal_status_t HAL_ETH_RegisterChannelTxEventCallback(hal_eth_handle_t *heth, uint32_t channel,
                                                    hal_eth_channel_cb_t p_callback)
{
  uint32_t ch = 0;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_TX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_callback == NULL) || (IS_ETH_CHANNEL_TX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  ETH_GetTXChIndex(&ch, channel);
  heth->tx_channels[ch].p_ch_event_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS && USE_HAL_ETH_REGISTER_CALLBACKS = 1 */
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group7
  * @{
This subsection provides Interrupts management functions.
  - HAL_ETH_WKUP_IRQHandler(): Ethernet wakeup IRQ handler.
  - HAL_ETH_IRQHandler(): Register Rx allocate callback for a channel.
  */
/**
  * @brief  Ethernet global interrupt handler.
  *
  * This function handles all Ethernet-related interrupt sources, including
  * MAC, DMA, MTL, PMT, EEE, data, event, wakeup, and error conditions.
  * It reads and decodes the interrupt status of each DMA channel and MTL
  * queue, updates internal state, clears the corresponding interrupt flags,
  * and invokes the registered user callbacks or the weak default callbacks.
  *
  * The handler performs the following main actions.
  * - Iterates over all configured DMA channels and:
  *   - Detects Tx and Rx data completion events and accumulates a channel
  *     data-event bitmap.
  *   - Detects DMA/MTL channel error and status events and calls the
  *     corresponding per-channel event callbacks.
  *   - Clears the DMA channel interrupt status flags.
  * - If any Tx/Rx data event is detected, invokes the global data callback
  *   (registered via @ref HAL_ETH_RegisterDataCallback or default
  *   @ref HAL_ETH_DataCallback).
  * - Processes MAC-level event flags (for example, link or status events)
  *   and invokes the event callback (registered via
  *   @ref HAL_ETH_RegisterEventCallback or default
  *   @ref HAL_ETH_EventCallback).
  * - Checks for PMT events and calls the PMT callback
  *   (@ref HAL_ETH_RegisterPMTCallback or @ref HAL_ETH_PMTCallback).
  * - Checks for EEE (Energy Efficient Ethernet) events and calls the EEE
  *   callback (@ref HAL_ETH_RegisterEEECallback or @ref HAL_ETH_EEECallback).
  * - Optionally handles external wakeup (EXTI-based) events when enabled,
  *   and calls the wakeup callback (@ref HAL_ETH_RegisterWKUPCallback or
  *   @ref HAL_ETH_WakeUpCallback).
  * - If a DMA error is detected, updates the global Ethernet state to
  *   @ref HAL_ETH_STATE_FAULT, optionally stores the last error codes, and
  *   invokes the error callback (@ref HAL_ETH_RegisterErrorCallback or
  *   @ref HAL_ETH_ErrorCallback).
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure that
  *                     contains the configuration information for the
  *                     specified Ethernet peripheral and associated channels.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p heth must have been properly initialized and configured before
  *      this handler is called (typically from the Ethernet IRQ vector).
  *
  * @note This function is intended to be called from the Ethernet interrupt
  *       service routine. It must not be called directly from non-interrupt
  *       context unless the same preconditions and mutual exclusion
  *       requirements are guaranteed by the caller.
  */
void HAL_ETH_IRQHandler(hal_eth_handle_t *heth)
{
  ETH_TypeDef *p_ethx = ETH_GET_INSTANCE(heth);
  uint32_t ch_data_event = 0UL;
  uint32_t dma_error_code = 0UL;
  uint32_t mac_pmt_csr = 0UL;
  uint32_t mac_eee_csr = 0UL;
  uint32_t max_ch_nb = ETH_GET_MAX_VALUE(USE_HAL_ETH_MAX_TX_CH_NB, USE_HAL_ETH_MAX_RX_CH_NB);

  /* Snapshot MAC global interrupt status (PMT/LPI and other MAC-level sources). */
  uint32_t mac_status_flag = STM32_READ_REG(p_ethx->MACISR);
  uint32_t mac_event_code = STM32_READ_REG(p_ethx->MACRXTXSR) & ETH_MAC_EVENT_MASK;

  for (uint32_t dma_ch_id = 0; dma_ch_id < max_ch_nb; dma_ch_id++)
  {
    /* Get DMA Channel interrupt status and source registers. */
    ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_GET_DMA_CHANNEL(heth, dma_ch_id);
    const ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_GET_MTL_QUEUE(heth, dma_ch_id);
    uint32_t dma_ch_flag = STM32_READ_REG(p_dma_instance->DMACXSR);
    uint32_t dma_ch_itsource = STM32_READ_REG(p_dma_instance->DMACXIER);
    uint32_t mtl_ch_event = STM32_READ_REG(p_mtl_instance->MTLQXICSR);
    uint32_t rx_ch_event = 0UL;
    uint32_t tx_ch_event = 0UL;

    /* Accumulate Tx data-ready channels only when the corresponding IRQ source is enabled. */
    if ((dma_ch_id < USE_HAL_ETH_MAX_TX_CH_NB)
        && (STM32_IS_BIT_SET(dma_ch_flag, ETH_DMACSR_TI))
        && (STM32_IS_BIT_SET(dma_ch_itsource, ETH_DMACIER_TIE)))
    {
      ch_data_event |= ETH_GET_TX_CH_ID(dma_ch_id);
    }

    /* Accumulate Rx data-ready channels only when the corresponding IRQ source is enabled. */
    if ((dma_ch_id < USE_HAL_ETH_MAX_RX_CH_NB)
        && (STM32_IS_BIT_SET(dma_ch_flag, ETH_DMACSR_RI))
        && (STM32_IS_BIT_SET(dma_ch_itsource, ETH_DMACIER_RIE)))
    {
      ch_data_event |= ETH_GET_RX_CH_ID(dma_ch_id);
    }

    /* Process channel events only when normal/abnormal summary interrupts are asserted. */
    if ((((dma_ch_flag & ETH_DMACSR_AIS) != 0UL) && ((dma_ch_itsource & ETH_DMACIER_AIE) != 0UL))
        || (((dma_ch_flag & ETH_DMACSR_NIS) != 0UL) && ((dma_ch_itsource & ETH_DMACIER_NIE) != 0UL)))
    {
      /* Read channel DMA error bits and block summary IRQs to avoid repeated storms. */
      if ((dma_ch_flag & ETH_ERROR_DMA_MASK) != 0UL)
      {
        ETH_COPY_BITS(dma_error_code, ETH_ERROR_DMA_MASK, dma_ch_flag);
        ETH_DMA_CHX_DISABLE_IT(p_dma_instance,  ETH_DMACIER_NIE | ETH_DMACIER_AIE);
      }

      /* Build Rx channel event bitmap from DMA and MTL status then notify callback. */
      if ((dma_ch_id < USE_HAL_ETH_MAX_RX_CH_NB)
          && (((dma_ch_flag & ETH_RX_DMA_CH_EVENT_MASK) != 0UL) || ((mtl_ch_event & ETH_RX_MTL_CH_EVENT_MASK) != 0UL)))
      {
        ETH_COPY_BITS(rx_ch_event, ETH_RX_DMA_CH_EVENT_MASK, dma_ch_flag);
        ETH_COPY_BITS(rx_ch_event, ETH_RX_MTL_CH_EVENT_MASK, mtl_ch_event);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
        heth->rx_channels[dma_ch_id].p_ch_event_cb(heth, ETH_GET_RX_CH_ID(dma_ch_id), rx_ch_event);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
        HAL_ETH_RxEventCallback(heth, ETH_GET_RX_CH_ID(dma_ch_id), rx_ch_event);
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */
      }

      /* Build Tx channel event bitmap from DMA and MTL status then notify callback. */
      if ((dma_ch_id < USE_HAL_ETH_MAX_TX_CH_NB)
          && (((dma_ch_flag & ETH_TX_DMA_CH_EVENT_MASK) != 0UL) || ((mtl_ch_event & ETH_TX_MTL_CH_EVENT_MASK) != 0UL)))
      {
        ETH_COPY_BITS(tx_ch_event, ETH_TX_DMA_CH_EVENT_MASK, dma_ch_flag);
        ETH_COPY_BITS(tx_ch_event, ETH_TX_MTL_CH_EVENT_MASK, mtl_ch_event);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
        heth->tx_channels[dma_ch_id].p_ch_event_cb(heth, ETH_GET_TX_CH_ID(dma_ch_id), tx_ch_event);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
        HAL_ETH_TxEventCallback(heth, ETH_GET_TX_CH_ID(dma_ch_id), tx_ch_event);
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */
      }
    }

    /* Clear the ETH DMA interrupt pending bits. */
    ETH_DMA_CHX_CLEAR_IT(p_dma_instance, dma_ch_flag);
  }

  /* Call global data callback if any Tx/Rx data event occurred. */
  if (ch_data_event != 0UL)
  {
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_data_cb(heth, ch_data_event);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_DataCallback(heth, ch_data_event);
#endif  /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }

