MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  if (mac_event_code != 0UL)
  {
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_event_cb(heth, mac_event_code);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_EventCallback(heth, mac_event_code);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }

  /* Handle power management interrupt */
  if ((mac_status_flag & ETH_MACISR_PMTIS) != 0UL)
  {
    mac_pmt_csr = STM32_READ_BIT(p_ethx->MACPCSR, ETH_PMT_EVENT_MASK);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_pmt_cb(heth, mac_pmt_csr);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_PMTCallback(heth, mac_pmt_csr);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }

  /* Handle energy efficient Ethernet interrupt */
  if ((mac_status_flag & ETH_MACISR_LPIIS) != 0UL)
  {
    mac_eee_csr = STM32_READ_BIT(p_ethx->MACLCSR, ETH_LPI_EVENT_MASK);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_eee_cb(heth, mac_eee_csr);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_EEECallback(heth, mac_eee_csr);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }


  /* Handle fatal errors interrupt */
  if (dma_error_code != 0UL)
  {
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
    heth->last_error_codes = dma_error_code;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
    heth->global_state = HAL_ETH_STATE_FAULT;
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_error_cb(heth, dma_error_code);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_ErrorCallback(heth, dma_error_code);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Ethernet wakeup interrupt handler.
  *
  * This function handles Ethernet wakeup events when the wakeup source is
  * connected to an EXTI line. It checks the EXTI pending bits associated
  * with the Ethernet wakeup source, clears them, and invokes the registered
  * wakeup callback or the default @ref HAL_ETH_WakeUpCallback.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure that
  *                 contains the configuration information for the
  *                 specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  *
  * @note This handler is intended to be used when the Ethernet wakeup
  *       interrupt is mapped to a dedicated EXTI line, separate from the
  *       main Ethernet IRQ.
  */
void HAL_ETH_WKUP_IRQHandler(const hal_eth_handle_t *heth)
{
  uint32_t exti_event = ETH_WakeupGetPendingIT();
  if (exti_event != 0UL)
  {
    ETH_WakeupClearPendingIT(exti_event);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_wake_up_cb(heth);
#else /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_WakeUpCallback(heth);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  }
}
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group8
  * @{
This subsection provides Weak callback functions.
  - HAL_ETH_DataCallback(): Ethernet Data callback.
  - HAL_ETH_ErrorCallback(): Ethernet Error callback.
  - HAL_ETH_EventCallback(): Ethernet Event callback.
  - HAL_ETH_PMTCallback(): Ethernet PMT callback.
  - HAL_ETH_EEECallback(): Ethernet EEE callback.
  - HAL_ETH_WakeUpCallback(): Ethernet Wakeup callback.
  - HAL_ETH_CacheInvalidateCallback(): Ethernet Cache Clean callback.
  - HAL_ETH_CacheFlushCallback(): Ethernet Cache Flush callback.
  - HAL_ETH_TxEventCallback(): Ethernet Tx Channel Event callback.
  - HAL_ETH_RxEventCallback(): Ethernet Rx Channel Event callback.
  */
/**
  * @brief  Ethernet Data callback (weak implementation).
  *
  * This weak function is called by the HAL to notify the application that
  * data is available or has been processed on one or more Ethernet channels.
  * The channels are indicated by the bitmask @p channels_mask.
  *
  * Typical usages include:
  * - Notification that RX data is ready to be processed for one or more
  *   channels.
  * - Notification that TX data has been processed/completed on specific
  *   channels.
  *
  * The default implementation is empty and simply marks its parameters as
  * unused. To handle such data-related events, the user application must
  * provide a strong implementation with the same prototype and decode the
  * @p channels_mask bitmask.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] channels_mask
  *         Bitmask indicating the channel(s) for which a data event occurred.
  *         The meaning of each bit depends on the HAL channel definitions
  *         (e.g. RX/TX channel indices).
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *           HAL_ETH_DataCallback can be implemented in the user file.
  * @note It can be used as a central notification for data-related activity
  *       in addition to more specific per-channel callbacks.
  */
__WEAK void HAL_ETH_DataCallback(hal_eth_handle_t *heth, uint32_t channels_mask)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(channels_mask);
}

/**
  * @brief  Ethernet Peripheral error callback (weak implementation).
  *
  * This weak function is called by the HAL when one or more Ethernet-related
  * errors are detected. The specific error conditions are encoded in the
  * @p errors bitmask (e.g. DMA errors, descriptor errors, fatal bus
  * errors, etc., depending on the HAL error definitions).
  *
  * The default implementation is empty and simply marks its parameters as
  * unused. To handle Ethernet errors (e.g. log them, attempt recovery,
  * notify upper layers), the user application must provide a strong
  * implementation with the same prototype and decode the @p errors bitmask.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral where the
  *         error occurred.
  * @param[in] errors
  *         Bitmask describing the error conditions that occurred. The exact
  *         meaning of each bit depends on the Ethernet HAL error code
  *         definitions (e.g. @c HAL_ETH_ERROR_xxx).
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *           HAL_ETH_ErrorCallback can be implemented in the user file.
  * @note It can be used together with @ref HAL_ETH_GetLastErrorCodes (when
  *       enabled) to retrieve and interpret accumulated error codes.
  * @note The following Errors are supported:
  *
  *   | Event                        | Description                                         |
  *   |------------------------------|-----------------------------------------------------|
  *   | HAL_ETH_ERROR_NONE           | No error.                                           |
  *   | HAL_ETH_ERROR_FBE            | Fatal Bus Error.                                    |
  *   | HAL_ETH_ERROR_CDE            | Context Descriptor Error.                           |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_RD  | Bus Fault Error during read transfer by Tx DMA      |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_WR  | Bus Fault Error during write transfer by Tx DMA     |
  *   | HAL_ETH_ERROR_FBE_DMA_TX_AC  | Bus Fault Error during descriptor access by Tx DMA  |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_RD  | Bus Fault Error during read transfer by Rx DMA      |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_WR  | Bus Fault Error during write transfer by Rx DMA     |
  *   | HAL_ETH_ERROR_FBE_DMA_RX_AC  | Bus Fault Error during descriptor access by Rx DMA  |
  */
__WEAK void HAL_ETH_ErrorCallback(hal_eth_handle_t *heth, uint32_t errors)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(errors);
}

/**
  * @brief  Ethernet Peripheral event callback (weak implementation).
  *
  * This weak function is called by the HAL to notify the application about
  * global Ethernet events represented by the bitmask @p events.
  *
  * The default implementation is empty and simply marks its parameters as
  * unused. To react to these global Ethernet events, the user application
  * must provide a strong implementation with the same prototype and decode
  * the @p events bitmask.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] events
  *         Bitmask of Ethernet events that occurred. The exact meaning of
  *         each bit is defined by the Ethernet HAL event definitions.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_EventCallback can be implemented in the user file.
  * @note The following Ethernet Peripheral Events are supported:
  *
  *   | Event                        | Description                 |
  *   |------------------------------|-----------------------------|
  *   | HAL_ETH_EVENT_MAC_RWT    | Receive Watchdog Timeout Event. |
  *   | HAL_ETH_EVENT_MAC_EXCOL  | Excessive Collisions Event.     |
  *   | HAL_ETH_EVENT_MAC_LCOL   | Late Collision Event.           |
  *   | HAL_ETH_EVENT_MAC_EXDEF  | Excessive Deferral Event.       |
  *   | HAL_ETH_EVENT_MAC_LCARR  | Loss of Carrier Event.          |
  *   | HAL_ETH_EVENT_MAC_NCARR  | No Carrier Event.               |
  *   | HAL_ETH_EVENT_MAC_TJT    | Transmit Jabber Timeout Event.  |
  */
__WEAK void HAL_ETH_EventCallback(hal_eth_handle_t *heth, uint32_t events)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(events);
}

/**
  * @brief  Ethernet Power Management and Timer (PMT) wake-up event callback (weak implementation).
  *
  * This weak function is called by the HAL to notify the application that a
  * PMT-related wake-up event has occurred on the Ethernet MAC layer. Typical
  * wake-up sources include:
  * - Magic Packet reception
  * - Remote wake-up frame match
  * - Other PMT triggers, depending on the hardware configuration.
  *
  * The default implementation is empty and simply marks its parameters as
  * unused. To handle PMT wake-up events (e.g. restore configuration, restart
  * traffic, notify upper layers), the user application must provide a
  * strong implementation with the same prototype and react to the
  * @p wake_up_event bitmask.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral that triggered
  *         the wake-up.
  * @param[in] wake_up_event
  *         Bitmask describing the PMT wake-up event(s) that occurred.
  *         The exact meaning of each bit depends on the Ethernet HAL PMT
  *         event definitions.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_PMTCallback can be implemented in the user file.
  * @note It is typically used together with power management APIs such as
  *       @ref HAL_ETH_EnterPowerDownMode and @ref HAL_ETH_ExitPowerDownMode.
  * @note The following Ethernet Peripheral PMT Events are supported:
  *
  *   | Event                           | Description                     |
  *   |---------------------------------|---------------------------------|
  *   | HAL_ETH_EVENT_PMT_MAGIC_PACKET  | Magic Packet Received.          |
  *   | HAL_ETH_EVENT_PMT_RWK_PACKET    | Remote wake-up Packet Received. |
  */
__WEAK void HAL_ETH_PMTCallback(hal_eth_handle_t *heth, uint32_t wake_up_event)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(wake_up_event);
}

/**
  * @brief  Ethernet Energy Efficient Ethernet (EEE) / LPI event callback (weak implementation).
  *
  * This weak function is called by the HAL to notify the application about
  * Energy Efficient Ethernet (EEE) / Low Power Idle (LPI) related events.
  * The specific event is encoded in @p lpi_event as a bitmask (for example,
  * LPI entry, LPI exit, error conditions, etc., depending on the HAL
  * definitions).
  *
  * The default implementation is empty and simply marks its parameters as
  * unused. To handle EEE/LPI events (e.g. update power statistics, adapt
  * traffic scheduling, logging), the user application must provide a strong
  * implementation with the same prototype.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] lpi_event
  *         Bitmask describing the EEE / LPI event that occurred. The exact
  *         meaning of each bit depends on the Ethernet HAL EEE/LPI event
  *         definitions.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_EEECallback can be implemented in the user file.
  * @note It is typically used when EEE support is enabled in the MAC/PHY and
  *       LPI events are monitored by the application together with low power
  *       interface APIs such as @ref HAL_ETH_EnterLPIMode and
  *       @ref HAL_ETH_ExitLPIMode.
  * @note The following Peripheral EEE/LPI Events are supported:
  *
  *   | Event                        | Description                          |
  *   |------------------------------|--------------------------------------|
  *   | HAL_ETH_EVENT_LPI_PLS_DOWN   | PHY Link Status is Down.             |
  *   | HAL_ETH_EVENT_LPI_PLS_UP     | PHY Link Status is Up.               |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_ST  | Transmit LPI State Active.           |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_ST  | Receive LPI State Active.            |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_EN  | Transmit LPI State Entry performed.  |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_EN  | Receive LPI State Entry performed.   |
  *   | HAL_ETH_EVENT_LPI_TX_LPI_EX  | Transmit LPI State Entry performed.  |
  *   | HAL_ETH_EVENT_LPI_RX_LPI_EX  | Receive LPI State Entry performed.   |
  */
__WEAK void HAL_ETH_EEECallback(hal_eth_handle_t *heth, uint32_t lpi_event)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(lpi_event);
}

/**
  * @brief  Ethernet wake-up event callback (weak implementation).
  *
  * This weak function is called by the HAL when the Ethernet MAC/PHY causes
  * a wake-up event, typically after exiting a power-down or low-power mode
  * due to a PMT trigger (e.g. Magic Packet, Remote Wakeup frame).
  *
  * The default implementation is empty and simply marks @p heth as unused.
  * To react to Ethernet wake-up events (e.g. reconfigure the interface,
  * restart transmissions, notify upper layers), the user application must
  * provide a strong implementation with the same prototype.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral that triggered
  *         the wake-up.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_WakeUpCallback can be implemented in the user file.
  * @note It is typically used in conjunction with power management APIs such
  *       as @ref HAL_ETH_EnterPowerDownMode and @ref HAL_ETH_ExitPowerDownMode.
  */
__WEAK void HAL_ETH_WakeUpCallback(const hal_eth_handle_t *heth)
{
  STM32_UNUSED(heth);
}

/**
  * @brief  Cache invalidate callback for Ethernet buffer regions (weak implementation).
  *
  * This weak function is intended to be overridden by the user application
  * when cache maintenance is required for the memory used by theEthernet peripheral.
  * It is typically called by the HAL before accessing data in memory regions that
  * can be cached, so that the CPU view of memory remains coherent with what
  * DMA has written or will read.
  *
  * The default implementation is empty and simply marks all parameters as
  * unused. If cache maintenance is needed on the target system, the user
  * must provide a strong implementation with the same prototype to perform
  * the appropriate cache invalidate operation on the buffer range
  * [@p p_addr, @p p_addr + @p size).
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] channel
  *         Ethernet channel identifier associated with the buffer. This can be
  *         used by the user implementation to distinguish per-channel
  *         handling if needed.
  * @param[in] p_addr
  *         Pointer to the start of the memory region (buffer) to be
  *         invalidated from the CPU data cache.
  * @param[in] size
  *         Size in bytes of the memory region to be invalidated.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_CacheInvalidateCallback can be implemented in the user file.
  * @note On systems without data cache, this callback can remain unimplemented.
  *
  * @sa HAL_ETH_CacheFlushCallback
  */
__WEAK void HAL_ETH_CacheInvalidateCallback(hal_eth_handle_t *heth, uint32_t channel, void *p_addr,
                                            uint32_t size)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(channel);
  STM32_UNUSED(p_addr);
  STM32_UNUSED(size);
}

/**
  * @brief  Cache flush (clean) callback for Ethernet buffer regions (weak implementation).
  *
  * This weak function is intended to be overridden by the user application
  * when cache maintenance is required for Ethernet RX/TX buffers before DMA
  * accesses. It is typically called by the HAL to ensure that any modified
  * data in the CPU data cache is written back to memory so that the Ethernet
  * DMA sees the latest data.
  *
  * The default implementation is empty and simply marks all parameters as
  * unused. If cache maintenance is needed on the target system, the user
  * must provide a strong implementation with the same prototype to perform
  * the appropriate cache clean/flush operation on the buffer range
  * [@p p_addr, @p p_addr + @p size).
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] channel
  *         Ethernet channel identifier associated with the buffer. This can be
  *         used by the user implementation to distinguish per-channel
  *         handling if needed.
  * @param[in] p_addr
  *         Pointer to the start of the memory region (buffer) to be flushed
  *         (cleaned) from the CPU data cache to main memory.
  * @param[in] size
  *         Size in bytes of the memory region to be flushed.
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_CacheFlushCallback can be implemented in the user file.
  * @note On systems without data cache, this callback can remain unimplemented.
  *
  * @sa HAL_ETH_CacheInvalidateCallback
  */
__WEAK void HAL_ETH_CacheFlushCallback(hal_eth_handle_t *heth, uint32_t channel, void *p_addr,
                                       uint32_t size)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(channel);
  STM32_UNUSED(p_addr);
  STM32_UNUSED(size);
}

/**
  * @brief  Ethernet Transmit (TX) event callback (weak implementation).
  *
  * This weak function is invoked by the HAL to notify the application about
  * TX-related events on a given Ethernet channel. Typical events include
  * transmit complete, transmit errors, or other channel-specific conditions,
  * encoded in @p events as a bitmask.
  *
  * The default implementation is empty and simply marks all parameters as
  * unused. To handle TX events, the user application must provide a strong
  * implementation with the same prototype and perform the desired processing
  * based on the @p channel and @p events values.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] channel
  *         TX channel identifier on which the event occurred.
  * @param[in] events
  *         Bitmask of TX events that occurred on the specified channel.
  *         The exact meaning of each bit depends on the Ethernet HAL event
  *         definitions (e.g. TX complete, TX error, etc.).
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_TxEventCallback can be implemented in the user file.
  * @note The HAL can also provide per-channel callbacks (registered via
  *       @ref HAL_ETH_RegisterChannelTxEventCallback) which can be used
  *       instead of this global callback.
  * @note
  *   The following events are supported:
  *
  *   | Event                       | Description                   |
  *   |-----------------------------|-------------------------------|
  *   | HAL_ETH_CH_EVENT_DMA_RBU    | Receive Buffer Unavailable.   |
  *   | HAL_ETH_CH_EVENT_DMA_TBU    | Transmit Buffer Unavailable.  |
  *   | HAL_ETH_CH_EVENT_DMA_RWT    | Receive Watchdog Timeout.     |
  *   | HAL_ETH_CH_EVENT_MTL_RX_OF  | MTL Receive Queue Overflow.   |
  *   | HAL_ETH_CH_EVENT_MTL_TX_OF  | MTL Transmit Queue Underflow. |
  *
  * @note
  *   - The callback function can be invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - If additional processing is required, it is recommended to defer such
  *     operations to a separate task or thread.
  *
  * @sa hal_eth_handle_t
  * @sa ETH_Channel_Event_Codes
  * @sa HAL_ETH_RegisterChannelTxEventCallback
  * @sa hal_eth_channel_cb_t
  */
__WEAK void HAL_ETH_TxEventCallback(hal_eth_handle_t *heth, uint32_t channel, uint32_t events)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(channel);
  STM32_UNUSED(events);
}

