MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
/**
  * @brief  Ethernet reception (RX) event callback (weak implementation).
  *
  * This weak function is invoked by the HAL to notify the application about
  * RX-related events on a given Ethernet channel. Typical events include
  * reception complete, reception errors, or other channel-specific conditions,
  * encoded in @p events as a bitmask.
  *
  * The default implementation is empty and simply marks all parameters as
  * unused. To handle RX events, the user application must provide a strong
  * implementation with the same prototype and perform the desired processing
  * based on the @p channel and @p events values.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration and state of the Ethernet peripheral.
  * @param[in] channel
  *         RX channel identifier on which the event occurred.
  * @param[in] events
  *         Bitmask of RX events that occurred on the specified channel.
  *         The exact meaning of each bit depends on the Ethernet HAL event
  *         definitions (e.g. RX complete, RX error, etc.).
  *
  * @warning This function is declared as @c __WEAK so that it can be overridden
  *          by a user-defined implementation without modifying the HAL sources.
  * @warning This function must not be modified, when the callback is needed,
  *          HAL_ETH_RxEventCallback can be implemented in the user file.
  * @note The HAL can also provide per-channel callbacks (registered via
  *       @ref HAL_ETH_RegisterChannelRxEventCallback) which can be used
  *       instead of this global callback.
  * @note
  *   The following events are supported:
  *
  *   | Event                       | Description                   |
  *   |-----------------------------|-------------------------------|
  *   | HAL_ETH_CH_EVENT_DMA_RBU    | Receive Buffer Unavailable.   |
  *   | HAL_ETH_CH_EVENT_DMA_TBU    | Transmit Buffer Unavailable.  |
  *   | HAL_ETH_CH_EVENT_DMA_RWT    | Receive Watchdog Timeout.     |
  *   | HAL_ETH_CH_EVENT_MTL_RX_OF  | MTL Receive Queue Overflow.   |
  *   | HAL_ETH_CH_EVENT_MTL_TX_OF  | MTL Transmit Queue Underflow. |
  *
  * @note
  *   - The callback function can be invoked in handler mode; therefore, it must
  *     execute quickly and must not perform any blocking operations.
  *   - If additional processing is required, it is recommended to defer such
  *     operations to a separate task or thread.
  *
  * @sa hal_eth_handle_t
  * @sa ETH_Channel_Event_Codes
  * @sa HAL_ETH_RegisterChannelRxEventCallback
  * @sa hal_eth_channel_cb_t
  */
__WEAK void HAL_ETH_RxEventCallback(hal_eth_handle_t *heth, uint32_t channel, uint32_t events)
{
  STM32_UNUSED(heth);
  STM32_UNUSED(channel);
  STM32_UNUSED(events);
}

/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group9
  * @{
  */
/**
  * @brief  Execute Ethernet TX/RX data handlers for the specified channels.
  *
  * This function processes pending TX and/or RX descriptors for the channels
  * selected by @p input_channel_mask. It walks through each selected channel,
  * locks it, inspects its descriptor list, calls user callbacks for completed
  * packets, updates descriptor state and counters, and then unlocks the
  * channel. Channels that could not be processed (locked or callback failure)
  * are reported via @p p_output_channel_mask.
  *
  * The data execution handler starts by scanning all requested Tx channels in
  * the @p input_channel_mask list, then proceeds with all Rx channels in the list.
  *
  * **TX path:**
  * - For each TX channel bit set in @p input_channel_mask:
  *   - Ensure the channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *     @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *   - Lock the TX channel.
  *     - If lock fails, set the corresponding bit in @p *p_output_channel_mask
  *       and continue with the next channel.
  *   - Iterate the used TX descriptors (from
  *     @c heth->tx_channels[ch].tx_desc_list.built_desc_id):
  *     - Invalidate cache for the descriptor.
  *     - If descriptor is still owned by DMA (@ref ETH_DMA_TX_DESC_RF_OWN):
  *       stop processing this channel.
  *     - If no packet is attached (@c p_pkt_addr == NULL):
  *       - Treat it as a context descriptor and reset it.
  *     - Otherwise:
  *       - Build a @ref hal_eth_tx_cb_pkt_data_t structure with:
  *         - Status bits (FD/LD).
  *         - Error bits (IH, ED, EC, LC, NC, LOC, PC, JT).
  *         - Application context pointer (@c p_app_data).
  *       - Call the TX complete callback
  *         @c p_tx_complete_cb(heth, channel_id, p_pkt_addr, tx_cb_pkt_data).
  *         - If it returns not HAL_OK, set the channel bit in
  *           @p *p_output_channel_mask, keep the descriptor, and stop
  *           processing this channel.
  *       - If callback succeeds, reset the descriptor.
  *     - Flush cache for the descriptor.
  *     - Move to the next descriptor and decrement @c buff_in_use.
  *   - Store updated descriptor index and used count in the handle.
  *   - Unlock the TX channel.
  *
  * **RX path:**
  * - For each RX channel bit set in @p input_channel_mask:
  *   - Ensure the channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *     @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *   - Lock the RX channel.
  *     - If lock fails, set the channel bit in @p *p_output_channel_mask
  *       and continue with the next channel.
  *   - Iterate the used RX descriptors (from
  *     @c heth->rx_channels[ch].rx_desc_list.built_desc_id):
  *     - Invalidate cache for the descriptor.
  *     - If descriptor is still owned by DMA (@ref ETH_DMA_RX_DESC_WBF_OWN):
  *       stop processing this channel.
  *     - If descriptor is a context descriptor
  *       (@ref ETH_DMA_RX_DESC_WBF_CTXT set):
  *       - Clear its fields (backup address & context).
  *     - Otherwise:
  *       - Build a @ref hal_eth_rx_cb_pkt_data_t structure:
  *         - Read packet length from @ref ETH_DMA_RX_DESC_WBF_PL.
  *         - Set status bits (FD/LD).
  *         - If LD is set:
  *           - Copy additional status bits (IPCB, IPv4, IPv6, ARPNR, VLAN)
  *             from desc1/desc2/desc3.
  *           - If VLAN present:
  *             - Copy VLAN tag value from desc0 into @c vlan_tag_ids.
  *         - Set error bits using desc1/desc3 (IPH, IPC, DB, REC, OFL, RWT, GP, CRC).
  *         - Set application context from @c p_app_data.
  *       - Call the RX complete callback
  *         @c p_rx_complete_cb(heth, channel_id, p_pkt_addr, rec_pkt_size,
  *                             rx_pkt_data).
  *         - If it returns not HAL_OK, set the channel bit in
  *           @p *p_output_channel_mask, keep the descriptor, and stop
  *           processing this channel.
  *       - If callback succeeds, reset the descriptor.
  *     - Flush cache for the descriptor.
  *     - Move to the next descriptor and decrement @c buff_in_use.
  *   - Store updated descriptor index and used count in the handle.
  *   - Replenish RX descriptors.
  *   - Unlock the RX channel.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure containing the
  *         configuration and runtime state for the Ethernet peripheral.
  *         Its @c tx_channels[] and @c rx_channels[] descriptor lists are
  *         updated by this function.
  * @param[in]     input_channel_mask
  *         Bitmask indicating which channels to process. It can contain:
  *         - TX channel bits (subset of @ref HAL_ETH_TX_CHANNEL_ALL).
  *         - RX channel bits (subset of @ref HAL_ETH_RX_CHANNEL_ALL).
  *         Both TX and RX handling are performed if both groups are present.
  * @param[in,out] p_output_channel_mask
  *         Pointer to a bitmask used to report channels that could not be
  *         fully processed. On input, the value can contain an initial mask
  *         (typically 0). On output, bits are set for channels where:
  *         - The channel is locked (could not be acquired).
  *         - The user TX/RX complete callback returned an error
  *           (descriptor kept for next execution).
  *
  * @pre
  * - @p heth must not be @c NULL.
  * - @p p_output_channel_mask must not be @c NULL.
  * - @p heth->global_state must be @ref HAL_ETH_STATE_CONFIGURED (checked
  *   with debug and optional runtime checks).
  *
  * @note Cache maintenance is performed either via user-registered callbacks
  *       (@c p_cache_invalidate_cb, @c p_cache_flush_cb) when
  *       @c USE_HAL_ETH_REGISTER_CALLBACKS is enabled, or via the weak
  *       default implementations @ref HAL_ETH_CacheInvalidateCallback and
  *       @ref HAL_ETH_CacheFlushCallback otherwise.
  * @note This function does not start or stop channels; it only processes
  *       descriptors for channels that are already active or suspended.
  * @note This function is not intended to be called from a handler execution
  *       mode (interrupt context). In a bare-metal integration, the application
  *       must implement a deferred call mechanism so that it is invoked later
  *      from thread mode (process context).
  *
  * @retval HAL_OK
  *         Data handler executed; channels requiring further processing are
  *         indicated via @p *p_output_channel_mask.
  * @retval HAL_INVALID_PARAM
  *         @p heth or @p p_output_channel_mask is @c NULL (only when
  *         parameter checking is enabled via @c USE_HAL_CHECK_PARAM).
  */
hal_status_t HAL_ETH_ExecDataHandler(hal_eth_handle_t *heth, uint32_t input_channel_mask,
                                     uint32_t *p_output_channel_mask)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_output_channel_mask != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_MASK(input_channel_mask));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_output_channel_mask == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  if ((input_channel_mask & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    /* Scan TX channels by priority: highest channel index first, then down to lowest. */
    for (int32_t ch = ((int32_t)USE_HAL_ETH_MAX_TX_CH_NB - 1L); ch >= 0L; ch--)
    {
      if ((input_channel_mask & ETH_GET_TX_CH_ID(ch)) != 0UL)
      {
        ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE |
                         (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);
        if (ETH_LockChannel(&heth->tx_channels[ch].channel_lock_state) != HAL_OK)
        {
          /* TX channel busy, keep it in output mask so caller can retry later. */
          *p_output_channel_mask |= ETH_GET_TX_CH_ID(ch);
          continue;
        }
        *p_output_channel_mask |= ETH_ExecTxDataHandler(heth, (uint32_t)ch);
        ETH_UnlockChannel(&heth->tx_channels[ch].channel_lock_state);
      }
    }
  }
  if ((input_channel_mask & HAL_ETH_RX_CHANNEL_ALL) != 0UL)
  {
    /* Scan RX channels by priority: highest channel index first, then down to lowest. */
    for (int32_t ch = ((int32_t)USE_HAL_ETH_MAX_RX_CH_NB - 1L); ch >= 0L; ch--)
    {
      if ((input_channel_mask & ETH_GET_RX_CH_ID(ch)) != 0UL)
      {
        ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE |
                         (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);
        if (ETH_LockChannel(&heth->rx_channels[ch].channel_lock_state) != HAL_OK)
        {
          /* RX channel busy: keep it in output mask so caller can retry later. */
          *p_output_channel_mask |= ETH_GET_RX_CH_ID(ch);
          continue;
        }

