MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
        *p_output_channel_mask |= ETH_ExecRxDataHandler(heth, (uint32_t)ch);

        ETH_UnlockChannel(&heth->rx_channels[ch].channel_lock_state);
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Request transmission of a packet on the specified TX channel.
  *
  * This function prepares and queues one Ethernet packet for transmission
  * on a given TX channel by configuring the corresponding DMA descriptors.
  * The packet is described by an array of buffers @p p_buff_array and
  * a TX configuration structure @p p_tx_conf.
  *
  * The function:
  * - Validates parameters and channel index.
  * - Translates the @p channel bitmask into a TX channel index.
  * - Checks that the TX channel state is
  *   @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *   @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  * - Locks the TX channel; if the channel is already locked, it returns HAL_BUSY.
  * - Prepare DMA TX descriptors for the
  *   specified buffers and configuration.
  * - Unlocks the TX channel and returns the status.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration and runtime state of the Ethernet peripheral.
  * @param[in]     channel
  *         TX channel identifier (bitmask), must satisfy
  *         @ref IS_ETH_CHANNEL_TX_INDEX. If multiple bits are set, only the
  *         first matching TX channel index is used.
  * @param[in]     p_buff_array
  *         Pointer to an array of @ref hal_eth_buffer_t structures describing
  *         the buffer(s) that make up the packet to transmit (address and size).
  * @param[in]     buf_count
  *         Number of elements in @p p_buff_array.
  * @param[in]     p_tx_conf
  *         Pointer to a @ref hal_eth_tx_pkt_config_t structure that contains
  *         per-packet TX configuration (e.g. checksums, VLAN tagging, etc.).
  *
  * @pre
  * - @p heth must have been initialized and configured
  *   (@ref HAL_ETH_Init + @ref HAL_ETH_SetConfig).
  * - @p heth->global_state must be @ref HAL_ETH_STATE_CONFIGURED
  *   (checked with debug and optional runtime checks).
  * - The TX channel must be in
  *   @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *   @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *
  * @note This function only prepares the DMA descriptors; the current start
  *       of transmission depends on the number of already queued packets
  *       which are still pending for execution by the Ethernet DMA engine.
  *
  * @retval HAL_OK
  *         The packet was successfully queued for transmission via DMA.
  * @retval HAL_BUSY
  *         - The specified TX channel is currently locked and cannot accept
  *         a new transmission request.
  *         - Not enough free descriptors available to queue the packet.
  * @retval HAL_INVALID_PARAM
  *         - @p heth, @p p_buff_array, or @p p_tx_conf is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_TX_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_ExecDataHandler
  */
hal_status_t HAL_ETH_RequestTx(hal_eth_handle_t *heth, uint32_t channel, hal_eth_buffer_t *p_buff_array,
                               uint32_t buf_count, hal_eth_tx_pkt_config_t *p_tx_conf)
{
  hal_status_t return_status ;
  uint32_t ch = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_buff_array != NULL);
  ASSERT_DBG_PARAM(p_tx_conf != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_TX_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_buff_array == NULL) || (p_tx_conf == NULL) || (IS_ETH_CHANNEL_TX_INDEX(channel) == 0UL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);
  ETH_GetTXChIndex(&ch, channel);

  ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE |
                   (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);
  if (ETH_LockChannel(&heth->tx_channels[ch].channel_lock_state) != HAL_OK)
  {
    return HAL_BUSY;
  }

  return_status = ETH_RequestTxDMA(heth, ch, p_buff_array, buf_count, p_tx_conf);

  ETH_UnlockChannel(&heth->tx_channels[ch].channel_lock_state);

  return return_status;
}

/**
  * @brief  Start an Ethernet TX or RX channel.
  *
  * This function initializes the descriptor list and starts either a TX or RX
  * channel, depending on the @p channel identifier. It configures DMA and MTL
  * for the selected channel, enables the required DMA/MAC interrupts, and
  * starts the corresponding DMA and MAC data path.
  *
  * The descriptor memory @p p_desc_mem must be aligned on the bus data width
  * (ETH_BUS_DATA_WIDTH_BYTE) and large enough to hold all descriptors for
  * the selected channel.
  *
  * **TX channel start:**
  * - Derive TX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  * - Check mandatory TX callback @c p_tx_complete_cb is registered.
  * - Move channel state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Initialize the TX descriptor list.
  * - Enable TX DMA interrupts (NIE, AIE, CDEE, FBEE, TIE).
  * - Flush TX FIFO, start DMA TX, clear TX stopped status, enable MAC TX.
  *
  * **RX channel start:**
  * - Derive RX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  * - Check mandatory RX callbacks @c p_rx_complete_cb and
  *   @c p_rx_allocate_cb are registered.
  * - Move channel state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Initialize the RX descriptor list.
  * - Enable RX DMA interrupts (NIE, AIE, CDEE, FBEE, RIE, RBUE).
  * - Start DMA RX and enable MAC RX.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         Channel identifier that must satisfy
  *         @ref IS_ETH_CHANNEL_INDEX. If it matches any bit in
  *         @ref HAL_ETH_TX_CHANNEL_ALL, a TX channel is started; otherwise
  *         an RX channel is started.
  * @param[in]     p_desc_mem
  *         Pointer to the descriptor memory area for the selected channel.
  *         Must be aligned on @c ETH_BUS_DATA_WIDTH_BYTE.
  * @param[in]     desc_size_byte
  *         Size in bytes of the descriptor memory region pointed to by
  *         @p p_desc_mem.
  *
  * @pre
  * - @p heth must have been initialized and configured
  *   (@ref HAL_ETH_Init + @ref HAL_ETH_SetConfig).
  * - @p heth->global_state must be @ref HAL_ETH_STATE_CONFIGURED
  *   (checked with debug and optional runtime checks).
  * - The selected channel must be in @ref HAL_ETH_CHANNEL_STATE_CONFIGURED.
  *
  * @note This function does not allocate data buffers; it only initializes
  *       descriptor lists and starts the hardware for the given channel.
  * @note For RX channels, the @c p_rx_allocate_cb callback is expected to
  *       allocate and attach buffers to the RX descriptors during operation.
  *
  * @retval HAL_OK
  *         The channel was successfully started.
  * @retval HAL_INVALID_PARAM
  *         - @p heth or @p p_desc_mem is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_INDEX() returns 0), or
  *         - @p p_desc_mem is not aligned to ETH_BUS_DATA_WIDTH_BYTE, or
  *         - Mandatory @p p_tx_complete_cb callback for the selected channel
  *         is not set.
  *
  */
hal_status_t HAL_ETH_StartChannel(hal_eth_handle_t *heth, uint32_t channel, uint32_t *p_desc_mem,
                                  uint32_t desc_size_byte)
{
  uint32_t ch = 0UL;
  hal_status_t return_status = HAL_ERROR;
  uint32_t desc_align_byte = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_desc_mem != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_desc_mem == NULL) || (IS_ETH_CHANNEL_INDEX(channel) == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);

    ASSERT_DBG_PARAM(IS_ETH_DESC_SIZE_BYTE_VALID(desc_size_byte, heth->tx_channels[ch].tx_desc_list.desc_len_byte,
                                                 heth->tx_channels[ch].tx_desc_list.total_desc_cnt));
    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

    desc_align_byte = (heth->tx_channels[ch].tx_desc_list.desc_len_byte == sizeof(eth_dma_descriptor_t))
                      ? ETH_BUS_DATA_WIDTH_BYTE
                      : heth->tx_channels[ch].tx_desc_list.desc_len_byte;

