MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
    if ((desc_align_byte == 0UL) || ((ETH_CAST_PTR_TO_U32(p_desc_mem) % desc_align_byte) != 0UL))
    {
      return HAL_INVALID_PARAM;
    }

    if (heth->tx_channels[ch].p_tx_complete_cb != NULL)
    {
      return_status = ETH_StartTxChannel(heth, ch, p_desc_mem, desc_size_byte);
    }
    else
    {
      return_status = HAL_ERROR;
    }
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);

    ASSERT_DBG_PARAM(IS_ETH_DESC_SIZE_BYTE_VALID(desc_size_byte, heth->rx_channels[ch].rx_desc_list.desc_len_byte,
                                                 heth->rx_channels[ch].rx_desc_list.total_desc_cnt));
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED);

    desc_align_byte = (heth->rx_channels[ch].rx_desc_list.desc_len_byte == sizeof(eth_dma_descriptor_t))
                      ? ETH_BUS_DATA_WIDTH_BYTE
                      : heth->rx_channels[ch].rx_desc_list.desc_len_byte;
    if ((desc_align_byte == 0UL) || ((ETH_CAST_PTR_TO_U32(p_desc_mem) % desc_align_byte) != 0UL))
    {
      return HAL_INVALID_PARAM;
    }

    if ((heth->rx_channels[ch].p_rx_complete_cb != NULL) && (heth->rx_channels[ch].p_rx_allocate_cb != NULL))
    {
      return_status = ETH_StartRxChannel(heth, ch, p_desc_mem, desc_size_byte);
    }
    else
    {
      return_status = HAL_ERROR;
    }
  }

  return return_status;
}

/**
  * @brief  Stop an Ethernet TX or RX channel.
  *
  * This function stops either a TX or RX channel, depending on the
  * @p channel identifier. It updates the channel state, acquires the channel
  * lock, calls the appropriate low-level stop routine, and then releases
  * the lock.
  *
  * **TX channel stop:**
  * - Determine TX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - Move channel state to @ref HAL_ETH_CHANNEL_STATE_CONFIGURED using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Lock the TX channel;
  *   - On failure, restore state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE and
  *     return HAL_BUSY.
  * - Stop DMA/MTL/MAC activity on this TX channel.
  * - Unlock the channel.
  *
  * **RX channel stop:**
  * - Determine RX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - Move channel state to @ref HAL_ETH_CHANNEL_STATE_CONFIGURED using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Lock the RX channel;
  *   - On failure, restore state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE and
  *     return HAL_BUSY.
  * - Stop DMA/MTL/MAC activity on this RX channel.
  * - Unlock the channel.
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         Channel identifier (bitmask) that must satisfy
  *         @ref IS_ETH_CHANNEL_INDEX. If it intersects
  *         @ref HAL_ETH_TX_CHANNEL_ALL, a TX channel is stopped;
  *         otherwise an RX channel is stopped.
  *
  * @pre
  * - The selected channel must be in @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - @p heth must have been initialized and configured.
  *
  * @note This function does not de-initialize the descriptor lists; it only
  *       stops the DMA/MAC activity for the specified channel. Descriptors
  *       can be reused after restarting the channel.
  *
  * @retval HAL_OK
  *         The selected channel was successfully stopped.
  * @retval HAL_BUSY
  *         The selected channel could not be locked for stopping; its state
  *         is restored to @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * @retval HAL_ERROR
  *         Hardware error occurred while stopping the channel.
  * @retval HAL_INVALID_PARAM
  *         - @p heth is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_StartChannel
  */
hal_status_t HAL_ETH_StopChannel(hal_eth_handle_t *heth, uint32_t channel)
{
  uint32_t ch = 0UL;
  hal_status_t return_status;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (IS_ETH_CHANNEL_INDEX(channel) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE
                     | (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);

    if (ETH_LockChannel(&heth->tx_channels[ch].channel_lock_state) != HAL_OK)
    {
      return HAL_BUSY;
    }
    return_status = ETH_StopTxChannel(heth, ch);
    if (return_status == HAL_OK)
    {
      heth->tx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_CONFIGURED;
    }
    else
    {
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
      heth->last_error_codes = HAL_ETH_ERROR_UNDEFINED;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
      heth->global_state     = HAL_ETH_STATE_FAULT;
    }
    ETH_UnlockChannel(&heth->tx_channels[ch].channel_lock_state);
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE
                     | (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);

    if (ETH_LockChannel(&heth->rx_channels[ch].channel_lock_state) != HAL_OK)
    {
      return HAL_BUSY;
    }
    return_status = ETH_StopRxChannel(heth, ch);
    if (return_status == HAL_OK)
    {
      heth->rx_channels[ch].channel_state = HAL_ETH_CHANNEL_STATE_CONFIGURED;
    }
    else
    {
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
      heth->last_error_codes = HAL_ETH_ERROR_UNDEFINED;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
      heth->global_state     = HAL_ETH_STATE_FAULT;
    }
    ETH_UnlockChannel(&heth->rx_channels[ch].channel_lock_state);
  }

  return return_status;
}

/**
  * @brief  Suspend an Ethernet TX or RX channel.
  *
  * This function suspends activity on either a TX or RX channel, depending on
  * the @p channel bitmask. For TX channels, it stops the DMA transmission and
  * waits for the queue to drain; for RX channels, it stops the DMA reception.
  * The channel state is updated from @ref HAL_ETH_CHANNEL_STATE_ACTIVE to
  * @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *
  * **TX channel suspend:**
  * - Determine TX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - Update channel state to @ref HAL_ETH_CHANNEL_STATE_SUSPENDED using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Disable TX DMA transmission (clear @c TXCR_ST).
  * - Wait for the MTL TX queue to finish the current transfer by polling
  *   @c MTLTXQXDR until the queue status bits (e.g. @c TXQSTS) are cleared or
  *   @ref ETH_TX_DMA_STOP_TIMEOUT elapses.
  *
  * **RX channel suspend:**
  * - Determine RX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - Update channel state to @ref HAL_ETH_CHANNEL_STATE_SUSPENDED using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Disable RX DMA reception (clear @c RXCR_SR).
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         Channel identifier (bitmask) that must satisfy
  *         @ref IS_ETH_CHANNEL_INDEX. If it intersects
  *         @ref HAL_ETH_TX_CHANNEL_ALL, a TX channel is suspended;
  *         otherwise an RX channel is suspended.
  *
  * @pre
  * - The selected channel must be in @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  * - @p heth must have been initialized and configured.
  *
  * @note This API only suspends the DMA path; descriptors and channel
  *       configuration are preserved and can be resumed later by a dedicated
  *       resume/start API.
  *
  * @retval HAL_OK
  *         The selected channel was successfully suspended.
  * @retval HAL_ERROR
  *         - Timeout occurred while waiting for the TX queue to drain.
  * @retval HAL_INVALID_PARAM
  *         - @p heth is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_StartChannel
  * @sa HAL_ETH_StopChannel
  */
hal_status_t HAL_ETH_SuspendChannel(hal_eth_handle_t *heth, uint32_t channel)
{
  uint32_t tick_start = 0UL;
  uint32_t ch = 0UL;
  ETH_DMA_Channel_TypeDef *p_dma_instance = NULL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (IS_ETH_CHANNEL_INDEX(channel) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);

    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state, HAL_ETH_CHANNEL_STATE_ACTIVE);

    ETH_STATES_CHECK_UPDATE(heth->tx_channels[ch].channel_state,
                            (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE,
                            HAL_ETH_CHANNEL_STATE_SUSPENDED);

    p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);

    STM32_CLEAR_BIT(p_dma_instance->DMACXTXCR, ETH_DMACTXCR_ST);

    tick_start = HAL_GetTick();
    while (ETH_DMA_GetTxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_TX_DMA_PROCESS_STOPPED)
    {
      if ((HAL_GetTick() - tick_start) > ETH_TX_DMA_STOP_TIMEOUT)
      {
        if (ETH_DMA_GetTxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_TX_DMA_PROCESS_STOPPED)
        {
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
          heth->last_error_codes = HAL_ETH_ERROR_UNDEFINED;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
          heth->global_state     = HAL_ETH_STATE_FAULT;

          return HAL_ERROR;
        }
      }
    }
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE);
    ETH_STATES_CHECK_UPDATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE,
                            HAL_ETH_CHANNEL_STATE_SUSPENDED);

    p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);
    STM32_CLEAR_BIT(p_dma_instance->DMACXRXCR, ETH_DMACRXCR_SR);

    tick_start = HAL_GetTick();
    while (ETH_DMA_GetRxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_RX_DMA_PROCESS_STOPPED)
    {
      if ((HAL_GetTick() - tick_start) > ETH_RX_DMA_STOP_TIMEOUT)
      {
        if (ETH_DMA_GetRxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_RX_DMA_PROCESS_STOPPED)
        {
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
          heth->last_error_codes = HAL_ETH_ERROR_UNDEFINED;
#endif /* USE_HAL_ETH_GET_LAST_ERRORS */
          heth->global_state     = HAL_ETH_STATE_FAULT;

          return HAL_ERROR;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Resume a previously suspended Ethernet TX or RX channel.
  *
  * This function resumes DMA activity on either a TX or RX channel, depending
  * on the @p channel bitmask. It updates the channel state from
  * @ref HAL_ETH_CHANNEL_STATE_SUSPENDED back to
  * @ref HAL_ETH_CHANNEL_STATE_ACTIVE and reenables the corresponding DMA
  * control bit.
  *
  * **TX channel resume:**
  * - Determine TX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  * - Update channel state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Enable TX DMA transmission (set @c TXCR_ST).
  *
  * **RX channel resume:**
  * - Determine RX channel index from @p channel.
  * - Check channel state is @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  * - Update channel state to @ref HAL_ETH_CHANNEL_STATE_ACTIVE using
  *   @ref ETH_STATES_CHECK_UPDATE.
  * - Enable RX DMA reception (set @c RXCR_SR).
  *
  * @param[in,out] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         configuration information and runtime state for the Ethernet
  *         peripheral.
  * @param[in]     channel
  *         Channel identifier (bitmask) that must satisfy
  *         @ref IS_ETH_CHANNEL_INDEX. If it intersects
  *         @ref HAL_ETH_TX_CHANNEL_ALL, a TX channel is resumed;
  *         otherwise an RX channel is resumed.
  *
  * @pre
  * - The selected channel must be in @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  * - @p heth must have been initialized, configured, and the channel
  *   previously started and suspended.
  *
  * @note This function only resumes DMA activity; descriptor lists and other
  *       channel settings are assumed to be valid from prior configuration.
  *
  * @retval HAL_OK
  *         The selected channel was successfully resumed.
  * @retval HAL_ERROR
  *         Channel index could not be derived from @p channel.
  * @retval HAL_INVALID_PARAM
  *         - @p heth is @c NULL, or
  *         - @p channel is invalid (IS_ETH_CHANNEL_INDEX() returns 0),
  *         and parameter checking is enabled via @c USE_HAL_CHECK_PARAM.
  *
  * @sa HAL_ETH_SuspendChannel
  * @sa HAL_ETH_StartChannel
  */
hal_status_t HAL_ETH_ResumeChannel(hal_eth_handle_t *heth, uint32_t channel)
{
  uint32_t ch = 0UL;
  ETH_DMA_Channel_TypeDef *p_dma_instance = NULL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (IS_ETH_CHANNEL_INDEX(channel) == 0UL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);

    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state,
                     (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);

    ETH_STATES_CHECK_UPDATE(heth->tx_channels[ch].channel_state,
                            (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED,
                            HAL_ETH_CHANNEL_STATE_ACTIVE);

    p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);
    STM32_SET_BIT(p_dma_instance->DMACXTXCR, ETH_DMACTXCR_ST);
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED);
    ETH_STATES_CHECK_UPDATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_SUSPENDED,
                            HAL_ETH_CHANNEL_STATE_ACTIVE);
    p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);
    STM32_SET_BIT(p_dma_instance->DMACXRXCR, ETH_DMACRXCR_SR);
  }
  return HAL_OK;
}

/**
  * @brief  Get the number of buffers in use (owned by the hardware) for a channel.
  *
  * The returned counter (TX/RX @c buff_in_use) is maintained by the driver and is
  * updated when TX buffers are queued (via @ref HAL_ETH_RequestTx),
  * and when RX/TX completions are processed (via @ref HAL_ETH_ExecDataHandler.
  *
  * This function returns the current number of buffers in use (owned by the
  * hardware) for the specified Ethernet channel (Tx or Rx). The channel type
  * is inferred from @p channel using the @ref HAL_ETH_TX_CHANNEL_ALL mask.
  *
  * @param[in]  heth       Pointer to a @ref hal_eth_handle_t structure that
  *                        contains the configuration information for the
  *                        specified Ethernet peripheral.
  * @param[in]  channel    Channel index, as defined by @ref IS_ETH_CHANNEL_INDEX.
  *                        The function automatically distinguishes between Tx
  *                        and Rx channels using @ref HAL_ETH_TX_CHANNEL_ALL.
  *
  * @pre @p heth must not be @c NULL.
  * @pre @p p_buf_cnt must not be @c NULL.
  * @pre @p channel must be a valid channel index (see @ref IS_ETH_CHANNEL_INDEX).
  * @pre @p heth->global_state must be equal to @ref HAL_ETH_STATE_CONFIGURED.
  * @pre The corresponding channel state must be
  *      @ref HAL_ETH_CHANNEL_STATE_CONFIGURED or
  *      @ref HAL_ETH_CHANNEL_STATE_ACTIVE.
  *
  * @retval Number of buffers currently in use (owned by the hardware) for the
            specified channel.
  */
uint32_t HAL_ETH_GetChannelBufferInUseCount(const hal_eth_handle_t *heth, uint32_t channel)
{
  uint32_t ch;
  uint32_t ch_buff_in_use = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->tx_channels[ch].channel_state,
                     (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED | (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE);
    ch_buff_in_use = heth->tx_channels[ch].tx_desc_list.buff_in_use;
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    ASSERT_DBG_STATE(heth->rx_channels[ch].channel_state,
                     (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED | (uint32_t)HAL_ETH_CHANNEL_STATE_ACTIVE);
    ch_buff_in_use = heth->rx_channels[ch].rx_desc_list.buff_in_use;
  }

  return ch_buff_in_use;
}
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group10
  * @{
This subsection provides the Ethernet Multi-Queue Functions.
  - HAL_ETH_GetRxDMAChNumber(): Get the number of Rx DMA channels.
  */
/**
  * @brief  Get the number of Rx DMA channels.
  *
  * This function returns the maximum number of Rx DMA channels supported
  * by the Ethernet HAL configuration, as defined by
  * @ref USE_HAL_ETH_MAX_RX_CH_NB.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure.
  *                This parameter is currently unused.
  *
  * @retval Number of Rx DMA channels.
  */
uint32_t HAL_ETH_GetRxDMAChNumber(const hal_eth_handle_t *heth)
{
  STM32_UNUSED(heth);
  return USE_HAL_ETH_MAX_RX_CH_NB;
}

/**
  * @brief  Get the number of Tx DMA channels.
  *
  * This function returns the maximum number of Tx DMA channels supported
  * by the Ethernet HAL configuration, as defined by
  * @ref USE_HAL_ETH_MAX_TX_CH_NB.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure.
  *                This parameter is currently unused.
  *
  * @retval Number of Tx DMA channels.
  */
uint32_t HAL_ETH_GetTxDMAChNumber(const hal_eth_handle_t *heth)
{
  STM32_UNUSED(heth);
  return USE_HAL_ETH_MAX_TX_CH_NB;
}

/**
  * @brief  Get the number of Rx MTL queues.
  *
  * This function returns the maximum number of Rx MTL queues supported
  * by the Ethernet HAL configuration. In this implementation, the number
  * of Rx MTL queues is equal to @ref USE_HAL_ETH_MAX_RX_CH_NB.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure.
  *                This parameter is currently unused.
  *
  * @retval Number of Rx MTL queues.
  */
uint32_t HAL_ETH_GetRxMTLQNumber(const hal_eth_handle_t *heth)
{
  STM32_UNUSED(heth);
  return USE_HAL_ETH_MAX_RX_CH_NB;
}

/**
  * @brief  Get the number of Tx MTL queues.
  *
  * This function returns the maximum number of Tx MTL queues supported
  * by the Ethernet HAL configuration. In this implementation, the number
  * of Tx MTL queues is equal to @ref USE_HAL_ETH_MAX_TX_CH_NB.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure.
  *                This parameter is currently unused.
  *
  * @retval Number of Tx MTL queues.
  */
uint32_t HAL_ETH_GetTxMTLQNumber(const hal_eth_handle_t *heth)
{
  STM32_UNUSED(heth);
  return USE_HAL_ETH_MAX_TX_CH_NB;
}
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group11
  * @{
This subsection provides the Ethernet Peripheral and Channel State and Error Functions.
  - HAL_ETH_GetState(): Get the global state of the Ethernet peripheral.
  - HAL_ETH_GetChannelState(): Get the state of a channel.
  - HAL_ETH_GetLastErrorCodes(): Get the last error codes.
  */
/**
  * @brief  Return the global state of the Ethernet HAL driver.
  *
  * This function retrieves the current global state of the Ethernet HAL
  * associated with the given handle @p heth. The state reflects the overall
  * lifecycle of the peripheral (e.g. reset, initialized, ready, busy, error).
  *
  * @param[in] heth
  *         Pointer to a constant @ref hal_eth_handle_t structure that holds
  *         the Ethernet configuration and runtime state.
  *
  * @note This function does not perform any synchronization; it simply
  *       returns the current value of @c heth->global_state.
  *
  * @retval hal_eth_state_t
  *         The current global Ethernet state, typically one of:
  *         - @ref HAL_ETH_STATE_RESET
  *         - @ref HAL_ETH_STATE_INIT
  *         - @ref HAL_ETH_STATE_CONFIGURED
  *         - @ref HAL_ETH_STATE_POWER_DOWN
  *         - @ref HAL_ETH_STATE_FAULT
  *         (Exact values depend on the @ref hal_eth_state_t enumeration.)
  * @retval HAL_ETH_STATE_RESET
  *         Returned if @p heth is @c NULL and parameter checking is enabled
  *         (@c USE_HAL_CHECK_PARAM == 1).
  */
hal_eth_state_t HAL_ETH_GetState(const hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);

  return heth->global_state;
}

/**
  * @brief  Get the current state of an Ethernet TX or RX channel.
  *
  * This function returns the current state of the Ethernet channel specified
  * by @p channel. The channel identifier can correspond to either a TX or RX
  * channel; the function determines the direction and returns the associated
  * @ref hal_eth_channel_state_t value from the handle.
  *
  * The function:
  * - Validates @p heth and @p channel (with debug and optional runtime checks).
  * - If @p channel matches any TX channel bit (@ref HAL_ETH_TX_CHANNEL_ALL),
  *   it derives the TX channel index and returns @c heth->tx_channels[index].channel_state.
  * - Otherwise, it derives the RX channel index and returns @c heth->rx_channels[index].channel_state.
  * - On any error (invalid index, parameter check failure), it returns
  *   @ref HAL_ETH_CHANNEL_STATE_RESET.
  *
  * @param[in] heth
  *         Pointer to a constant @ref hal_eth_handle_t structure that holds
  *         the Ethernet configuration and channel runtime states.
  * @param[in] channel
  *         Channel identifier (bitmask) selecting the desired TX or RX channel.
  *         Must satisfy @ref IS_ETH_CHANNEL_INDEX. If the bitmask intersects
  *         @ref HAL_ETH_TX_CHANNEL_ALL, a TX channel state is returned;
  *         otherwise an RX channel state is returned.
  *
  * @note If @p channel contains multiple channel bits, the first matching
  *       channel (lowest index) is used.
  * @note If parameter checking is enabled and @p heth is @c NULL or
  *       @p channel is invalid, the function returns
  *       @ref HAL_ETH_CHANNEL_STATE_RESET.
  *
  * @retval hal_eth_channel_state_t
  *         The current state of the selected channel, typically one of:
  *         - @ref HAL_ETH_CHANNEL_STATE_RESET
  *         - @ref HAL_ETH_CHANNEL_STATE_CONFIGURED
  *         - @ref HAL_ETH_CHANNEL_STATE_ACTIVE
  *         - @ref HAL_ETH_CHANNEL_STATE_SUSPENDED
  *         (Actual values depend on the @ref hal_eth_channel_state_t enum.)
  *
  */
hal_eth_channel_state_t HAL_ETH_GetChannelState(const hal_eth_handle_t *heth, uint32_t channel)
{
  hal_eth_channel_state_t channel_state;
  uint32_t ch = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_CHANNEL_INDEX(channel));

  if ((channel & HAL_ETH_TX_CHANNEL_ALL) != 0UL)
  {
    ETH_GetTXChIndex(&ch, channel);
    channel_state = heth->tx_channels[ch].channel_state;
  }
  else
  {
    ETH_GetRXChIndex(&ch, channel);
    channel_state = heth->rx_channels[ch].channel_state;
  }

  return channel_state;
}

