MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
#if defined (USE_HAL_ETH_GET_LAST_ERRORS) && (USE_HAL_ETH_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the last recorded Ethernet error codes.
  *
  * This function returns the content of the @c last_error_codes field of the
  * given Ethernet handle @p heth. The field is typically updated internally
  * by the HAL when errors occur on the Ethernet peripheral (e.g. DMA errors,
  * descriptor errors, protocol errors).
  *
  * @param[in] heth
  *         Pointer to a constant @ref hal_eth_handle_t structure that contains
  *         the runtime state of the Ethernet peripheral, including the
  *         @c last_error_codes field.
  *
  * @note This API is available only when @c USE_HAL_ETH_GET_LAST_ERRORS is
  *       defined and set to 1.
  * @note The @c last_error_codes field is read-only from the user point of view
  *       and is updated by the HAL internal error handling logic.
  *
  * @retval uint32_t
  *         Bitmask containing the last error codes recorded for this handle.
  *         The exact meaning of each bit depends on the Ethernet HAL error
  *         definitions (e.g. @c HAL_ETH_ERROR_xxx).
  * @retval HAL_INVALID_PARAM
  *         If @p heth is @c NULL and parameter checking is enabled
  *         (@c USE_HAL_CHECK_PARAM == 1).
  */
uint32_t HAL_ETH_GetLastErrorCodes(const hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);

  return heth->last_error_codes;
}
#endif /* USE_HAL_ETH_GET_LAST_ERRORS && USE_HAL_ETH_GET_LAST_ERRORS = 1 */
/**
  * @}
  */

/** @addtogroup ETH_Exported_Functions_Group12
  * @{
This subsection provides the Ethernet MDIO Control and PHY I/O Operations Functions.
  - HAL_ETH_MDIO_UpdateClockRange(): Update the MDIO clock range.
  - HAL_ETH_MDIO_SetOpAttributes(): Configures Ethernet MDIO command attributes.
  - HAL_ETH_MDIO_C22ReadData(): Read a register from an external PHY using Clause 22 method.
  - HAL_ETH_MDIO_C22WriteData(): Write data to an external RHY register using Clause 22 method.
  - HAL_ETH_MDIO_C45ReadData(): Read a register from an external PHY using Clause 45 method.
  - HAL_ETH_MDIO_C45WriteData(): Write data to an external RHY register using Clause 45 method.
  - HAL_ETH_MDIO_C45ReadDataRange(): Read a range of registers from an external PHY using Clause 45 method.
  */
/**
  * @brief  Update the MDIO clock range according to the current HCLK frequency.
  *
  * This function recalculates and updates the MDIO clock divider (CSR Clock
  * Range) in the @c MACMDIOAR register based on the current AHB bus (HCLK)
  * frequency returned by HAL_RCC_GetHCLKFreq().
  *
  * It:
  * - Reads the current @c MACMDIOAR register value.
  * - Clears the CSR Clock Range (CR) bits.
  * - Computes the appropriate divider (e.g. @ref ETH_MDC_CLK_DIV_16,
  *   @ref ETH_MDC_CLK_DIV_26, etc.) according to the HCLK range.
  * - Writes back the new value into @c MACMDIOAR.
  *
  * The mapping between HCLK frequency and divider is:
  * - @c hclk < 35 MHz             --> @ref ETH_MDC_CLK_DIV_16
  * -  35 MHz <= @c hclk <  60 MHz --> @ref ETH_MDC_CLK_DIV_26
  * -  60 MHz <= @c hclk < 100 MHz --> @ref ETH_MDC_CLK_DIV_42
  * - 100 MHz <= @c hclk < 150 MHz --> @ref ETH_MDC_CLK_DIV_62
  * - 150 MHz <= @c hclk < 250 MHz --> @ref ETH_MDC_CLK_DIV_102
  * - 250 MHz <= @c hclk < 300 MHz --> @ref ETH_MDC_CLK_DIV_124
  * - 300 MHz <= @c hclk < 500 MHz --> @ref ETH_MDC_CLK_DIV_204
  * - @c hclk >= 500 MHz           --> @ref ETH_MDC_CLK_DIV_324
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration information for the Ethernet peripheral.
  *
  * @note This function is similar in purpose to the internal helper used
  *       during initialization, but can be called at runtime if the HCLK
  *       configuration changes (e.g. change of system clock).
  * @note The MDIO clock must respect the maximum clock allowed by the PHY
  *       (typically around 2.5 MHz); this function selects a divider that
  *       ensures compliance based on HCLK.
  * @note It is strongly recommended to call this function immediately after
  *       any change to the system clock tree that affects HCLK, before
  *       performing further MDIO transactions, to avoid violating the
  *       external device or the Ethernet MAC maximum MDC clock specification.
  */
void HAL_ETH_MDIO_UpdateClockRange(hal_eth_handle_t *heth)
{
  uint32_t hclk = 0UL;
  uint32_t tmpreg = 0UL;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  tmpreg = STM32_READ_REG(ETH_GET_INSTANCE(heth)->MACMDIOAR);

  tmpreg &= ~ETH_MACMDIOAR_CR;

  hclk = HAL_RCC_GetHCLKFreq();

  tmpreg |= ETH_GetMDIOClockRange(hclk);
  STM32_WRITE_REG(ETH_GET_INSTANCE(heth)->MACMDIOAR, tmpreg);
}

/**
  * @brief  Configure MDIO operation attributes in the MACMDIOAR register.
  *
  * This function sets specific MDIO operation attributes for subsequent
  * Clause 22/45 MDIO transactions by updating the corresponding bits in
  * the @c MACMDIOAR register.
  *
  * MDIO read/write operations performed by the HAL are synchronous: the calling
  * context is blocked until the corresponding MDIO transaction has fully
  * completed on the bus, or until the @ref ETH_MDIO_BUS_TIMEOUT duration is reached.
  *
  * The attributes updated are:
  * - @ref HAL_ETH_MDIO_FEAT_PSE : Preamble Suppression Enable.
  * - @ref HAL_ETH_MDIO_FEAT_BTB : Back-to-Back transaction mode.
  * - @ref HAL_ETH_MDIO_NTC_1_CYCLE  : 1 Trailing clock cycle.
  * - @ref HAL_ETH_MDIO_NTC_2_CYCLES : 2 Trailing clock cycles.
  * - @ref HAL_ETH_MDIO_NTC_3_CYCLES : 3 Trailing clock cycles.
  * - @ref HAL_ETH_MDIO_NTC_4_CYCLES : 4 Trailing clock cycles.
  * - @ref HAL_ETH_MDIO_NTC_5_CYCLES : 5 Trailing clock cycles.
  * - @ref HAL_ETH_MDIO_NTC_6_CYCLES : 6 Trailing clock cycles.
  * - @ref HAL_ETH_MDIO_NTC_7_CYCLES : 7 Trailing clock cycles.
  *
  * The caller provides @p cmd_attributes, which must contain the desired
  * combination of these bits (and only these bits). The function then
  * updates @c MACMDIOAR accordingly.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration information for the Ethernet peripheral.
  * @param[in] cmd_attributes
  *         Bitmask of MDIO operation attributes to be applied. This value
  *         is typically composed of one or more of:
  *         - @ref HAL_ETH_MDIO_FEAT_PSE : Preamble Suppression Enable.
  *         - @ref HAL_ETH_MDIO_FEAT_BTB : Back-to-Back transaction mode.
  *         - @ref HAL_ETH_MDIO_NTC_1_CYCLE  : 1 Trailing clock cycle.
  *         - @ref HAL_ETH_MDIO_NTC_2_CYCLES : 2 Trailing clock cycles.
  *         - @ref HAL_ETH_MDIO_NTC_3_CYCLES : 3 Trailing clock cycles.
  *         - @ref HAL_ETH_MDIO_NTC_4_CYCLES : 4 Trailing clock cycles.
  *         - @ref HAL_ETH_MDIO_NTC_5_CYCLES : 5 Trailing clock cycles.
  *         - @ref HAL_ETH_MDIO_NTC_6_CYCLES : 6 Trailing clock cycles.
  *         - @ref HAL_ETH_MDIO_NTC_7_CYCLES : 7 Trailing clock cycles.
  *
  * @note This function does not start any MDIO transaction; it only configures
  *       the attributes used by subsequent MDIO read/write operations.
  * @note The caller must ensure that @p heth is valid and that the Ethernet
  *       peripheral has been initialized before calling this function.
  * @note IMPORTANT: When performing a complete / full configuration or update
  *       sequence of an external device over MDIO, the user must ensure that
  *       the whole MDIO transaction sequence is executed in a protected,
  *       non-interleaved way. In particular, it must not be interrupted or
  *       interleaved with other MDIO accesses targeting the same or any other
  *       device on the MDIO bus. This protection must be implemented at the
  *       upper (application) level, typically by using a mutual exclusion or
  *       equivalent locking mechanism around the full MDIO access sequence.
  */
void HAL_ETH_MDIO_SetOpAttributes(hal_eth_handle_t *heth, uint32_t cmd_attributes)
{
  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(IS_ETH_MDIO_CMD_ATTR(cmd_attributes));
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

