MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->MACMDIOAR, (ETH_MACMDIOAR_PSE | ETH_MACMDIOAR_BTB | ETH_MACMDIOAR_NTC),
                   cmd_attributes);
}

/**
  * @brief  Write a single PHY register using MDIO Clause 22.
  *
  * This function performs one Clause 22 MDIO write operation to the register
  * @p reg_addr of the PHY device @p phy_dev_addr, writing the 16-bit value
  * @p data.
  *
  * MDIO write operations performed by the HAL are synchronous: the calling context is
  * blocked until the corresponding MDIO transaction has fully completed on the bus,
  * or until the @ref ETH_MDIO_BUS_TIMEOUT duration is reached.
  *
  * The procedure is:
  * - Check that the MDIO controller is not busy.
  * - Disable Clause 45 mode (enable Clause 22) by clearing
  *   @c MACMDIOAR C45E bit.
  * - Load the data to be written into @c MACMDIODR (DATA field).
  * - Load @c MACMDIOAR with:
  *   - PHY address (@p phy_dev_addr),
  *   - Register address (@p reg_addr),
  *   - Write command (@ref ETH_GOC_OPERATION_WRITE).
  * - Set the @ref ETH_MACMDIOAR_BUSY bit to start the write operation.
  * - Poll on @ref ETH_MACMDIOAR_BUSY until cleared or until
  *   @ref ETH_MDIO_BUS_TIMEOUT elapses.
  *
  * @param[in] heth
  *         Pointer to a constant @ref hal_eth_handle_t structure that
  *         contains the configuration information for the Ethernet peripheral.
  *         The handle itself is not modified by this function.
  * @param[in] phy_dev_addr
  *         PHY device address on the MDIO bus (Clause 22 PHY address).
  * @param[in] reg_addr
  *         Register address (0..31) within the selected PHY device.
  * @param[in] data
  *         16-bit data value to write into the specified register.
  *
  * @note Clause 22 mode is selected by clearing @c MACMDIOAR C45E bit.
  * @note IMPORTANT: When performing a complete / full configuration or update
  *       sequence of an external device over MDIO, the user must ensure that
  *       the whole MDIO transaction sequence is executed in a protected,
  *       non-interleaved way. In particular, it must not be interrupted or
  *       interleaved with other MDIO accesses targeting the same or any other
  *       device on the MDIO bus. This protection must be implemented at the
  *       upper (application) level, typically by using a mutual exclusion or
  *       equivalent locking mechanism around the full MDIO access sequence.
  *
  * @retval HAL_OK
  *         The register has been successfully written.
  * @retval HAL_ERROR
  *         - The MDIO controller was busy at the beginning of the operation.
  *         - A timeout occurred while waiting for the @ref ETH_MACMDIOAR_BUSY
  *           flag to clear.
  * @retval HAL_INVALID_PARAM
  *         The @p heth parameter is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_MDIO_C22ReadData
  * @sa HAL_ETH_MDIO_C45WriteData
  */
hal_status_t HAL_ETH_MDIO_C22WriteData(const hal_eth_handle_t *heth, uint8_t phy_dev_addr, uint8_t reg_addr,
                                       uint16_t data)
{
  uint32_t tick_start = 0UL;
  uint32_t tmpreg = 0UL;
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

  p_ethx = ETH_GET_INSTANCE(heth);
  if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
  {
    return HAL_ERROR;
  }

  STM32_CLEAR_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_C45E);
  STM32_MODIFY_REG(p_ethx->MACMDIODR, ETH_MACMDIODR_DATA, data);
  STM32_WRITE_REG(tmpreg, p_ethx->MACMDIOAR);

  /* Prepare the MDIO Address Register value:
     - Set the PHY device address
     - Set the PHY register address
     - Set the write mode */
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_PA, (((uint32_t)phy_dev_addr) << ETH_MACMDIOAR_PA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_RDA, (((uint32_t)reg_addr) << ETH_MACMDIOAR_RDA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_GOC, ETH_GOC_OPERATION_WRITE);

  STM32_WRITE_REG(p_ethx->MACMDIOAR, tmpreg);
  STM32_SET_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY);

  tick_start = HAL_GetTick();

  while (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
  {
    if (((HAL_GetTick() - tick_start) > ETH_MDIO_BUS_TIMEOUT))
    {
      if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Read a single PHY register using MDIO Clause 22.
  *
  * This function performs one Clause 22 MDIO read operation of the register
  * @p reg_addr located in the specified PHY device @p phy_dev_addr, and
  * returns the 16-bit register content through @p p_data.
  *
  * MDIO read operations performed by the HAL are synchronous: the calling context is
  * blocked until the corresponding MDIO transaction has fully completed on the bus,
  * or until the @ref ETH_MDIO_BUS_TIMEOUT duration is reached.
  *
  * The procedure is:
  * - Check that the MDIO controller is not busy.
  * - Disable Clause 45 mode (enable Clause 22) by clearing
  *   @c MACMDIOAR C45E bit.
  * - Load @c MACMDIOAR with:
  *   - PHY address (@p phy_dev_addr),
  *   - Register address (@p reg_addr),
  *   - Read command (@ref ETH_GOC_OPERATION_READ).
  * - Set the @ref ETH_MACMDIOAR_BUSY bit to start the read operation.
  * - Poll on @ref ETH_MACMDIOAR_BUSY until cleared or until
  *   @ref ETH_MDIO_BUS_TIMEOUT elapses.
  * - Read the data from @c MACMDIODR into @p p_data.
  *
  * @param[in]  heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration information for the Ethernet peripheral.
  * @param[in]  phy_dev_addr
  *         PHY device address on the MDIO bus (Clause 22 PHY address).
  * @param[in]  reg_addr
  *         Register address (0..31) within the selected PHY device.
  * @param[out] p_data
  *         Pointer to a @c uint16_t variable where the read register value
  *         will be stored.
  *
  * @note Clause 22 mode is selected by clearing @c MACMDIOAR C45E bit.
  * @note IMPORTANT: When performing a complete / full configuration or update
  *       sequence of an external device over MDIO, the user must ensure that
  *       the whole MDIO transaction sequence is executed in a protected,
  *       non-interleaved way. In particular, it must not be interrupted or
  *       interleaved with other MDIO accesses targeting the same or any other
  *       device on the MDIO bus. This protection must be implemented at the
  *       upper (application) level, typically by using a mutual exclusion or
  *       equivalent locking mechanism around the full MDIO access sequence.
  *
  * @retval HAL_OK
  *         The register has been successfully read and @p *p_data updated.
  * @retval HAL_ERROR
  *         - The MDIO controller was busy at the beginning of the operation.
  *         - A timeout occurred while waiting for the @ref ETH_MACMDIOAR_BUSY
  *           flag to clear.
  * @retval HAL_INVALID_PARAM
  *         @p heth or @p p_data is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_MDIO_C22WriteData
  * @sa HAL_ETH_MDIO_C45ReadData
  */
hal_status_t HAL_ETH_MDIO_C22ReadData(hal_eth_handle_t *heth, uint8_t phy_dev_addr, uint8_t reg_addr, uint16_t *p_data)
{
  uint32_t tick_start = 0UL;
  uint32_t tmpreg = 0UL;
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

