MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  p_ethx = ETH_GET_INSTANCE(heth);
  if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
  {
    return HAL_ERROR;
  }
  STM32_SET_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_C45E);
  STM32_MODIFY_REG(p_ethx->MACMDIODR, ETH_MACMDIODR_RA, (((uint32_t)reg_addr) << ETH_MACMDIODR_RA_Pos));
  STM32_WRITE_REG(tmpreg, p_ethx->MACMDIOAR);

  /* Prepare the MDIO Address Register value:
     - Set the PHY address
     - Set the device (MMD) address
     - Set the Read access operation */
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_PA, (((uint32_t)phy_addr) << ETH_MACMDIOAR_PA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_RDA, (((uint32_t)dev_addr) << ETH_MACMDIOAR_RDA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_GOC, ETH_GOC_OPERATION_READ);
  STM32_WRITE_REG(p_ethx->MACMDIOAR, tmpreg);

  STM32_SET_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY);

  tick_start = HAL_GetTick();

  while (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
  {
    if (((HAL_GetTick() - tick_start) > ETH_MDIO_BUS_TIMEOUT))
    {
      if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
      {
        return HAL_ERROR;
      }
    }
  }
  STM32_WRITE_REG(*p_data, (uint16_t)p_ethx->MACMDIODR);
  return HAL_OK;
}

/**
  * @brief  Read a range of PHY registers using MDIO Clause 45 post-increment access.
  *
  * This function performs a sequence of Clause 45 MDIO read operations starting
  * from @p start_reg_addr and reads @p count consecutive registers into the
  * buffer pointed to by @p p_data.
  *
  * MDIO read operations performed by the HAL are synchronous: the calling context is
  * blocked until the corresponding MDIO transaction has fully completed on the bus,
  * or until the @ref ETH_MDIO_BUS_TIMEOUT duration is reached.
  *
  * The procedure is:
  * - Check that the MDIO controller is not busy.
  * - Enable Clause 45 access in @c MACMDIOAR.
  * - Configure @c MACMDIOAR with:
  *   - PHY address (@p phy_addr),
  *   - Device address (@p dev_addr),
  *   - Post-read increment access command (@ref ETH_GOC_OPERATION_PRIAC45).
  * - Program the starting register address in @c MACMDIODR.
  * - For each element to read:
  *   - Set the @ref ETH_MACMDIOAR_BUSY bit to start a post-increment read.
  *   - Wait for the @ref ETH_MACMDIOAR_BUSY bit to clear or until
  *     @ref ETH_MDIO_BUS_TIMEOUT elapses.
  *   - Read the data from @c MACMDIODR into @p p_data[index].
  *
  * @param[in]  heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration information for the Ethernet peripheral.
  * @param[in]  phy_addr
  *         PHY address on the MDIO bus (Clause 45 PHY address field).
  * @param[in]  dev_addr
  *         PHY device (MMD) address for Clause 45 access.
  * @param[in]  start_reg_addr
  *         First PHY register address to read (Clause 45 register address).
  * @param[out] p_data
  *         Pointer to a buffer of @c uint16_t where the received register
  *         values will be stored. Must have room for @p count entries.
  * @param[in]  count
  *         Number of consecutive registers to read starting from
  *         @p start_reg_addr.
  *
  * @note Clause 45 mode is enabled for the duration of this function through
  *       the @c MACMDIOAR C45E bit.
  * @note IMPORTANT: When performing a complete / full configuration or update
  *       sequence of an external device over MDIO, the user must ensure that
  *       the whole MDIO transaction sequence is executed in a protected,
  *       non-interleaved way. In particular, it must not be interrupted or
  *       interleaved with other MDIO accesses targeting the same or any other
  *       device on the MDIO bus. This protection must be implemented at the
  *       upper (application) level, typically by using a mutual exclusion or
  *       equivalent locking mechanism around the full MDIO access sequence.
  *
  * @retval HAL_OK
  *         All requested registers have been successfully read.
  * @retval HAL_ERROR
  *         - The MDIO controller was busy at the beginning of the operation.
  *         - A timeout occurred while waiting for the @ref ETH_MACMDIOAR_BUSY
  *           flag to clear for any of the read operations.
  * @retval HAL_INVALID_PARAM
  *         @p heth or @p p_data is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  */
hal_status_t HAL_ETH_MDIO_C45ReadDataRange(hal_eth_handle_t *heth, uint8_t phy_addr, uint8_t dev_addr,
                                           uint16_t start_reg_addr,
                                           uint16_t *p_data, uint16_t count)
{
  uint32_t tick_start = 0UL;
  uint32_t tmpreg = 0UL;
  uint32_t index;
  ETH_TypeDef *p_ethx;

  ASSERT_DBG_PARAM(heth != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_STATE(heth->global_state, (uint32_t)HAL_ETH_STATE_CONFIGURED);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_data == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_ethx = ETH_GET_INSTANCE(heth);

  if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
  {
    return HAL_ERROR;
  }
  STM32_SET_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_C45E);
  STM32_WRITE_REG(tmpreg, p_ethx->MACMDIOAR);

  /* Prepare the MDIO Address Register value:
     - Set the PHY address
     - Set the device (MMD) address
     - Set the Post Read Increment Address for Clause 45 PHY */
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_PA, (((uint32_t)phy_addr) << ETH_MACMDIOAR_PA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_RDA, (((uint32_t)dev_addr) << ETH_MACMDIOAR_RDA_Pos));
  STM32_MODIFY_REG(tmpreg, ETH_MACMDIOAR_GOC, ETH_GOC_OPERATION_PRIAC45);
  STM32_WRITE_REG(p_ethx->MACMDIOAR, tmpreg);

  STM32_MODIFY_REG(p_ethx->MACMDIODR, ETH_MACMDIODR_RA,
                   (((uint32_t)start_reg_addr) << ETH_MACMDIODR_RA_Pos));

  for (index = 0UL; index < count; index++)
  {
    STM32_SET_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY);

    tick_start = HAL_GetTick();

    while (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
    {
      if (((HAL_GetTick() - tick_start) > ETH_MDIO_BUS_TIMEOUT))
      {
        if (STM32_READ_BIT(p_ethx->MACMDIOAR, ETH_MACMDIOAR_BUSY) != 0UL)
        {
          return HAL_ERROR;
        }
      }
    }
    p_data[index] = (uint16_t) STM32_READ_REG(p_ethx->MACMDIODR);
  }

  return HAL_OK;
}
/**
  * @}
  */

#if defined (USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @addtogroup ETH_Exported_Functions_Group13
  * @{
This subsection provides the Ethernet Bus Operation Function.
  - HAL_ETH_AcquireBus(): Acquire the Ethernet bus.
  - HAL_ETH_ReleaseBus(): Release the Ethernet bus.
  */
/**
  * @brief  Acquire exclusive access to the Ethernet bus (semaphore take).
  *
  * This function attempts to take the OS semaphore associated with the
  * Ethernet handle, in order to gain exclusive access to the Ethernet
  * peripheral (bus protection / mutual exclusion).
  *
  * The function:
  * - Verifies that @p heth is not @c NULL (with debug and optional runtime checks).
  * - Calls HAL_OS_SemaphoreTake() on @p heth->semaphore with the given
  *   timeout.
  * - Returns HAL_OK if the semaphore is successfully taken, or
  *   HAL_ERROR otherwise (e.g. timeout, OS error).
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         Ethernet configuration and the OS semaphore used for bus protection.
  * @param[in] timeout_ms
  *         Timeout value in milliseconds for acquiring the semaphore.
  *         The special values (e.g. blocking forever) depend on the
  *         underlying OS implementation of HAL_OS_SemaphoreTake.
  *
  * @note The caller must ensure that the Ethernet handle @p heth has been
  *       properly initialized and its @c semaphore member correctly created.
  * @note This function does not modify the hardware state of the Ethernet
  *       peripheral; it only manages synchronization via an OS semaphore.
  *
  * @retval HAL_OK
  *         The bus semaphore was successfully acquired within @p timeout_ms.
  * @retval HAL_ERROR
  *         The semaphore could not be acquired (e.g. timeout occurred or
  *         OS reported an error).
  * @retval HAL_INVALID_PARAM
  *         The @p heth parameter is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_ReleaseBus
  */
hal_status_t HAL_ETH_AcquireBus(hal_eth_handle_t *heth, uint32_t timeout_ms)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM((heth != NULL));
  if (HAL_OS_SemaphoreTake(&heth->semaphore, timeout_ms) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

