MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  return status;
}

/**
  * @brief  Release the Ethernet bus access semaphore.
  *
  * This function releases the OS semaphore associated with the Ethernet
  * handle, allowing other tasks/contexts to acquire the bus. It is typically
  * used to unlock access to the Ethernet peripheral after a protected
  * operation is completed.
  *
  * The function:
  * - Verifies that @p heth is not @c NULL (with debug and optional runtime checks).
  * - Calls HAL_OS_SemaphoreRelease() on @p heth->semaphore.
  * - Returns HAL_OK if the semaphore release succeeds, or HAL_ERROR
  *   otherwise.
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains the
  *         Ethernet configuration and the OS semaphore used for bus protection.
  *
  * @note The caller must ensure that the Ethernet handle @p heth has been
  *       properly initialized and its @c semaphore member correctly created.
  * @note This function does not change the hardware state of the Ethernet
  *       peripheral; it only manages synchronization via an OS semaphore.
  *
  * @retval HAL_OK
  *         The bus semaphore was successfully released.
  * @retval HAL_ERROR
  *         Error while releasing the semaphore (e.g. OS call failed).
  * @retval HAL_INVALID_PARAM
  *         The @p heth parameter is @c NULL (only when parameter checking is
  *         enabled via @c USE_HAL_CHECK_PARAM).
  *
  * @sa HAL_ETH_AcquireBus
  */
hal_status_t HAL_ETH_ReleaseBus(hal_eth_handle_t *heth)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(heth != NULL);
  if (HAL_OS_SemaphoreRelease(&heth->semaphore) == HAL_OS_OK)
  {
    status = HAL_OK;
  }

  return status;
}
/**
  * @}
  */
#endif /* USE_HAL_MUTEX && USE_HAL_MUTEX = 1 */

#if defined (USE_HAL_ETH_USER_DATA) && (USE_HAL_ETH_USER_DATA == 1)
/** @addtogroup ETH_Exported_Functions_Group14
  * @{
This subsection provides the Ethernet User Data Functions.
  - HAL_ETH_SetUserData(): Set user data pointer.
  - HAL_ETH_GetUserData(): Get user data pointer.
  */
/**
  * @brief  Set the user data pointer.
  *
  * This function associates an opaque user data pointer with the specified
  * Ethernet handle. The HAL does not interpret or modify the user data; it
  * is provided for application use (for example, to store context or state
  * information related to the Ethernet instance).
  *
  * @param[in,out] heth        Pointer to a @ref hal_eth_handle_t structure that
  *                            contains the configuration information for the
  *                            specified Ethernet peripheral.
  * @param[in]     p_user_data Pointer to user data to be associated with the
  *                            Ethernet handle. This pointer can be @c NULL.
  *
  * @pre @p heth must not be @c NULL.
  */
void HAL_ETH_SetUserData(hal_eth_handle_t *heth, const void *p_user_data)
{
  ASSERT_DBG_PARAM(heth != NULL);

  heth->p_user_data = p_user_data;
}

/**
  * @brief  Get the user data pointer.
  *
  * This function returns the user data pointer previously associated with
  * the specified Ethernet handle via @ref HAL_ETH_SetUserData.
  *
  * @param[in] heth Pointer to a @ref hal_eth_handle_t structure that
  *                 contains the configuration information for the
  *                 specified Ethernet peripheral.
  *
  * @pre @p heth must not be @c NULL.
  *
  * @retval Pointer to user data associated with the Ethernet handle, or
  *         @c NULL if no user data has been set.
  */
const void *HAL_ETH_GetUserData(const hal_eth_handle_t *heth)
{
  ASSERT_DBG_PARAM(heth != NULL);

  return heth->p_user_data;
}
/**
  * @}
  */
#endif /* USE_HAL_ETH_USER_DATA && USE_HAL_ETH_USER_DATA = 1 */

/** @addtogroup ETH_Private_Functions ETH Private Functions
  * @{
  */
/**
  * @brief  Initialize MAC registers with driver default values.
  * @param  heth Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  */
static void ETH_MAC_SetConfigDefault(struct hal_eth_handle_s *heth)
{
  hal_eth_mac_config_t mac_default_conf;

  mac_default_conf.link_config.speed = HAL_ETH_MAC_SPEED_100M;
  mac_default_conf.link_config.duplex_mode = HAL_ETH_MAC_FULL_DUPLEX_MODE;
  mac_default_conf.loopback_mode = HAL_ETH_MAC_LOOPBACK_DISABLE;
  mac_default_conf.src_addr_ctrl = HAL_ETH_MAC_SA_MAC0_REP;
  mac_default_conf.inter_pkt_gap_value = HAL_ETH_MAC_INTER_PKT_GAP_96_BIT;
  mac_default_conf.back_off_limit = HAL_ETH_MAC_BACK_OFF_LIMIT_10;
  mac_default_conf.preamble_length = HAL_ETH_MAC_PREAMBLE_LENGTH_7;
  mac_default_conf.giant_pkt_size_limit_ctrl = HAL_ETH_MAC_GPKT_SZ_LIMIT_DISABLE;
  mac_default_conf.support_2K_pkt = HAL_ETH_MAC_2K_PKT_LEN_DISABLE;
  mac_default_conf.crc_strip_type_pkt = HAL_ETH_MAC_CRC_STRIP_PKT_ENABLE;
  mac_default_conf.auto_pad_crc_strip = HAL_ETH_MAC_AUTO_PAD_CRC_S_ENABLE;
  mac_default_conf.tx_jabber = HAL_ETH_MAC_TX_JABBER_TIM_DISABLE;
  mac_default_conf.cs_before_transmit = HAL_ETH_MAC_CS_BEFORE_TR_DISABLE;
  mac_default_conf.cs_during_transmit = HAL_ETH_MAC_CS_DURING_TR_DISABLE;
  mac_default_conf.retry_transmission = HAL_ETH_MAC_RETRY_TR_ENABLE;
  mac_default_conf.rx_watchdog = HAL_ETH_MAC_RX_WD_TIM_DISABLE;
  mac_default_conf.rx_jumbo_pkt = HAL_ETH_MAC_RX_JUMBO_PKT_DISABLE;
  mac_default_conf.rx_csum_offload = HAL_ETH_MAC_RX_CSUM_PKT_ENABLE;
  mac_default_conf.rx_receive_own = HAL_ETH_MAC_RX_RECEIVE_OWN_ENABLE;
  mac_default_conf.crc_checking_rx_pkts = HAL_ETH_MAC_RX_CRC_PKT_CHK_ENABLE;
  mac_default_conf.deferral_check = HAL_ETH_MAC_DEFERRAL_CHECK_DISABLE;
  mac_default_conf.uc_slow_proto_detect = HAL_ETH_MAC_UC_SLOW_PROTO_DISABLE;
  mac_default_conf.slow_proto_detect = HAL_ETH_MAC_SLOW_PROTO_DISABLE;
  mac_default_conf.giant_pkt_size_limit = ETH_GIANT_PKT_SIZE_LIMIT_BYTE;
  mac_default_conf.ext_inter_pkt_gap_ctrl = HAL_ETH_MAC_E_INTER_PKT_GAP_DISABLE;
  mac_default_conf.ext_inter_pkt_gap = 0UL;
  mac_default_conf.programmable_wd = HAL_ETH_MAC_PROG_WD_DISABLE;
  mac_default_conf.rx_wd_timeout_byte = HAL_ETH_MAC_RX_WDT_2KB;
  mac_default_conf.tx_pause_time = 0UL;
  mac_default_conf.zero_quanta_pause = HAL_ETH_MAC_ZERO_Q_PAUSE_ENABLE;
  mac_default_conf.pause_low_threshold = HAL_ETH_MAC_PLT_MINUS_4_SLOT_TIME;
  mac_default_conf.tr_flow_ctrl = HAL_ETH_MAC_TR_FLOW_CTRL_DISABLE;
  mac_default_conf.uc_pause_pkt_detect = HAL_ETH_MAC_UC_PAUSE_PKT_DISABLE;
  mac_default_conf.receive_flow_ctrl = HAL_ETH_MAC_RECEIVE_FLOW_DISABLE;

  ETH_MAC_SetConfig(heth, &mac_default_conf);
}

/**
  * @brief  Apply MAC configuration to hardware registers.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  p_mac_conf Pointer to a hal_eth_mac_config_t structure containing MAC settings.
  */
static void ETH_MAC_SetConfig(const hal_eth_handle_t *heth, const hal_eth_mac_config_t *p_mac_conf)
{
  uint32_t macregval;
  ETH_TypeDef *p_ethx = ETH_GET_INSTANCE(heth);

  macregval = ((uint32_t)p_mac_conf->link_config.speed |
               (uint32_t)p_mac_conf->link_config.duplex_mode |
               (uint32_t)p_mac_conf->loopback_mode |
               (uint32_t)p_mac_conf->src_addr_ctrl |
               (uint32_t)p_mac_conf->inter_pkt_gap_value |
               (uint32_t)p_mac_conf->back_off_limit |
               (uint32_t)p_mac_conf->preamble_length |
               (uint32_t)p_mac_conf->giant_pkt_size_limit_ctrl |
               (uint32_t)p_mac_conf->support_2K_pkt |
               (uint32_t)p_mac_conf->crc_strip_type_pkt |
               (uint32_t)p_mac_conf->auto_pad_crc_strip |
               (uint32_t)p_mac_conf->tx_jabber |
               (uint32_t)p_mac_conf->cs_before_transmit |
               (uint32_t)p_mac_conf->cs_during_transmit |
               (uint32_t)p_mac_conf->retry_transmission |
               (uint32_t)p_mac_conf->rx_watchdog |
               (uint32_t)p_mac_conf->rx_jumbo_pkt |
               (uint32_t)p_mac_conf->rx_csum_offload |
               (uint32_t)p_mac_conf->rx_receive_own |
               (uint32_t)p_mac_conf->deferral_check);

  STM32_MODIFY_REG(p_ethx->MACCR, ETH_MACCR_MASK, macregval);

  macregval = ((uint32_t)p_mac_conf->crc_checking_rx_pkts |
               (uint32_t)p_mac_conf->uc_slow_proto_detect |
               (uint32_t)p_mac_conf->slow_proto_detect |
               (uint32_t)p_mac_conf->giant_pkt_size_limit |
               (uint32_t)p_mac_conf->ext_inter_pkt_gap_ctrl |
               (uint32_t)(p_mac_conf->ext_inter_pkt_gap << ETH_MACECR_EIPG_Pos));

  STM32_MODIFY_REG(p_ethx->MACECR, ETH_MACECR_MASK, macregval);

  macregval = ((uint32_t)p_mac_conf->programmable_wd |
               (uint32_t)p_mac_conf->rx_wd_timeout_byte);

  STM32_MODIFY_REG(p_ethx->MACWJBTR, ETH_MACWJBTR_MASK, macregval);

  macregval = ((uint32_t)(p_mac_conf->tx_pause_time << ETH_MACQTXFCR_PT_Pos) |
               (uint32_t)p_mac_conf->zero_quanta_pause |
               (uint32_t)p_mac_conf->pause_low_threshold |
               (uint32_t)p_mac_conf->tr_flow_ctrl);

  STM32_MODIFY_REG(p_ethx->MACQTXFCR, ETH_MACQTXFCR_MASK, macregval);

  macregval = ((uint32_t)p_mac_conf->uc_pause_pkt_detect |
               (uint32_t)p_mac_conf->receive_flow_ctrl);

