MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  STM32_MODIFY_REG(p_ethx->MACRXFCR, ETH_MACRXFCR_MASK, macregval);

  /* Enable MAC to provide the outer VLAN tag in the RX status */
  STM32_SET_BIT(p_ethx->MACVTR, ETH_MACVTR_EVLRXS);
}

/**
  * @brief  Initialize MTL registers with driver default values.
  * @param  heth Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  */
static void ETH_MTL_SetConfigDefault(struct hal_eth_handle_s *heth)
{
  hal_eth_mtl_config_t mtl_default_conf;

  mtl_default_conf.tx_fwd_status = HAL_ETH_MTL_TX_FWD_STATUS_ENABLE;

  ETH_MTL_SetConfig(heth, &mtl_default_conf);
}

/**
  * @brief  Apply MTL configuration to hardware registers.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  p_mtl_conf Pointer to a hal_eth_mtl_config_t structure containing MTL settings.
  */
static void ETH_MTL_SetConfig(hal_eth_handle_t *heth, const hal_eth_mtl_config_t *p_mtl_conf)
{
  uint32_t mtlregval;

  mtlregval = ((uint32_t) p_mtl_conf->tx_fwd_status);


  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->MTLOMR, ETH_MTLOMR_MASK, mtlregval);
}

/**
  * @brief  Initialize DMA registers with driver default values.
  * @param  heth Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  */
static void ETH_DMA_SetConfigDefault(struct hal_eth_handle_s *heth)
{
  hal_eth_dma_config_t dma_default_conf;

  dma_default_conf.addr_aligned_beats = HAL_ETH_DMA_ADDR_ALIGN_ENABLE;
  dma_default_conf.burst_mode = HAL_ETH_DMA_BURST_LEN_FIXED;
  dma_default_conf.mixed_burst = HAL_ETH_DMA_MIXED_BURST_MODE_ENABLED;
  dma_default_conf.rebuild_inc_burst = HAL_ETH_DMA_REBUILD_INC_BURST_ENABLED;
  dma_default_conf.tr_priority = HAL_ETH_DMA_TR_PRIO_ENABLE;

  ETH_DMA_SetConfig(heth, &dma_default_conf);
}

/**
  * @brief  Apply DMA configuration to hardware registers.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  p_dma_conf Pointer to a hal_eth_dma_config_t structure containing DMA settings.
  */
static void ETH_DMA_SetConfig(hal_eth_handle_t *heth, const hal_eth_dma_config_t *p_dma_conf)
{
  uint32_t dmaregval;

  dmaregval = (uint32_t) p_dma_conf->tr_priority;

  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->DMAMR, ETH_DMAMR_MASK, dmaregval);

  dmaregval = ((uint32_t) p_dma_conf->addr_aligned_beats |
               (uint32_t) p_dma_conf->mixed_burst |
               (uint32_t) p_dma_conf->rebuild_inc_burst |
               (uint32_t) p_dma_conf->burst_mode);

  STM32_MODIFY_REG(ETH_GET_INSTANCE(heth)->DMASBMR, ETH_DMASBMR_MASK, dmaregval);
}

/**
  * @brief  Initialize a Tx channel with default DMA and MTL settings.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  channel Channel index (zero-based)
  */
static void ETH_SetTxChannelDefaultConfig(hal_eth_handle_t *heth, uint32_t channel)
{
  hal_eth_dma_tx_channel_config_t dma_tx_channel_default_conf;
  hal_eth_mtl_tx_queue_config_t   mtl_tx_queue_default_conf;

  heth->tx_channels[channel].tx_desc_list.desc_len_byte = sizeof(eth_dma_descriptor_t);

  heth->tx_channels[channel].p_dma_instance = ETH_GET_DMA_CHANNEL(heth, channel);

  dma_tx_channel_default_conf.tx_pbl_x8_mode = HAL_ETH_DMA_TX_PBL_X8_DISABLE;
  dma_tx_channel_default_conf.tx_dma_burst_length = HAL_ETH_DMA_TX_BLEN_4_BEAT;
  dma_tx_channel_default_conf.tx_second_pkt_operate = HAL_ETH_DMA_TX_SEC_PKT_OP_DISABLE;

  ETH_DMA_SetConfigTxChannel(heth, channel, &dma_tx_channel_default_conf);

  heth->tx_channels[channel].p_mtl_instance = ETH_GET_MTL_QUEUE(heth, channel);

  mtl_tx_queue_default_conf.transmit_queue_mode = HAL_ETH_MTL_TX_Q_STORE_AND_FORWARD;
  mtl_tx_queue_default_conf.queue_op_mode = HAL_ETH_MTL_TX_QUEUE_ENABLED;
  mtl_tx_queue_default_conf.queue_size_byte = HAL_ETH_MTL_TX_QUEUE_SZ_2048_BYTE;

  ETH_MTL_SetConfigTxChannel(heth, channel, &mtl_tx_queue_default_conf);
}

/**
  * @brief  Configure DMA registers for a Tx channel.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  ch      Channel index (zero-based)
  * @param  p_dma_tx_ch_conf Pointer to hal_eth_dma_tx_channel_config_t containing channel DMA settings.
  */
static void ETH_DMA_SetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_dma_tx_channel_config_t *p_dma_tx_ch_conf)
{
  uint32_t dmaregval;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);

  dmaregval = ((uint32_t)p_dma_tx_ch_conf->tx_pbl_x8_mode);

  STM32_MODIFY_REG(p_dma_instance->DMACXCR, ETH_DMACCR_PBLX8, dmaregval);

  dmaregval = ((uint32_t) p_dma_tx_ch_conf->tx_dma_burst_length         |
               (uint32_t) p_dma_tx_ch_conf->tx_second_pkt_operate);

  STM32_MODIFY_REG(p_dma_instance->DMACXTXCR, (ETH_DMACTXCR_TXPBL | ETH_DMACTXCR_OSF), dmaregval);
}

/**
  * @brief  Retrieve current DMA Tx channel configuration from hardware registers.
  * @param  heth       Pointer to a hal_eth_handle_t structure (ETH handle)
  * @param  ch         Channel index
  * @param  p_dma_tx_ch_conf  Pointer to a hal_eth_dma_tx_channel_config_t structure to fill
  */
static void ETH_GetDMATxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_dma_tx_channel_config_t *p_dma_tx_ch_conf)
{
  const ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);

  p_dma_tx_ch_conf->tx_pbl_x8_mode = (hal_eth_dma_tx_pbl_x8_mode_ctrl_t)
                                     ((uint32_t)STM32_READ_BIT(p_dma_instance->DMACXCR, ETH_DMACCR_PBLX8));
  p_dma_tx_ch_conf->tx_dma_burst_length = (hal_eth_dma_tx_burst_length_t)
                                          ((uint32_t)STM32_READ_BIT(p_dma_instance->DMACXTXCR,
                                                                    ETH_DMACTXCR_TXPBL));
  p_dma_tx_ch_conf->tx_second_pkt_operate = (hal_eth_dma_tx_sec_pkt_op_ctrl_t)
                                            ((uint32_t)STM32_READ_BIT(p_dma_instance->DMACXTXCR,
                                                                      ETH_DMACTXCR_OSF));
}

/**
  * @brief  Configure MTL registers for a Tx queue.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  ch      Queue index (zero-based)
  * @param  p_mtl_tx_q_conf Pointer to hal_eth_mtl_tx_queue_config_t containing queue settings.
  */
static void ETH_MTL_SetConfigTxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_mtl_tx_queue_config_t *p_mtl_tx_q_conf)
{
  uint32_t mtlregval;

  ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_TX_INSTANCE(heth, ch);

  mtlregval = ((uint32_t) p_mtl_tx_q_conf->queue_op_mode)       |
              ((uint32_t) p_mtl_tx_q_conf->transmit_queue_mode) |
              ((uint32_t) p_mtl_tx_q_conf->queue_size_byte);

  STM32_MODIFY_REG(p_mtl_instance->MTLTXQXOMR, ETH_MTLTXQXOMR_MASK, mtlregval);

