MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
}

/**
  * @brief  Retrieve current MTL Tx queue configuration from hardware registers.
  * @param  heth      Pointer to a hal_eth_handle_t structure (ETH handle)
  * @param  ch        Queue index
  * @param  p_mtl_tx_q_conf Pointer to a hal_eth_mtl_tx_queue_config_t structure to fill
  */
static void ETH_GetMtlTxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_mtl_tx_queue_config_t *p_mtl_tx_q_conf)
{

  const ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_TX_INSTANCE(heth, ch);

  p_mtl_tx_q_conf->queue_op_mode        = (hal_eth_mtl_tx_ops_mode_t)
                                          ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLTXQXOMR,
                                                                    ETH_MTLTXQOMR_TXQEN));
  p_mtl_tx_q_conf->queue_size_byte      = (hal_eth_mtl_tx_queue_size_t)
                                          ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLTXQXOMR,
                                                                    ETH_MTLTXQOMR_TQS));
  p_mtl_tx_q_conf->transmit_queue_mode  = (hal_eth_mtl_tx_transmit_mode_t)
                                          ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLTXQXOMR,
                                                                    (ETH_MTLTXQOMR_TSF
                                                                     | ETH_MTLTXQOMR_TTC)));

}

/**
  * @brief  Initialize an Rx channel with default DMA and MTL settings.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  channel Channel index (zero-based)
  */
static void ETH_SetRxChannelDefaultConfig(hal_eth_handle_t *heth, uint32_t channel)
{
  hal_eth_dma_rx_channel_config_t dma_rx_channel_default_conf;
  hal_eth_mtl_rx_queue_config_t   mtl_rx_queue_default_conf;

  heth->rx_channels[channel].rx_desc_list.desc_len_byte = sizeof(eth_dma_descriptor_t);

  heth->rx_channels[channel].p_dma_instance = (void *)ETH_GET_DMA_CHANNEL(heth, channel);

  dma_rx_channel_default_conf.rx_dma_burst_length = HAL_ETH_DMA_RX_BLEN_4_BEAT;
  dma_rx_channel_default_conf.rx_buffer_len_byte = ETH_DMA_RX_BUFFER_SIZE_BYTE;

  ETH_DMA_SetConfigRxChannel(heth, channel, &dma_rx_channel_default_conf);

  heth->rx_channels[channel].p_mtl_instance = (void *)ETH_GET_MTL_QUEUE(heth, channel);

  mtl_rx_queue_default_conf.queue_op_mode = HAL_ETH_MTL_RX_QUEUE_ENABLED;
  mtl_rx_queue_default_conf.queue_size_byte = HAL_ETH_MTL_RX_QUEUE_SZ_2048_BYTE;
  mtl_rx_queue_default_conf.drop_tcp_ip_csum_error_pkt = HAL_ETH_MTL_RX_DROP_CS_ERR_ENABLE;
  mtl_rx_queue_default_conf.fwd_error_pkt = HAL_ETH_MTL_RX_FWD_ERR_PKT_DISABLE;
  mtl_rx_queue_default_conf.fwd_undersized_good_pkt = HAL_ETH_MTL_RX_FWD_USZ_PKT_ENABLE;
  mtl_rx_queue_default_conf.receive_queue_mode = HAL_ETH_MTL_RX_Q_STORE_AND_FORWARD;
  ETH_MTL_SetConfigRxChannel(heth, channel, &mtl_rx_queue_default_conf);
}

/**
  * @brief  Configure DMA registers for an Rx channel.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  ch      Channel index (zero-based)
  * @param  p_dma_rx_ch_conf Pointer to hal_eth_dma_rx_channel_config_t containing channel DMA settings.
  */
static void ETH_DMA_SetConfigRxChannel(hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_dma_rx_channel_config_t *p_dma_rx_ch_conf)
{
  uint32_t dmaregval;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);
  heth->rx_channels[ch].rx_buff_size_byte = p_dma_rx_ch_conf->rx_buffer_len_byte;
  dmaregval = ((uint32_t)(p_dma_rx_ch_conf->rx_dma_burst_length) |
               (uint32_t)(p_dma_rx_ch_conf->rx_buffer_len_byte << ETH_DMACRXCR_RBSZ_Pos));

  STM32_MODIFY_REG(p_dma_instance->DMACXRXCR,
                   (ETH_DMACRXCR_RXPBL | ETH_DMACRXCR_RPF | ETH_DMACRXCR_RBSZ),
                   dmaregval);
}

/**
  * @brief  Retrieve current DMA Rx channel configuration from hardware registers.
  * @param  heth       Pointer to a hal_eth_handle_t structure (ETH handle)
  * @param  ch         Channel index
  * @param  p_dma_rx_ch_conf  Pointer to a hal_eth_dma_rx_channel_config_t structure to fill
  */
static void ETH_GetDMARxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_dma_rx_channel_config_t *p_dma_rx_ch_conf)
{
  const ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);

  p_dma_rx_ch_conf->rx_dma_burst_length = (hal_eth_dma_rx_burst_length_t)
                                          ((uint32_t)STM32_READ_BIT(p_dma_instance->DMACXRXCR,
                                                                    ETH_DMACRXCR_RXPBL));
  p_dma_rx_ch_conf->rx_buffer_len_byte = (uint32_t)
                                         (STM32_READ_BIT(p_dma_instance->DMACXRXCR, ETH_DMACRXCR_RBSZ)
                                          >> ETH_DMACRXCR_RBSZ_Pos);
}

/**
  * @brief  Configure MTL registers for an Rx queue.
  * @param  heth    Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  * @param  ch      Queue index (zero-based)
  * @param  p_mtl_rx_q_conf Pointer to hal_eth_mtl_rx_queue_config_t containing queue settings.
  */
static void ETH_MTL_SetConfigRxChannel(const hal_eth_handle_t *heth, uint32_t ch,
                                       const hal_eth_mtl_rx_queue_config_t *p_mtl_rx_q_conf)
{
  uint32_t mtlregval;

  ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_RX_INSTANCE(heth, ch);

  mtlregval = ((uint32_t) p_mtl_rx_q_conf->queue_size_byte)       |
              ((uint32_t) p_mtl_rx_q_conf->drop_tcp_ip_csum_error_pkt) |
              ((uint32_t) p_mtl_rx_q_conf->fwd_error_pkt) |
              ((uint32_t) p_mtl_rx_q_conf->fwd_undersized_good_pkt) |
              ((uint32_t) p_mtl_rx_q_conf->receive_queue_mode);

  STM32_MODIFY_REG(p_mtl_instance->MTLRXQXOMR, ETH_MTLRXQXOMR_MASK, mtlregval);
}

/**
  * @brief  Retrieve current MTL Rx queue configuration from hardware registers.
  * @param  heth      Pointer to a hal_eth_handle_t structure (ETH handle)
  * @param  ch        Queue index (zero-based)
  * @param  p_mtl_rx_q_conf Pointer to a hal_eth_mtl_rx_queue_config_t structure to fill
  */
static void ETH_GetMtlRxChannelConfig(const hal_eth_handle_t *heth, uint32_t ch,
                                      hal_eth_mtl_rx_queue_config_t *p_mtl_rx_q_conf)
{
  const ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_RX_INSTANCE(heth, ch);

  /* Single RX queue: always enabled in hardware. */
  p_mtl_rx_q_conf->queue_op_mode = HAL_ETH_MTL_RX_QUEUE_ENABLED;
  p_mtl_rx_q_conf->queue_size_byte = (hal_eth_mtl_rx_queue_size_t)((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLRXQXOMR,
                                                                   ETH_MTLRXQOMR_RQS));
  p_mtl_rx_q_conf->drop_tcp_ip_csum_error_pkt = (hal_eth_mtl_rx_drop_cs_err_ctrl_t)
                                                ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLRXQXOMR,
                                                                          ETH_MTLRXQOMR_DIS_TCP_EF));
  p_mtl_rx_q_conf->fwd_error_pkt = (hal_eth_mtl_rx_fwd_err_pkt_ctrl_t)
                                   ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLRXQXOMR, ETH_MTLRXQOMR_FEP));
  p_mtl_rx_q_conf->fwd_undersized_good_pkt = (hal_eth_mtl_rx_fwd_usz_pkt_ctrl_t)
                                             ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLRXQXOMR,
                                                                       ETH_MTLRXQOMR_FUP));
  p_mtl_rx_q_conf->receive_queue_mode = (hal_eth_mtl_rx_queue_mode_t)
                                        ((uint32_t)STM32_READ_BIT(p_mtl_instance->MTLRXQXOMR,
                                                                  (ETH_MTLRXQOMR_RSF
                                                                   | ETH_MTLRXQOMR_RTC)));
}

/**
  * @brief  Execute the RX data handler for a channel.
  *
  * This routine walks the RX descriptor ring of the selected channel and
  * processes the descriptors that are no longer owned by the DMA engine.
  * For each available descriptor:
  * - If it is a context descriptor, it is cleared.
  * - Otherwise, packet metadata is extracted and the channel RX complete
  *   callback is invoked.
  * - The descriptor is then reset and the ring indexes/counters are updated.
  *
  * Cache maintenance is performed on the descriptor before it is inspected,
  * using the registered cache invalidate callback.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure.
  * @param[in]     ch   Zero-based RX channel index.
  *
  * @pre The RX channel lock must be held by the caller.
  * @pre The RX channel state must be @ref HAL_ETH_CHANNEL_STATE_ACTIVE or
  *      @ref HAL_ETH_CHANNEL_STATE_SUSPENDED.
  *
  * @retval 0UL             Processing completed for this channel.
  * @retval HAL_ETH_RX_CHANNEL_ID
  *         Processing of the TX channel was stopped because the TX complete
  *         callback execution failed; the channel can be processed again
  *         later.
  */
static uint32_t ETH_ExecRxDataHandler(hal_eth_handle_t *heth, uint32_t ch)
{
  uint32_t output_channel = 0UL;
  eth_dma_descriptor_t *p_dma_rx_desc = NULL;
  uint32_t rx_desc_idx = 0UL;
  uint32_t rx_total_used_desc = 0UL;
  uint32_t rx_process_completed = 0UL;

  rx_desc_idx = heth->rx_channels[ch].rx_desc_list.built_desc_id;
  rx_total_used_desc = heth->rx_channels[ch].rx_desc_list.buff_in_use;
  rx_process_completed = 0UL;

