MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  while ((rx_total_used_desc != 0UL) && (rx_process_completed == 0UL))
  {
    p_dma_rx_desc = ETH_GET_DESC_INDEX(heth->rx_channels[ch].rx_desc_list, rx_desc_idx);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_invalidate_cb(heth, ETH_GET_RX_CH_ID(ch), p_dma_rx_desc,
                                heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheInvalidateCallback(heth, ETH_GET_RX_CH_ID(ch),
                                    p_dma_rx_desc, heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

    /* OWN cleared means DMA completed write-back and CPU can consume descriptor. */
    if ((p_dma_rx_desc->desc3 & ETH_DMA_RX_DESC_WBF_OWN) == 0UL)
    {
      if ((p_dma_rx_desc->desc3 & ETH_DMA_RX_DESC_WBF_CTXT) != 0UL)
      {
        /* Context descriptors are metadata-only. */
        p_dma_rx_desc->desc0 = 0x0UL;
        p_dma_rx_desc->desc1 = 0x0UL;
        p_dma_rx_desc->desc2 = 0x0UL;
        p_dma_rx_desc->desc3 = 0x0UL;
      }
      else
      {
        hal_eth_rx_cb_pkt_data_t rx_pkt_data = {0};
        uint32_t rec_pkt_size = p_dma_rx_desc->desc3 & ETH_DMA_RX_DESC_WBF_PL;

        ETH_COPY_BITS(rx_pkt_data.status, (HAL_ETH_RX_STATUS_FD | HAL_ETH_RX_STATUS_LD), p_dma_rx_desc->desc3);
        if ((p_dma_rx_desc->desc3 & HAL_ETH_RX_STATUS_LD) != 0UL)
        {
          ETH_COPY_BITS(rx_pkt_data.status, (HAL_ETH_RX_STATUS_IPCB | HAL_ETH_RX_STATUS_IPV4
                                             | HAL_ETH_RX_STATUS_IPV6), p_dma_rx_desc->desc1);
          ETH_COPY_BITS(rx_pkt_data.status, HAL_ETH_RX_STATUS_ARPNR, p_dma_rx_desc->desc2);
          if ((p_dma_rx_desc->desc3 & HAL_ETH_RX_STATUS_VLAN) != 0UL)
          {
            ETH_COPY_BITS(rx_pkt_data.status, HAL_ETH_RX_STATUS_VLAN, p_dma_rx_desc->desc3);
            rx_pkt_data.vlan_tag_ids = p_dma_rx_desc->desc0;
          }
        }
        if ((p_dma_rx_desc->desc1 & (HAL_ETH_RX_STATUS_IPV4 | HAL_ETH_RX_STATUS_IPV6)) != 0UL)
        {
          ETH_COPY_BITS(rx_pkt_data.errors, HAL_ETH_RX_ERROR_IPH, p_dma_rx_desc->desc1);
        }
        ETH_COPY_BITS(rx_pkt_data.errors, HAL_ETH_RX_ERROR_IPC, p_dma_rx_desc->desc1);
        ETH_COPY_BITS(rx_pkt_data.errors, (HAL_ETH_RX_ERROR_DB | HAL_ETH_RX_ERROR_REC
                                           | HAL_ETH_RX_ERROR_OFL | HAL_ETH_RX_ERROR_RWT
                                           | HAL_ETH_RX_ERROR_GP | HAL_ETH_RX_ERROR_CRC), p_dma_rx_desc->desc3);
        rx_pkt_data.p_data = p_dma_rx_desc->p_app_data;

        if (heth->rx_channels[ch].p_rx_complete_cb(heth, ETH_GET_RX_CH_ID(ch),
                                                   p_dma_rx_desc->p_pkt_addr, rec_pkt_size, rx_pkt_data) != HAL_OK)
        {
          output_channel = ETH_GET_RX_CH_ID(ch);
          break;
        }
        ETH_ResetDMADesc(p_dma_rx_desc);
      }
      ETH_INCR_DESC_INDEX(rx_desc_idx, heth->rx_channels[ch].rx_desc_list.total_desc_cnt);
      rx_total_used_desc--;
    }
    else
    {
      /* Stop at first DMA-owned descriptor, following ones are not ready yet. */
      rx_process_completed = 1UL;
    }
  }
  heth->rx_channels[ch].rx_desc_list.buff_in_use = rx_total_used_desc;
  heth->rx_channels[ch].rx_desc_list.built_desc_id = rx_desc_idx;
  ETH_UpdateRxDesc(heth, ch);
  return output_channel;
}

/**
  * @brief  Initialize and start an Rx DMA channel.
  * @param  heth Pointer to a hal_eth_handle_t structure.
  * @param  ch   Zero-based Rx channel index.
  * @param  p_desc_mem Pointer to descriptor memory base address.
  * @param  desc_size_byte Total descriptor memory size in bytes.
  * @retval HAL_OK Channel started successfully.
  * @retval HAL_INVALID_PARAM Descriptor memory is smaller than one descriptor length.
  */
static hal_status_t ETH_StartRxChannel(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                       uint32_t desc_size_byte)
{
  ETH_STATES_CHECK_UPDATE(heth->rx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED,
                          HAL_ETH_CHANNEL_STATE_ACTIVE);

  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);

  /* Build and publish the RX ring before enabling DMA reception. */
  ETH_DMARxDescListInit(heth, ch, p_desc_mem, desc_size_byte);
  ETH_DMA_CHX_ENABLE_IT(p_dma_instance, (ETH_DMACIER_NIE | ETH_DMACIER_AIE
                                         | ETH_DMACIER_CDEE | ETH_DMACIER_FBEE
                                         | ETH_DMACIER_RIE | ETH_DMACIER_RBUE));

  STM32_SET_BIT(p_dma_instance->DMACXRXCR, ETH_DMACRXCR_SR);
  STM32_SET_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_RE);
  return HAL_OK;
}
/**
  * @brief  Stop an Rx DMA channel and disable MAC Rx if applicable.
  *
  * This routine disables the Rx DMA for the specified channel, recycles all
  * associated Rx descriptors, and if all Rx channels are stopped, it disables
  * the MAC receiver.
  *
  * @param  heth Pointer to a hal_eth_handle_t structure.
  * @param  ch   Zero-based Rx channel index.
  * @retval HAL_OK Channel stopped successfully.
  */
static hal_status_t ETH_StopRxChannel(hal_eth_handle_t *heth, uint32_t ch)
{
  uint32_t tick_start;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);

  STM32_CLEAR_BIT(p_dma_instance->DMACXRXCR, ETH_DMACRXCR_SR);

  tick_start = HAL_GetTick();
  while (ETH_DMA_GetRxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_RX_DMA_PROCESS_STOPPED)
  {
    if ((HAL_GetTick() - tick_start) > ETH_RX_DMA_STOP_TIMEOUT)
    {
      if (ETH_DMA_GetRxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_RX_DMA_PROCESS_STOPPED)
      {
        return HAL_ERROR;
      }
    }
  }

  /* Recycle descriptors once channel is stopped. */
  ETH_RecycleRxDesc(heth, ch);
  heth->rx_channels[ch].rx_desc_list.p_desc_list_addr = NULL;
  heth->rx_channels[ch].rx_desc_list.total_desc_cnt = 0UL;
  heth->rx_channels[ch].rx_desc_list.curr_desc_id = 0UL;
  heth->rx_channels[ch].rx_desc_list.built_desc_id = 0UL;
  heth->rx_channels[ch].rx_desc_list.buff_in_use = 0UL;

  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_RE);
  return HAL_OK;
}

/**
  * @brief  Stop a Tx DMA channel and flush its transmit queue.
  *
  * This routine disables the Tx DMA for the specified channel, waits for the
  * corresponding MTL Tx queue to become empty within the configured timeout,
  * then recycles all Tx descriptors. If all Tx channels are stopped after this
  * operation, the MAC transmitter is also disabled.
  *
  * @param  heth Pointer to a hal_eth_handle_t structure.
  * @param  ch   Zero-based Tx channel index.
  * @retval HAL_OK    Channel stopped successfully.
  * @retval HAL_ERROR Timeout occurred while flushing the Tx queue.
  */
static hal_status_t ETH_StopTxChannel(hal_eth_handle_t *heth, uint32_t ch)
{
  uint32_t tick_start;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);
  ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_TX_INSTANCE(heth, ch);

  /* Request TX DMA stop first, then wait for the process state machine to settle. */
  STM32_CLEAR_BIT(p_dma_instance->DMACXTXCR, ETH_DMACTXCR_ST);

  tick_start = HAL_GetTick();
  while (ETH_DMA_GetTxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_TX_DMA_PROCESS_STOPPED)
  {
    if ((HAL_GetTick() - tick_start) > ETH_TX_DMA_STOP_TIMEOUT)
    {
      if (ETH_DMA_GetTxProcessState(ETH_GET_INSTANCE(heth), ch) != ETH_TX_DMA_PROCESS_STOPPED)
      {
        return HAL_ERROR;
      }
    }
  }

  /* Flush remaining queue data so no stale packets are left in MTL after DMA stop. */
  STM32_SET_BIT(p_mtl_instance->MTLTXQXOMR, ETH_MTLTXQOMR_FTQ);
  tick_start = HAL_GetTick();
  while (STM32_READ_BIT(p_mtl_instance->MTLTXQXOMR, ETH_MTLTXQOMR_FTQ) != 0UL)
  {
    if ((HAL_GetTick() - tick_start) > ETH_TX_Q_FLUSH_TIMEOUT)
    {
      if (STM32_READ_BIT(p_mtl_instance->MTLTXQXOMR, ETH_MTLTXQOMR_FTQ) != 0UL)
      {
        return HAL_ERROR;
      }
    }
  }

  /* Recycle descriptors after DMA/MTL drain. */
  ETH_RecycleTxDesc(heth, ch);
  heth->tx_channels[ch].tx_desc_list.p_desc_list_addr = NULL;
  heth->tx_channels[ch].tx_desc_list.total_desc_cnt = 0UL;
  heth->tx_channels[ch].tx_desc_list.curr_desc_id = 0UL;
  heth->tx_channels[ch].tx_desc_list.built_desc_id = 0UL;
  heth->tx_channels[ch].tx_desc_list.buff_in_use = 0UL;

  STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_TE);
  return HAL_OK;
}


/**
  * @brief  Retrieve Tx DMA process state for a channel.
  * @param  p_ethx Pointer to ETH peripheral instance.
  * @param  ch    Zero-based Tx channel index.
  * @retval eth_tx_dma_process_state_t Current Tx DMA process state.
  */
static eth_tx_dma_process_state_t ETH_DMA_GetTxProcessState(const ETH_TypeDef *p_ethx, uint32_t ch)
{
  uint32_t process_masked;
  uint32_t process_pos;
  eth_tx_dma_process_state_t state;

  if (ch <= ETH_TX_DMA_CH_STATE_MAX_IDX)
  {
    process_masked = (uint32_t)STM32_READ_BIT(p_ethx->DMADSR,
                                              (ETH_DMADSR_TPS0 << (ETH_TPS_FIELD_WIDTH_BITS * (ch))));
    process_pos = (ETH_DMADSR_TPS0_Pos + (ETH_TPS_FIELD_WIDTH_BITS * (ch)));
    state = (eth_tx_dma_process_state_t)((uint32_t)(process_masked >> process_pos));
  }
  else
  {
    state = ETH_TX_DMA_PROCESS_UNKNOWN;
  }
  return state;
}

/**
  * @brief  Retrieve Rx DMA process state for a channel.
  * @param  p_ethx Pointer to ETH peripheral instance.
  * @param  ch    Zero-based Rx channel index.
  * @retval eth_rx_dma_process_state_t Current Rx DMA process state.
  */
static eth_rx_dma_process_state_t ETH_DMA_GetRxProcessState(const ETH_TypeDef *p_ethx, uint32_t ch)
{
  uint32_t process_masked;
  uint32_t process_pos;
  eth_rx_dma_process_state_t state;

  process_masked = (uint32_t)STM32_READ_BIT(p_ethx->DMADSR,
                                            (ETH_DMADSR_RPS0 << (ETH_RPS_FIELD_WIDTH_BITS * (ch))));
  process_pos = (ETH_DMADSR_RPS0_Pos + (ETH_RPS_FIELD_WIDTH_BITS * (ch)));
  state = (eth_rx_dma_process_state_t)((uint32_t)(process_masked >> process_pos));

  return state;
}

/**
  * @brief  Abort and reset an Rx DMA channel.
  *
  * Stops the Rx DMA engine for the specified channel, recycles all
  * channel descriptors and clears the software descriptor bookkeeping.
  *
  * @param  heth Pointer to the HAL ETH handle. Must not be NULL.
  * @param  ch   Rx channel identifier
  */
static void ETH_AbortRxChannel(hal_eth_handle_t *heth, uint32_t ch)
{
  if (heth->rx_channels[ch].rx_desc_list.p_desc_list_addr != NULL)
  {
    /* Abort path favors immediate shutdown over graceful wait loops. */
    STM32_CLEAR_BIT(ETH_DMA_GET_RX_INSTANCE(heth, ch)->DMACXRXCR, ETH_DMACRXCR_SR);
    STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_RE);
    ETH_DMA_CHX_DISABLE_IT(ETH_DMA_GET_RX_INSTANCE(heth, ch), (ETH_DMACIER_NIE | ETH_DMACIER_AIE
                                                               | ETH_DMACIER_CDEE | ETH_DMACIER_FBEE
                                                               | ETH_DMACIER_RIE | ETH_DMACIER_RBUE));
    ETH_RecycleRxDesc(heth, ch);
    heth->rx_channels[ch].rx_desc_list.p_desc_list_addr = NULL;
    heth->rx_channels[ch].rx_desc_list.total_desc_cnt = 0UL;
    heth->rx_channels[ch].rx_desc_list.curr_desc_id = 0UL;
    heth->rx_channels[ch].rx_desc_list.built_desc_id = 0UL;
    heth->rx_channels[ch].rx_desc_list.buff_in_use = 0UL;
  }
}
/**
  * @brief  Abort and reset a Tx DMA channel.
  *
  * Stops the Tx DMA engine for the specified channel, flushes the MTL
  * transmit queue, recycles all channel descriptors and clears the software
  * descriptor bookkeeping.
  * @param  heth Pointer to the HAL ETH handle.
  * @param  ch   Tx channel identifier
  */
static void ETH_AbortTxChannel(hal_eth_handle_t *heth, uint32_t ch)
{
  if (heth->tx_channels[ch].tx_desc_list.p_desc_list_addr != NULL)
  {
    /* Abort path forcibly stops DMA/MTL and then recycles software descriptors. */
    STM32_CLEAR_BIT(ETH_DMA_GET_TX_INSTANCE(heth, ch)->DMACXTXCR, ETH_DMACTXCR_ST);
    STM32_SET_BIT(ETH_MTL_GET_TX_INSTANCE(heth, ch)->MTLTXQXOMR, ETH_MTLTXQOMR_FTQ);
    STM32_CLEAR_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_TE);
    ETH_DMA_CHX_DISABLE_IT(ETH_DMA_GET_TX_INSTANCE(heth, ch), (ETH_DMACIER_NIE | ETH_DMACIER_AIE
                                                               | ETH_DMACIER_CDEE | ETH_DMACIER_FBEE
                                                               | ETH_DMACIER_TIE));
    ETH_RecycleTxDesc(heth, ch);
    heth->tx_channels[ch].tx_desc_list.p_desc_list_addr = NULL;
    heth->tx_channels[ch].tx_desc_list.total_desc_cnt = 0UL;
    heth->tx_channels[ch].tx_desc_list.curr_desc_id = 0UL;
    heth->tx_channels[ch].tx_desc_list.built_desc_id = 0UL;
    heth->tx_channels[ch].tx_desc_list.buff_in_use = 0UL;
  }
}

/**
  * @brief  Reset a DMA descriptor to its default state.
  *
  * This clears descriptor words and backup pointers so the descriptor can be
  * reused by the driver or re-initialized prior to programming for DMA.
  *
  * @param  p_dma_tx_desc Pointer to the DMA descriptor to reset
  */
static void ETH_ResetDMADesc(eth_dma_descriptor_t *p_dma_tx_desc)
{
  p_dma_tx_desc->desc0 = 0x0UL;
  p_dma_tx_desc->desc1 = 0x0UL;
  p_dma_tx_desc->desc2 = 0x0UL;
  p_dma_tx_desc->desc3 = 0x0UL;
  p_dma_tx_desc->p_pkt_addr = NULL;
  p_dma_tx_desc->p_app_data = NULL;
}

/**
  * @brief  Update RX descriptor attach application buffers.
  * @param  heth Pointer to HAL ETH handle
  * @param  ch   RX channel index
  */
static void ETH_UpdateRxDesc(hal_eth_handle_t *heth, uint32_t ch)
{
  uint32_t rx_desc_idx        = heth->rx_channels[ch].rx_desc_list.curr_desc_id;
  uint32_t rx_total_used_desc = heth->rx_channels[ch].rx_desc_list.buff_in_use;
  eth_dma_descriptor_t *p_dma_rx_desc = NULL;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);

  while (rx_total_used_desc < heth->rx_channels[ch].rx_desc_list.total_desc_cnt)
  {
    p_dma_rx_desc = ETH_GET_DESC_INDEX(heth->rx_channels[ch].rx_desc_list, rx_desc_idx);

    if (p_dma_rx_desc->p_pkt_addr == NULL)
    {
      void *p_rx_buffer = NULL;
      void *p_app_context = NULL;

