MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
      heth->rx_channels[ch].p_rx_allocate_cb(heth, ETH_GET_RX_CH_ID(ch),
                                             heth->rx_channels[ch].rx_buff_size_byte, &p_rx_buffer,
                                             &p_app_context);
      if (p_rx_buffer != NULL)
      {
        p_dma_rx_desc->desc0 = ETH_CAST_PTR_TO_U32(p_rx_buffer);
        p_dma_rx_desc->p_pkt_addr = p_rx_buffer;
        p_dma_rx_desc->p_app_data = p_app_context;
      }
      else
      {
        /* No buffer available, keep remaining descriptors untouched for a later refill pass. */
        break;
      }
    }
    else
    {
      p_dma_rx_desc->desc0 = ETH_CAST_PTR_TO_U32(p_dma_rx_desc->p_pkt_addr);
    }
    STM32_SET_BIT(p_dma_rx_desc->desc3, ETH_DMA_RX_DESC_RF_BUF1V);
    ETH_SetRxFifoEvent(heth, ch, p_dma_rx_desc);

    /* Publish descriptor then hand off ownership to DMA */
    __DMB();

    STM32_SET_BIT(p_dma_rx_desc->desc3, ETH_DMA_RX_DESC_RF_OWN);

    /* Flush descriptor cache so DMA sees updated descriptor content and OWN bit. */
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_flush_cb(heth, ETH_GET_RX_CH_ID(ch), p_dma_rx_desc,
                           heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheFlushCallback(heth, ETH_GET_RX_CH_ID(ch), p_dma_rx_desc,
                               heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

    ETH_INCR_DESC_INDEX(rx_desc_idx, heth->rx_channels[ch].rx_desc_list.total_desc_cnt);
    rx_total_used_desc++;
  }
  /* Ensure all descriptor writes/flushes complete before DMA kicks DMA via RXDTPR. */
  __DSB();
  STM32_WRITE_REG(p_dma_instance->DMACXRXDTPR, 0UL);

  heth->rx_channels[ch].rx_desc_list.curr_desc_id = rx_desc_idx;
  heth->rx_channels[ch].rx_desc_list.buff_in_use = rx_total_used_desc;
}

/**
  * @brief  Request and program DMA descriptors for a TX packet.
  *
  * Prepares one or more DMA TX descriptors for the provided packet buffers
  * and notifies the DMA engine to start transmission.
  *
  * @param  heth         Pointer to HAL ETH handle
  * @param  ch           TX channel index (zero-based)
  * @param  p_eth_buffer Pointer to an array of buffer descriptors containing data pointers and lengths
  * @param  buffer_count Number of buffers in p_eth_buffer
  * @param  p_tx_conf    Pointer to TX packet configuration (VLAN/CSUM/notify etc.)
  * @retval HAL_OK       Descriptors programmed and DMA notified successfully
  * @retval HAL_BUSY     Not enough free descriptors available to queue the packet
  */
static hal_status_t ETH_RequestTxDMA(hal_eth_handle_t *heth, uint32_t ch, hal_eth_buffer_t *p_eth_buffer,
                                     uint32_t buffer_count, hal_eth_tx_pkt_config_t *p_tx_conf)
{
  eth_dma_descriptor_t *p_dma_tx_desc = NULL;
  uint32_t desc_idx = 0UL;
  ETH_DMA_Channel_TypeDef *p_dma_instance = NULL;
  ETH_TypeDef *p_ethx = NULL;
  uint32_t needed_desc_cnt = buffer_count;

  p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);
  p_ethx = ETH_GET_INSTANCE(heth);

  if ((p_tx_conf->attributes & (HAL_ETH_TX_PKT_CTRL_VLANTAG | HAL_ETH_TX_PKT_CTRL_INNERVLANTAG)) != 0UL)
  {
    /* VLAN/inner-VLAN control requires one extra context descriptor before data descriptors. */
    needed_desc_cnt++;
  }
  if (needed_desc_cnt >
      (heth->tx_channels[ch].tx_desc_list.total_desc_cnt - heth->tx_channels[ch].tx_desc_list.buff_in_use))
  {
    return HAL_BUSY;
  }
  desc_idx = heth->tx_channels[ch].tx_desc_list.curr_desc_id;
  p_dma_tx_desc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, desc_idx);

  /*****************    Context descriptor configuration *****************************/
  if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_VLANTAG) != 0UL)
  {
    ETH_COPY_BITS(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_VT, p_tx_conf->vlan_tag_id);
    STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_VLTV);
    /* Set the descriptor as the vlan input source */
    STM32_SET_BIT(p_ethx->MACVIR, ETH_MACVIR_VLTI);
  }
  if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_INNERVLANTAG) != 0UL)
  {
    ETH_COPY_BITS(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_CTXT_IVT, (p_tx_conf->inner_vlan_tag_id << 16U));
    ETH_COPY_BITS(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_IVTIR, (uint32_t)p_tx_conf->inner_vlan_ctrl);
    STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_IVLTV);
    /* Set the descriptor as the inner vlan input source */
    STM32_SET_BIT(p_ethx->MACIVIR, ETH_MACIVIR_VLTI);
    /* Enable double VLAN processing */
    STM32_SET_BIT(p_ethx->MACVTR, ETH_MACVTR_EDVLP);
  }
  if ((p_tx_conf->attributes & (HAL_ETH_TX_PKT_CTRL_VLANTAG | HAL_ETH_TX_PKT_CTRL_INNERVLANTAG)) != 0UL)
  {
    /* Set as context descriptor */
    STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_CTXT);

    /* Publish descriptor then hand off ownership to DMA */
    __DMB();
    STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_CTXT_OWN);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_flush_cb(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                           heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheFlushCallback(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                               heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
    heth->tx_channels[ch].tx_desc_list.buff_in_use++;
    ETH_INCR_DESC_INDEX(desc_idx, heth->tx_channels[ch].tx_desc_list.total_desc_cnt);
    p_dma_tx_desc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, desc_idx);
  }

  /*****************    Normal descriptors configuration     ******************************/
  STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_FD);
  /* Check for CRC Padding feature, Valid only for first descriptor */
  if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_CRCPAD) != 0UL)
  {
    ETH_COPY_BITS(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_CPC, (uint32_t)p_tx_conf->crc_pad_ctrl);
  }
  for (uint32_t index = 0; index < buffer_count; index++)
  {
    p_dma_tx_desc->desc0 = ETH_CAST_PTR_TO_U32(p_eth_buffer[index].p_buffer);
    ETH_COPY_BITS(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_RF_B1L, p_eth_buffer[index].len_byte);
    p_dma_tx_desc->p_pkt_addr = p_eth_buffer[index].p_buffer;
    p_dma_tx_desc->p_app_data = p_tx_conf->p_data;
    /* Check CSUM feature */
    if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_CSUM) != 0UL)
    {
      ETH_COPY_BITS(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_CIC, (uint32_t)p_tx_conf->csum_ctrl);
    }
    /* Check source address insertion/replacement */
    if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_SAIC) != 0UL)
    {
      ETH_COPY_BITS(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_SAIC, (uint32_t)p_tx_conf->src_addr_ctrl);
    }
    /* Check for VLAN Tag feature */
    if ((p_tx_conf->attributes & HAL_ETH_TX_PKT_CTRL_VLANTAG) != 0UL)
    {
      ETH_COPY_BITS(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_RF_VTIR, (uint32_t)p_tx_conf->vlan_ctrl);
    }
    if (index == (buffer_count - 1UL))
    {
      /* Last application buffer, closes frame and sets notification policy. */
      STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_LD);
      ETH_SetTxFifoEvent(heth, ch, p_dma_tx_desc, p_tx_conf->notify);
    }

