MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
    /* Publish descriptor then hand off ownership to DMA (OWN last). */
    __DMB();
    STM32_SET_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_OWN);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_flush_cb(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                           heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheFlushCallback(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                               heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

    /* Ensure descriptor publication is complete before DMA kicks */
    __DSB();

    /* TXDTPR write kicks DMA if it was waiting. */
    STM32_WRITE_REG(p_dma_instance->DMACXTXDTPR, 0UL);

    ETH_INCR_DESC_INDEX(desc_idx, heth->tx_channels[ch].tx_desc_list.total_desc_cnt);
    p_dma_tx_desc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, desc_idx);
    heth->tx_channels[ch].tx_desc_list.buff_in_use++;
  }
  heth->tx_channels[ch].tx_desc_list.curr_desc_id = desc_idx;
  return HAL_OK;
}

/**
  * @brief  Execute the TX data handler for a channel.
  *
  * This routine walks the TX descriptor ring of the selected channel and
  * processes the descriptors that are no longer owned by the DMA engine.
  * For each available descriptor:
  * - If it corresponds to a context/auxiliary descriptor (no packet address),
  *   it is reset.
  * - Otherwise, the channel TX complete callback is invoked with the
  *   transmitted packet address and status/error information, then the
  *   descriptor is reset.
  *
  * Cache maintenance is performed on the descriptor before it is inspected,
  * using the registered cache invalidate callback.
  *
  * @param[in,out] heth Pointer to a @ref hal_eth_handle_t structure.
  * @param[in]     ch   Zero-based TX channel index.
  *
  * @retval 0UL             Processing completed for this channel.
  * @retval HAL_ETH_TX_CHANNEL_ID
  *         Processing of the TX channel was stopped because the TX complete
  *         callback execution failed; the channel can be processed again
  *         later.
  */
static uint32_t ETH_ExecTxDataHandler(hal_eth_handle_t *heth, uint32_t ch)
{
  uint32_t output_channel = 0UL;
  eth_dma_descriptor_t *p_dma_tx_desc = NULL;
  uint32_t tx_desc_idx = 0UL;
  uint32_t tx_total_used_desc = 0UL;
  uint32_t tx_process_completed = 0UL;

  tx_desc_idx = heth->tx_channels[ch].tx_desc_list.built_desc_id;
  tx_total_used_desc = heth->tx_channels[ch].tx_desc_list.buff_in_use;
  tx_process_completed = 0UL;

  while ((tx_total_used_desc != 0UL) && (tx_process_completed == 0UL))
  {
    p_dma_tx_desc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, tx_desc_idx);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_invalidate_cb(heth, ETH_GET_TX_CH_ID(ch),
                                p_dma_tx_desc, heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheInvalidateCallback(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                                    heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

    if ((p_dma_tx_desc->desc3 & ETH_DMA_TX_DESC_RF_OWN) == 0UL)
    {
      if (p_dma_tx_desc->p_pkt_addr == NULL)
      {
        /* Context descriptor: recycle, no packet callback. */
        ETH_ResetDMADesc(p_dma_tx_desc);
      }
      else
      {
        hal_eth_tx_cb_pkt_data_t tx_cb_pkt_data = {0};

        ETH_COPY_BITS(tx_cb_pkt_data.status, (HAL_ETH_TX_STATUS_FD | HAL_ETH_TX_STATUS_LD), p_dma_tx_desc->desc3);
        ETH_COPY_BITS(tx_cb_pkt_data.errors, (HAL_ETH_TX_ERROR_IH | HAL_ETH_TX_ERROR_ED | HAL_ETH_TX_ERROR_EC
                                              | HAL_ETH_TX_ERROR_LC | HAL_ETH_TX_ERROR_NC | HAL_ETH_TX_ERROR_LOC
                                              | HAL_ETH_TX_ERROR_PC | HAL_ETH_TX_ERROR_JT), p_dma_tx_desc->desc3);
        tx_cb_pkt_data.p_data = p_dma_tx_desc->p_app_data;

        if (heth->tx_channels[ch].p_tx_complete_cb(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc->p_pkt_addr,
                                                   tx_cb_pkt_data) != HAL_OK)
        {
          /* Callback asked to stop, report channel for deferred completion handling. */
          output_channel = ETH_GET_TX_CH_ID(ch);
          break;
        }
        ETH_ResetDMADesc(p_dma_tx_desc);
      }
      ETH_INCR_DESC_INDEX(tx_desc_idx, heth->tx_channels[ch].tx_desc_list.total_desc_cnt);
      tx_total_used_desc--;
    }
    else
    {
      /* Stop at first DMA-owned descriptor, following ones are not ready yet. */
      tx_process_completed = 1UL;
    }
  }

  heth->tx_channels[ch].tx_desc_list.buff_in_use = tx_total_used_desc;
  heth->tx_channels[ch].tx_desc_list.built_desc_id = tx_desc_idx;
  return output_channel;
}

/**
  * @brief  Initialize and start a Tx DMA channel.
  * @param  heth Pointer to a hal_eth_handle_t structure.
  * @param  ch   Zero-based Tx channel index.
  * @param  p_desc_mem Pointer to descriptor memory base address.
  * @param  desc_size_byte Total descriptor memory size in bytes.
  * @retval HAL_OK Channel started successfully.
  * @retval HAL_INVALID_PARAM Descriptor memory is smaller than one descriptor length.
  */
static hal_status_t ETH_StartTxChannel(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                       uint32_t desc_size_byte)
{
  ETH_STATES_CHECK_UPDATE(heth->tx_channels[ch].channel_state, (uint32_t)HAL_ETH_CHANNEL_STATE_CONFIGURED,
                          HAL_ETH_CHANNEL_STATE_ACTIVE);

  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);
  ETH_MTL_Queue_TypeDef *p_mtl_instance = ETH_MTL_GET_TX_INSTANCE(heth, ch);

  ETH_DMATxDescListInit(heth, ch, p_desc_mem, desc_size_byte);

  /* Flush any leftover queue state so TX starts cleanly. */
  STM32_SET_BIT(p_mtl_instance->MTLTXQXOMR, ETH_MTLTXQOMR_FTQ);
  STM32_SET_BIT(p_dma_instance->DMACXTXCR, ETH_DMACTXCR_ST);
  STM32_CLEAR_BIT(p_dma_instance->DMACXSR, (ETH_DMACSR_TPS));
  ETH_DMA_CHX_ENABLE_IT(p_dma_instance, (ETH_DMACIER_NIE | ETH_DMACIER_AIE | ETH_DMACIER_CDEE
                                         | ETH_DMACIER_FBEE | ETH_DMACIER_TIE));
  STM32_SET_BIT(ETH_GET_INSTANCE(heth)->MACCR, ETH_MACCR_TE);
  return HAL_OK;
}

/**
  * @brief  Configure RX descriptor FIFO event (interrupt) conditions.
  *
  * Depending on the channel FIFO event mode this will set the IOC bit on the
  * descriptor to generate an interrupt on completion or implement cyclic
  * counting behavior.
  *
  * @param  heth         Pointer to HAL ETH handle
  * @param  ch           RX channel index (zero-based)
  * @param  p_dma_rx_desc Pointer to the DMA RX descriptor to update
  */
static void ETH_SetRxFifoEvent(hal_eth_handle_t *heth, uint32_t ch, eth_dma_descriptor_t *p_dma_rx_desc)
{
  switch (heth->rx_channels[ch].fifo_event_config.event_mode)
  {
    case HAL_ETH_FIFO_EVENT_ALWAYS :
    {
      STM32_SET_BIT(p_dma_rx_desc->desc3, ETH_DMA_RX_DESC_RF_IOC);
      break;
    }
    case HAL_ETH_FIFO_EVENT_CYCLIC :
    {
      if (heth->rx_channels[ch].event_cnt >= heth->rx_channels[ch].fifo_event_config.event_params)
      {
        STM32_SET_BIT(p_dma_rx_desc->desc3, ETH_DMA_RX_DESC_RF_IOC);
        heth->rx_channels[ch].event_cnt = 0UL;
      }
      heth->rx_channels[ch].event_cnt++;
      break;
    }
    case HAL_ETH_FIFO_EVENT_NONE :
    default:
      break;
  }
}

/**
  * @brief  Configure TX descriptor FIFO event (interrupt) conditions.
  *
  * Depending on the channel FIFO event mode this will set the IOC bit on the
  * descriptor or force an interrupt when the packet requests notification.
  *
  * @param  heth       Pointer to HAL ETH handle
  * @param  ch         TX channel index (zero-based)
  * @param  p_dma_tx_desc Pointer to the DMA TX descriptor to update
  * @param  pkt_notify Packet notification control flags
  */
static void ETH_SetTxFifoEvent(hal_eth_handle_t *heth, uint32_t ch, eth_dma_descriptor_t *p_dma_tx_desc,
                               hal_eth_tx_pkt_notify_ctrl_t pkt_notify)
{
  switch (heth->tx_channels[ch].fifo_event_config.event_mode)
  {
    case HAL_ETH_FIFO_EVENT_ALWAYS :
    {
      STM32_SET_BIT(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_RF_IOC);
      break;
    }
    case HAL_ETH_FIFO_EVENT_CYCLIC :
    {
      if (heth->tx_channels[ch].event_cnt >= heth->tx_channels[ch].fifo_event_config.event_params)
      {
        STM32_SET_BIT(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_RF_IOC);
        heth->tx_channels[ch].event_cnt = 0;
      }
      else if (pkt_notify == HAL_ETH_TX_PKT_NOTIFY_ENABLE)
      {
        STM32_SET_BIT(p_dma_tx_desc->desc2, ETH_DMA_TX_DESC_RF_IOC);
      }
      else
      {
        heth->tx_channels[ch].event_cnt++;
      }
      break;
    }
    case HAL_ETH_FIFO_EVENT_NONE :
    default:
      break;
  }
}

/**
  * @brief  Initialize the DMA TX descriptor list for a channel.
  *
  * Sets the descriptor list address, computes the ring size, resets each
  * descriptor and programs the DMA channel descriptor pointers.
  *
  * @param  heth           Pointer to HAL ETH handle
  * @param  ch             TX channel index (zero-based)
  * @param  p_desc_mem     Pointer to the descriptor memory area
  * @param  total_mem_size_byte Size in bytes of the total descriptor memory area
  */
static void ETH_DMATxDescListInit(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                  uint32_t total_mem_size_byte)
{
  eth_dma_descriptor_t *p_dma_txdesc;
  uint32_t i;
  uint32_t skip_length = 0UL;
  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_TX_INSTANCE(heth, ch);

  heth->tx_channels[ch].tx_desc_list.p_desc_list_addr = p_desc_mem;
  heth->tx_channels[ch].tx_desc_list.total_desc_cnt = ETH_GET_DESC_CNT(total_mem_size_byte,
                                                                       heth->tx_channels[ch].tx_desc_list);
  heth->tx_channels[ch].tx_desc_list.curr_desc_id = 0UL;
  heth->tx_channels[ch].tx_desc_list.built_desc_id = 0UL;
  heth->tx_channels[ch].tx_desc_list.buff_in_use = 0UL;

