MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  skip_length = ETH_GET_SKIPLEN_SIZE(heth->tx_channels[ch].tx_desc_list.desc_len_byte,
                                     sizeof(eth_dma_descriptor_t));
  STM32_MODIFY_REG(p_dma_instance->DMACXCR, ETH_DMACCR_DSL, skip_length);

  for (i = 0; i < heth->tx_channels[ch].tx_desc_list.total_desc_cnt; i++)
  {
    p_dma_txdesc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, i);
    ETH_ResetDMADesc(p_dma_txdesc);
  }

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  heth->p_cache_flush_cb(heth, ETH_GET_TX_CH_ID(ch),
                         heth->tx_channels[ch].tx_desc_list.p_desc_list_addr, total_mem_size_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
  HAL_ETH_CacheFlushCallback(heth, ETH_GET_TX_CH_ID(ch),
                             heth->tx_channels[ch].tx_desc_list.p_desc_list_addr, total_mem_size_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

  STM32_WRITE_REG(p_dma_instance->DMACXTXRLR, (heth->tx_channels[ch].tx_desc_list.total_desc_cnt - 1UL));
  STM32_WRITE_REG(p_dma_instance->DMACXTXDLAR, (uint32_t) heth->tx_channels[ch].tx_desc_list.p_desc_list_addr);
}

/**
  * @brief  Initialize the DMA RX descriptor list for a channel.
  *
  * Sets the descriptor list address, computes the ring size, resets each
  * descriptor, updates RX descriptors with application buffers and programs
  * the DMA channel descriptor pointers.
  *
  * @param  heth           Pointer to HAL ETH handle
  * @param  ch             RX channel index (zero-based)
  * @param  p_desc_mem     Pointer to the descriptor memory area
  * @param  total_mem_size_byte Size in bytes of the total descriptor memory area
  */
static void ETH_DMARxDescListInit(hal_eth_handle_t *heth, uint32_t ch, uint32_t *p_desc_mem,
                                  uint32_t total_mem_size_byte)
{
  eth_dma_descriptor_t *p_dma_rxdesc;
  uint32_t i;
  uint32_t skip_length = 0UL;

  ETH_DMA_Channel_TypeDef *p_dma_instance = ETH_DMA_GET_RX_INSTANCE(heth, ch);
  heth->rx_channels[ch].rx_desc_list.p_desc_list_addr = p_desc_mem;
  heth->rx_channels[ch].rx_desc_list.total_desc_cnt = ETH_GET_DESC_CNT(total_mem_size_byte,
                                                                       heth->rx_channels[ch].rx_desc_list);
  heth->rx_channels[ch].rx_desc_list.curr_desc_id = 0UL;
  heth->rx_channels[ch].rx_desc_list.built_desc_id = 0UL;
  heth->rx_channels[ch].rx_desc_list.buff_in_use = 0UL;

  skip_length = ETH_GET_SKIPLEN_SIZE(heth->rx_channels[ch].rx_desc_list.desc_len_byte,
                                     sizeof(eth_dma_descriptor_t));
  STM32_MODIFY_REG(p_dma_instance->DMACXCR, ETH_DMACCR_DSL, skip_length);

  for (i = 0; i < heth->rx_channels[ch].rx_desc_list.total_desc_cnt; i++)
  {
    p_dma_rxdesc = ETH_GET_DESC_INDEX(heth->rx_channels[ch].rx_desc_list, i);
    ETH_ResetDMADesc(p_dma_rxdesc);
  }

  ETH_UpdateRxDesc(heth, ch);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  heth->p_cache_flush_cb(heth, ETH_GET_RX_CH_ID(ch),
                         heth->rx_channels[ch].rx_desc_list.p_desc_list_addr, total_mem_size_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
  HAL_ETH_CacheFlushCallback(heth, ETH_GET_RX_CH_ID(ch),
                             heth->rx_channels[ch].rx_desc_list.p_desc_list_addr, total_mem_size_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
  /* DMA can fetch descriptors as soon as started, ensure descriptor writes are committed first. */
  __DSB();
  STM32_WRITE_REG(p_dma_instance->DMACXRXRLR, (heth->rx_channels[ch].rx_desc_list.total_desc_cnt - 1UL));
  STM32_WRITE_REG(p_dma_instance->DMACXRXDLAR, (uint32_t) heth->rx_channels[ch].rx_desc_list.p_desc_list_addr);
  STM32_WRITE_REG(p_dma_instance->DMACXRXDTPR,
                  (uint32_t)(ETH_GET_DESC_INDEX((heth->rx_channels[ch].rx_desc_list),
                                                (heth->rx_channels[ch].rx_desc_list.total_desc_cnt - 1UL))));
}

/**
  * @brief  Recycle RX descriptors and invoke RX complete callbacks.
  *
  * This function walks the list of built RX descriptors, invokes the
  * channel RX complete callback for each received packet (or context), then
  * resets the descriptor so it can be reused by the DMA engine.
  *
  * @param  heth Pointer to HAL ETH handle
  * @param  ch   RX channel index (zero-based)
  */
static void ETH_RecycleRxDesc(hal_eth_handle_t *heth, uint32_t ch)
{
  eth_dma_descriptor_t *p_dma_rx_desc;
  uint32_t pkt_size = 0;
  uint32_t rx_desc_idx        = heth->rx_channels[ch].rx_desc_list.built_desc_id;
  uint32_t rx_total_used_desc = heth->rx_channels[ch].rx_desc_list.buff_in_use;
  while (rx_total_used_desc != 0UL)
  {
    hal_eth_rx_cb_pkt_data_t rx_pkt_data = {0};
    p_dma_rx_desc = ETH_GET_DESC_INDEX(heth->rx_channels[ch].rx_desc_list, rx_desc_idx);
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    heth->p_cache_invalidate_cb(heth, ETH_GET_RX_CH_ID(ch), p_dma_rx_desc,
                                heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheInvalidateCallback(heth, ETH_GET_RX_CH_ID(ch),
                                    p_dma_rx_desc, heth->rx_channels[ch].rx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
    if (STM32_READ_BIT(p_dma_rx_desc->desc3, (ETH_DMA_RX_DESC_WBF_OWN | ETH_DMA_RX_DESC_WBF_CTXT)) != 0UL)
    {
      /* Descriptor is not valid data payload for upper layer, report as invalid packet status. */
      STM32_SET_BIT(rx_pkt_data.status, HAL_ETH_RX_STATUS_INVALID);
      pkt_size = heth->rx_channels[ch].rx_buff_size_byte;
    }
    else
    {
      pkt_size = STM32_READ_BIT(p_dma_rx_desc->desc3, ETH_DMA_RX_DESC_WBF_PL);
      if (STM32_READ_BIT(p_dma_rx_desc->desc3, HAL_ETH_RX_STATUS_LD) != 0UL)
      {
        ETH_COPY_BITS(rx_pkt_data.status, (HAL_ETH_RX_STATUS_IPCB | HAL_ETH_RX_STATUS_IPV4 |
                                           HAL_ETH_RX_STATUS_IPV6), p_dma_rx_desc->desc1);
        ETH_COPY_BITS(rx_pkt_data.status, HAL_ETH_RX_STATUS_ARPNR, p_dma_rx_desc->desc2);
        ETH_COPY_BITS(rx_pkt_data.status, HAL_ETH_RX_STATUS_VLAN, p_dma_rx_desc->desc3);
        if (STM32_READ_BIT(p_dma_rx_desc->desc3, HAL_ETH_RX_STATUS_VLAN) != 0UL)
        {
          ETH_COPY_BITS(rx_pkt_data.status, HAL_ETH_RX_STATUS_VLAN, p_dma_rx_desc->desc3);
          rx_pkt_data.vlan_tag_ids =  p_dma_rx_desc->desc0;
        }
      }
      if (STM32_READ_BIT(p_dma_rx_desc->desc1, (HAL_ETH_RX_STATUS_IPV4 | HAL_ETH_RX_STATUS_IPV6)) != 0UL)
      {
        if (STM32_READ_BIT(p_dma_rx_desc->desc1, HAL_ETH_RX_ERROR_IPH) != 0UL)
        {
          ETH_COPY_BITS(rx_pkt_data.errors, HAL_ETH_RX_ERROR_IPH, p_dma_rx_desc->desc1);
        }
      }
      ETH_COPY_BITS(rx_pkt_data.errors, HAL_ETH_RX_ERROR_IPC, p_dma_rx_desc->desc1);
      ETH_COPY_BITS(rx_pkt_data.errors, (HAL_ETH_RX_ERROR_DB | HAL_ETH_RX_ERROR_REC
                                         | HAL_ETH_RX_ERROR_OFL | HAL_ETH_RX_ERROR_RWT
                                         | HAL_ETH_RX_ERROR_GP | HAL_ETH_RX_ERROR_CRC), p_dma_rx_desc->desc3);
    }
    rx_pkt_data.p_data = p_dma_rx_desc->p_app_data;
    heth->rx_channels[ch].p_rx_complete_cb(heth, ETH_GET_RX_CH_ID(ch), p_dma_rx_desc->p_pkt_addr,
                                           pkt_size, rx_pkt_data);
    ETH_ResetDMADesc(p_dma_rx_desc);

    ETH_INCR_DESC_INDEX(rx_desc_idx, heth->rx_channels[ch].rx_desc_list.total_desc_cnt);
    rx_total_used_desc--;
  }
  heth->rx_channels[ch].rx_desc_list.buff_in_use = 0UL;
  heth->rx_channels[ch].rx_desc_list.built_desc_id = 0UL;
  heth->rx_channels[ch].rx_desc_list.curr_desc_id = 0UL;
}

/**
  * @brief  Recycle TX descriptors and invoke TX complete callbacks.
  *
  * This function walks the list of built TX descriptors, invokes the
  * channel TX complete callback for each transmitted packet, then
  * resets the descriptor so it can be reused by the DMA engine.
  *
  * @param  heth Pointer to HAL ETH handle
  * @param  ch   TX channel index (zero-based)
  */
static void ETH_RecycleTxDesc(hal_eth_handle_t *heth, uint32_t ch)
{
  eth_dma_descriptor_t *p_dma_tx_desc;
  uint32_t tx_desc_idx        = heth->tx_channels[ch].tx_desc_list.built_desc_id;
  uint32_t tx_total_used_desc = heth->tx_channels[ch].tx_desc_list.buff_in_use;

  while (tx_total_used_desc != 0UL)
  {
    p_dma_tx_desc = ETH_GET_DESC_INDEX(heth->tx_channels[ch].tx_desc_list, tx_desc_idx);

#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
    /* Invalidate descriptor cache before checking TX completion in recycle path. */
    heth->p_cache_invalidate_cb(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                                heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#else  /* USE_HAL_ETH_REGISTER_CALLBACKS */
    HAL_ETH_CacheInvalidateCallback(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc,
                                    heth->tx_channels[ch].tx_desc_list.desc_len_byte);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

