MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
    if (p_dma_tx_desc->p_pkt_addr == NULL)
    {
      ETH_ResetDMADesc(p_dma_tx_desc);
    }
    else
    {
      hal_eth_tx_cb_pkt_data_t tx_cb_pkt_data = {0};
      if (STM32_READ_BIT(p_dma_tx_desc->desc3, ETH_DMA_TX_DESC_RF_OWN) != 0UL)
      {
        /* DMA still owns descriptor at recycle time, report invalid completion status. */
        STM32_SET_BIT(tx_cb_pkt_data.status, HAL_ETH_TX_STATUS_INVALID);
      }
      else
      {
        ETH_COPY_BITS(tx_cb_pkt_data.status, HAL_ETH_TX_STATUS_FD | HAL_ETH_TX_STATUS_LD, p_dma_tx_desc->desc3);
        ETH_COPY_BITS(tx_cb_pkt_data.errors, (HAL_ETH_TX_ERROR_IH | HAL_ETH_TX_ERROR_ED
                                              | HAL_ETH_TX_ERROR_EC | HAL_ETH_TX_ERROR_LC
                                              | HAL_ETH_TX_ERROR_NC | HAL_ETH_TX_ERROR_LOC
                                              | HAL_ETH_TX_ERROR_PC | HAL_ETH_TX_ERROR_JT), p_dma_tx_desc->desc3);
      }
      tx_cb_pkt_data.p_data = p_dma_tx_desc->p_app_data;
      heth->tx_channels[ch].p_tx_complete_cb(heth, ETH_GET_TX_CH_ID(ch), p_dma_tx_desc->p_pkt_addr, tx_cb_pkt_data);
      ETH_ResetDMADesc(p_dma_tx_desc);
    }

    ETH_INCR_DESC_INDEX(tx_desc_idx, heth->tx_channels[ch].tx_desc_list.total_desc_cnt);
    tx_total_used_desc--;
  }
  heth->tx_channels[ch].tx_desc_list.buff_in_use = 0UL;
  heth->tx_channels[ch].tx_desc_list.built_desc_id = 0UL;
  heth->tx_channels[ch].tx_desc_list.curr_desc_id = 0UL;
}

/**
  * @brief  Configure the MDIO clock range according to the AHB bus (HCLK) frequency.
  *
  * This static helper sets the MDIO clock divider in the @c MACMDIOAR register so that
  * the resulting MDIO clock stays within the valid range for the Ethernet PHY.
  *
  * The function:
  * - Reads the current @c MACMDIOAR register value.
  * - Clears the CSR Clock Range (CR) bits.
  * - Retrieves the current HCLK frequency via HAL_RCC_GetHCLKFreq().
  * - Selects the appropriate divider (e.g. @ref ETH_MDC_CLK_DIV_16, @ref ETH_MDC_CLK_DIV_26, ...)
  *   depending on the HCLK range.
  * - Writes back the updated value to @c MACMDIOAR.
  *
  * The mapping between HCLK frequency and divider is:
  * - @c hclk < 35 MHz             --> @ref ETH_MDC_CLK_DIV_16
  * -  35 MHz <= @c hclk < 60 MHz  --> @ref ETH_MDC_CLK_DIV_26
  * -  60 MHz <= @c hclk < 100 MHz --> @ref ETH_MDC_CLK_DIV_42
  * - 100 MHz <= @c hclk < 150 MHz --> @ref ETH_MDC_CLK_DIV_62
  * - 150 MHz <= @c hclk < 250 MHz --> @ref ETH_MDC_CLK_DIV_102
  * - 250 MHz <= @c hclk < 300 MHz --> @ref ETH_MDC_CLK_DIV_124
  * - 300 MHz <= @c hclk < 500 MHz --> @ref ETH_MDC_CLK_DIV_204
  * - @c hclk >= 500 MHz           --> @ref ETH_MDC_CLK_DIV_324
  *
  * @param[in] heth
  *         Pointer to an @ref hal_eth_handle_t structure that contains
  *         the configuration information for the Ethernet peripheral.
  *
  * @note The MDIO clock must not exceed the maximum frequency specified
  *       in the PHY datasheet (typically around 2.5 MHz). This function
  *       chooses the divider to satisfy that requirement based on HCLK.
  * @note The caller must ensure that @p heth is valid and that the
  *       Ethernet peripheral clock configuration is already set.
  */
static void ETH_SetMDIOClockRange(hal_eth_handle_t *heth)
{
  uint32_t hclk;
  uint32_t tmpreg;

  tmpreg = STM32_READ_REG(ETH_GET_INSTANCE(heth)->MACMDIOAR);

  tmpreg &= ~ETH_MACMDIOAR_CR;

  hclk = HAL_RCC_GetHCLKFreq();

  tmpreg |= ETH_GetMDIOClockRange(hclk);
  STM32_WRITE_REG(ETH_GET_INSTANCE(heth)->MACMDIOAR, tmpreg);
}

/**
  * @brief Get the MDIO clock range (ETH_MACMDIOAR.CR) for a given HCLK frequency.
  *
  * Computes the CSR clock range field (CR) that configures the MDC frequency
  * derived from the system HCLK. The selected configuration targets the
  * highest possible MDC frequency within the allowed bounds
  * [ETH_MDC_CLK_MIN_HZ .. ETH_MDC_CLK_MAX_HZ].
  *
  * @param eth_hclk_freq HCLK frequency in Hz.
  * @retval MDIO CSR clock range encoding to be OR-ed into ETH_MACMDIOAR.
  */
static uint32_t ETH_GetMDIOClockRange(uint32_t eth_hclk_freq)
{
  uint32_t mdc_cr_sel = ETH_MDIOAR_CSR_CR_SEL_0;
  uint32_t mdc_clk;

  const eth_mdio_clk_div_t eth_mdio_clk_div_lut[] =
  {
    {ETH_MDIOAR_CSR_CR_SEL_2,   ETH_MDC_CLK_DIV_16},
    {ETH_MDIOAR_CSR_CR_SEL_3,   ETH_MDC_CLK_DIV_26},
    {ETH_MDIOAR_CSR_CR_SEL_0,   ETH_MDC_CLK_DIV_42},
    {ETH_MDIOAR_CSR_CR_SEL_1,   ETH_MDC_CLK_DIV_62},
    {ETH_MDIOAR_CSR_CR_SEL_4,   ETH_MDC_CLK_DIV_102},
    {ETH_MDIOAR_CSR_CR_SEL_5,   ETH_MDC_CLK_DIV_124},
    {ETH_MDIOAR_CSR_CR_SEL_6,   ETH_MDC_CLK_DIV_204},
    {ETH_MDIOAR_CSR_CR_SEL_7,   ETH_MDC_CLK_DIV_324}
  };

  const uint32_t clk_lut_size = (uint32_t)(sizeof(eth_mdio_clk_div_lut) / sizeof(eth_mdio_clk_div_lut[0]));

  for (uint32_t clk_index = 0UL; clk_index < clk_lut_size; clk_index++)
  {
    /* Validate this divider keeps MDC within the allowed range. */
    mdc_clk = eth_hclk_freq / eth_mdio_clk_div_lut[clk_index].clk_range_div;

    if ((mdc_clk >= ETH_MDC_CLK_MIN_HZ) && (mdc_clk <= ETH_MDC_CLK_MAX_HZ))
    {
      mdc_cr_sel = eth_mdio_clk_div_lut[clk_index].clk_range_sel;
      break;
    }
  }

  return mdc_cr_sel;
}

/**
  * @brief  Retrieve the zero-based TX channel index corresponding to a channel bitmask.
  *
  * @param  p_tx_ch   Pointer that will receive the channel index (output)
  * @param  channel Channel mask containing the selected TX channel bit(s) (input).
  *
  * @note   channel parameter must be a single TX channel bitmask of @ref ETH_Channel_Identifiers.
  */
__STATIC_INLINE void ETH_GetTXChIndex(uint32_t *p_tx_ch, uint32_t channel)
{
  *p_tx_ch = HAL_ETH_TX_Q0;
  for (uint32_t ch_index = 0; ch_index < USE_HAL_ETH_MAX_TX_CH_NB; ch_index++)
  {
    if ((channel & ETH_GET_TX_CH_ID(ch_index)) != 0UL)
    {
      *p_tx_ch = ch_index;
      break;
    }
  }
}
/**
  * @brief  Retrieve the zero-based RX channel index corresponding to a channel mask.
  *
  * @param  p_rx_ch   Pointer that will receive the channel index (output)
  * @param  channel Channel mask containing the selected RX channel bit(s) (input).
  *
  * @note   channel parameter must be a single RX channel bitmask of @ref ETH_Channel_Identifiers.
  */
__STATIC_INLINE void ETH_GetRXChIndex(uint32_t *p_rx_ch, uint32_t channel)
{
  *p_rx_ch = HAL_ETH_RX_Q0;
  for (uint32_t ch_index = 0; ch_index < USE_HAL_ETH_MAX_RX_CH_NB; ch_index++)
  {
    if (((channel) & ETH_GET_RX_CH_ID(ch_index)) != 0UL)
    {
      *p_rx_ch = ch_index;
      break;
    }
  }
}

/**
  * @brief  Acquire channel lock (spinlock) for exclusive access.
  *
  * Attempts to set the lock state to `ETH_CHANNEL_STATE_LOCKED`. When
  * `USE_HAL_ETH_ATOMIC_CHANNEL_LOCK` is enabled, atomic exclusive access
  * (LDREX/STREX) and memory barriers are used to protect the update.
  *
  * @param  p_channel_lock_state Pointer to the channel lock state variable
  * @retval HAL_OK   Lock acquired.
  * @retval HAL_BUSY Lock already held by another context.
  */
__STATIC_INLINE hal_status_t ETH_LockChannel(volatile uint32_t *p_channel_lock_state)
{
#if defined(USE_HAL_ETH_ATOMIC_CHANNEL_LOCK) && (USE_HAL_ETH_ATOMIC_CHANNEL_LOCK == 1)
  __DMB();
  do
  {
    if (__LDREXW(p_channel_lock_state) == ETH_CHANNEL_STATE_LOCKED)
    {
      /* Clear exclusive monitor before returning. */
      STM32_CLREX_TO_DEPRECATE(); /* Workaround linked to CMSIS IAR issue EWARM-11901 correction fix */
      return HAL_BUSY;
    }
  } while (__STREXW(ETH_CHANNEL_STATE_LOCKED, p_channel_lock_state) != 0UL);
  __DMB();
#else /* USE_HAL_ETH_ATOMIC_CHANNEL_LOCK */
  STM32_UNUSED(p_channel_lock_state);
#endif /* USE_HAL_ETH_ATOMIC_CHANNEL_LOCK */

  return HAL_OK;
}

/**
  * @brief  Release channel lock (spinlock).
  *
  * Sets the lock state back to `ETH_CHANNEL_STATE_UNLOCKED` when atomic
  * locking is enabled. When `USE_HAL_ETH_ATOMIC_CHANNEL_LOCK` is disabled,
  * this function is a no-op.
  * @param  p_channel_lock_state Pointer to the channel lock state variable
  */
__STATIC_INLINE void ETH_UnlockChannel(volatile uint32_t *p_channel_lock_state)
{
#if defined(USE_HAL_ETH_ATOMIC_CHANNEL_LOCK) && (USE_HAL_ETH_ATOMIC_CHANNEL_LOCK == 1)
  *p_channel_lock_state = ETH_CHANNEL_STATE_UNLOCKED;
#else /* USE_HAL_ETH_ATOMIC_CHANNEL_LOCK */
  STM32_UNUSED(p_channel_lock_state);
#endif /* USE_HAL_ETH_ATOMIC_CHANNEL_LOCK */
}

/**
  * @brief  Align descriptor size to an application-requested alignment.
  *
  * Computes the smallest descriptor size, in bytes, that is a multiple of
  * @p app_req_size and large enough to contain one `eth_dma_descriptor_t`.
  * The additional padding must not exceed the hardware skip-length capability
  * derived from `ETH_DMACCR_DSL`.
  *
  * @param  app_req_size Requested alignment in bytes. Must be non-zero and a multiple
  *                      of `ETH_BUS_DATA_WIDTH_BYTE`.
  * @param  p_desc_size  Output pointer that receives the aligned descriptor size in bytes
  *
  * @retval HAL_OK       Alignment computed successfully and stored in @p p_desc_size
  * @retval HAL_ERROR    Invalid @p app_req_size or alignment would exceed the DMA
  *                      skip-length limit.
  */
static hal_status_t ETH_AlignDescSize(uint32_t app_req_size, uint32_t *p_desc_size)
{
  uint32_t num_blocks;
  uint32_t skiplen_size;
  uint32_t total_desc_size;
  const uint32_t desc_struct_size = (uint32_t)sizeof(eth_dma_descriptor_t);

