MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_eth.c
  if ((app_req_size == 0UL) || (((app_req_size % ((uint32_t)ETH_BUS_DATA_WIDTH_BYTE)) != 0UL)
                                && (app_req_size != 1UL)))
  {
    return HAL_ERROR;
  }
  num_blocks = (desc_struct_size + app_req_size - 1UL) / app_req_size;
  total_desc_size = num_blocks * app_req_size;
  skiplen_size = ETH_GET_SKIPLEN_SIZE(total_desc_size, desc_struct_size);
  if ((skiplen_size & ((uint32_t)~(ETH_DMACCR_DSL))) != 0UL)
  {
    return HAL_ERROR;
  }
  *p_desc_size = total_desc_size;

  return HAL_OK;
}
/**
  * @brief  Get the interrupt pending bit for the Ethernet Wakeup External line.
  *
  * This function checks the External Rising Pending Register 2 (RPR2) and
  * Falling Pending Register 2 (FPR2) to determine which edge(s) have
  * triggered a pending interrupt for the Ethernet Wakeup External line.
  *
  * @note   The function returns one of the following values:
  *         - LL_EXTI_TRIGGER_NONE: No pending trigger.
  *         - LL_EXTI_TRIGGER_RISING: Rising edge trigger is pending.
  *         - LL_EXTI_TRIGGER_FALLING: Falling edge trigger is pending.
  *         - LL_EXTI_TRIGGER_RISING_FALLING: Both rising and falling edge triggers are pending.
  *
  * @retval hal_eth_wakeup_trigger_t
  *         The pending trigger flag(s) for the Ethernet Wakeup External line.
  */
__STATIC_INLINE uint32_t ETH_WakeupGetPendingIT(void)
{
  uint32_t pending_edge = LL_EXTI_TRIGGER_NONE;

  if (LL_EXTI_IsActiveRisingFlag_32_63(ETH_WAKEUP_EXTI_LINE) != 0UL)
  {
    pending_edge = LL_EXTI_TRIGGER_RISING;
  }

  if (LL_EXTI_IsActiveFallingFlag_32_63(ETH_WAKEUP_EXTI_LINE) != 0UL)
  {
    pending_edge |= LL_EXTI_TRIGGER_FALLING;
  }
  return pending_edge;
}
/**
  * @brief  Clear the pending interrupt flag(s) for the Ethernet Wakeup External line.
  *
  * This function clears the pending interrupt flag(s) for the Ethernet Wakeup External line
  * based on the specified edge(s). It writes to the External Rising Pending Register 2 (RPR2)
  * and/or Falling Pending Register 2 (FPR2) to clear the corresponding pending bits.
  *
  * @param  edge  Specifies which edge(s) to clear pending flags for.
  *               This parameter can be one or a combination of the following values:
  *               - LL_EXTI_TRIGGER_RISING:   Clear rising edge pending flag.
  *               - LL_EXTI_TRIGGER_FALLING:  Clear falling edge pending flag.
  *               - LL_EXTI_TRIGGER_RISING_FALLING: Clear both rising and falling edge pending flags.
  */
__STATIC_INLINE void ETH_WakeupClearPendingIT(uint32_t edge)
{
  if ((edge & LL_EXTI_TRIGGER_RISING) != 0UL)
  {
    LL_EXTI_ClearRisingFlag_32_63(ETH_WAKEUP_EXTI_LINE);
  }

  if ((edge & LL_EXTI_TRIGGER_FALLING) != 0UL)
  {
    LL_EXTI_ClearFallingFlag_32_63(ETH_WAKEUP_EXTI_LINE);
  }
}
#if defined (USE_HAL_ETH_REGISTER_CALLBACKS) && (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
/**
  * @brief  Initialize the callbacks to their default values.
  * @param  heth Pointer to a hal_eth_handle_t structure which contains the ETH instance.
  */
static void ETH_InitCommonCallbacksToDefault(hal_eth_handle_t *heth)
{
  heth->p_data_cb                 = HAL_ETH_DataCallback;             /* Legacy weak Data callback   */
  heth->p_error_cb                = HAL_ETH_ErrorCallback;            /* Legacy weak ErrorCallback   */
  heth->p_event_cb                = HAL_ETH_EventCallback;            /* Legacy weak EventCallback   */
  heth->p_pmt_cb                  = HAL_ETH_PMTCallback;              /* Legacy weak PMTCallback      */
  heth->p_eee_cb                  = HAL_ETH_EEECallback;              /* Legacy weak EEECallback      */
  heth->p_wake_up_cb              = HAL_ETH_WakeUpCallback;           /* Legacy weak WakeUpCallback   */
  heth->p_cache_invalidate_cb     = HAL_ETH_CacheInvalidateCallback;  /* Legacy weak CacheInvalidateCallback   */
  heth->p_cache_flush_cb          = HAL_ETH_CacheFlushCallback;       /* Legacy weak CachecleanCallback   */
}

/**
  * @brief  Initialize the Tx channel callbacks to their default values.
  * @param  hchannel Pointer to a hal_eth_tx_channel_handle_t structure which contains the Tx channel instance.
  */
static void ETH_InitTxCallbacksToDefault(hal_eth_tx_channel_handle_t *hchannel)
{
  hchannel->p_ch_event_cb      = HAL_ETH_TxEventCallback;   /* Legacy weak ErrorCallback    */
}

/**
  * @brief  Initialize the Rx channel callbacks to their default values.
  * @param  hchannel Pointer to a hal_eth_rx_channel_handle_t structure which contains the Rx channel instance.
  */
static void ETH_InitRxCallbacksToDefault(hal_eth_rx_channel_handle_t *hchannel)
{
  hchannel->p_ch_event_cb      = HAL_ETH_RxEventCallback;   /* Legacy weak ErrorCallback    */
}
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_ETH_MODULE */
#endif /* ETH1 */

/**
  * @}
  */
